
// 基于高德地图数据制作
const ADJACENCY = {
    // ==================== 北京市 ====================
    "东城区": ["西城区", "朝阳区（北京市）", "丰台区"],
    "西城区": ["东城区", "朝阳区（北京市）", "丰台区", "海淀区"],
    "朝阳区（北京市）": ["东城区", "西城区", "丰台区", "海淀区", "通州区（北京市）", "顺义区", "昌平区", "大兴区"],
    "丰台区": ["东城区", "西城区", "朝阳区（北京市）", "石景山区", "海淀区", "门头沟区", "房山区", "大兴区"],
    "石景山区": ["丰台区", "海淀区", "门头沟区"],
    "海淀区": ["西城区", "朝阳区（北京市）", "丰台区", "石景山区", "门头沟区", "昌平区"],
    "门头沟区": ["丰台区", "石景山区", "海淀区", "房山区", "昌平区", "涞水县", "怀来县", "涿鹿县"],
    "房山区": ["丰台区", "门头沟区", "大兴区", "涞水县", "涿州市"],
    "通州区（北京市）": ["朝阳区（北京市）", "顺义区", "大兴区", "武清区", "广阳区", "香河县", "大厂回族自治县", "三河市"],
    "顺义区": ["朝阳区（北京市）", "通州区（北京市）", "昌平区", "怀柔区", "平谷区", "密云区", "三河市"],
    "昌平区": ["朝阳区（北京市）", "海淀区", "门头沟区", "顺义区", "怀柔区", "延庆区", "怀来县"],
    "大兴区": ["朝阳区（北京市）", "丰台区", "房山区", "通州区（北京市）", "涿州市", "广阳区", "固安县"],
    "怀柔区": ["顺义区", "昌平区", "密云区", "延庆区", "赤城县", "滦平县", "丰宁满族自治县"],
    "平谷区": ["顺义区", "密云区", "蓟州区", "兴隆县", "三河市"],
    "密云区": ["顺义区", "怀柔区", "平谷区", "承德县", "兴隆县", "滦平县"],
    "延庆区": ["昌平区", "怀柔区", "怀来县", "赤城县"],

    
    // ==================== 天津市 ====================
    "和平区（天津市）": ["河东区（天津市）", "河西区", "南开区", "河北区"],
    "河东区（天津市）": ["和平区（天津市）", "河西区", "河北区", "东丽区", "涉县"],
    "河西区": ["和平区（天津市）", "河东区（天津市）", "南开区", "东丽区", "西青区", "津南区"],
    "南开区": ["和平区（天津市）", "河西区", "河北区", "红桥区", "西青区"],
    "河北区": ["和平区（天津市）", "河东区（天津市）", "南开区", "红桥区", "东丽区", "北辰区"],
    "红桥区": ["南开区", "河北区", "西青区", "北辰区"],
    "东丽区": ["河东区（天津市）", "河西区", "河北区", "津南区", "北辰区", "滨海新区", "宁河区"],
    "西青区": ["河西区", "南开区", "红桥区", "津南区", "北辰区", "武清区", "滨海新区", "静海区", "霸州市"],
    "津南区": ["河西区", "东丽区", "西青区", "滨海新区"],
    "北辰区": ["河北区", "红桥区", "东丽区", "西青区", "武清区", "宁河区"],
    "武清区": ["通州区（北京市）", "西青区", "北辰区", "宝坻区", "宁河区", "安次区", "广阳区", "香河县", "霸州市"],
    "宝坻区": ["武清区", "宁河区", "蓟州区", "玉田县", "香河县", "三河市"],
    "滨海新区": ["东丽区", "西青区", "津南区", "宁河区", "静海区", "丰南区", "黄骅市"],
    "宁河区": ["东丽区", "北辰区", "武清区", "宝坻区", "滨海新区", "丰南区", "丰润区", "玉田县"],
    "静海区": ["西青区", "滨海新区", "青县", "黄骅市", "大城县", "文安县", "霸州市"],
    "蓟州区": ["平谷区", "宝坻区", "玉田县", "遵化市", "兴隆县", "三河市"],

    
    // ==================== 河北省 ====================
    // 石家庄市
    "长安区（石家庄市）": ["桥西区（石家庄市）", "新华区（石家庄市）", "裕华区", "藁城区", "正定县"],
    "桥西区（石家庄市）": ["长安区（石家庄市）", "新华区（石家庄市）", "裕华区", "鹿泉区"],
    "新华区（石家庄市）": ["长安区（石家庄市）", "桥西区（石家庄市）", "鹿泉区", "正定县"],
    "井陉矿区": ["井陉县"],
    "裕华区": ["长安区（石家庄市）", "桥西区（石家庄市）", "藁城区", "鹿泉区", "栾城区"],
    "藁城区": ["长安区（石家庄市）", "裕华区", "栾城区", "正定县", "无极县", "赵县", "晋州市", "新乐市"],
    "鹿泉区": ["桥西区（石家庄市）", "新华区（石家庄市）", "裕华区", "栾城区", "井陉县", "正定县", "灵寿县", "平山县", "元氏县"],
    "栾城区": ["裕华区", "藁城区", "鹿泉区", "元氏县", "赵县"],
    "井陉县": ["井陉矿区", "鹿泉区", "赞皇县", "平山县", "元氏县", "平定县", "盂县", "昔阳县"],
    "正定县": ["长安区（石家庄市）", "新华区（石家庄市）", "藁城区", "鹿泉区", "行唐县", "灵寿县", "新乐市"],
    "行唐县": ["正定县", "灵寿县", "新乐市", "阜平县", "曲阳县"],
    "灵寿县": ["鹿泉区", "正定县", "行唐县", "平山县", "阜平县"],
    "高邑县": ["赞皇县", "元氏县", "赵县", "临城县", "柏乡县"],
    "深泽县": ["无极县", "辛集市", "晋州市", "定州市", "安国市", "安平县"],
    "赞皇县": ["井陉县", "高邑县", "元氏县", "临城县", "内丘县", "昔阳县"],
    "无极县": ["藁城区", "深泽县", "晋州市", "新乐市", "定州市"],
    "平山县": ["鹿泉区", "井陉县", "灵寿县", "阜平县", "盂县", "五台县"],
    "元氏县": ["鹿泉区", "栾城区", "井陉县", "高邑县", "赞皇县", "赵县"],
    "赵县": ["藁城区", "栾城区", "高邑县", "元氏县", "晋州市", "柏乡县", "宁晋县"],
    "辛集市": ["深泽县", "晋州市", "宁晋县", "冀州区", "安平县", "深州市"],
    "晋州市": ["藁城区", "深泽县", "无极县", "赵县", "辛集市", "宁晋县"],
    "新乐市": ["藁城区", "正定县", "行唐县", "无极县", "曲阳县", "定州市"],
    
    // 唐山市
    "路南区": ["路北区", "开平区", "丰南区"],
    "路北区": ["路南区", "开平区", "丰南区", "丰润区"],
    "古冶区": ["开平区", "丰南区", "滦南县", "滦州市"],
    "开平区": ["路南区", "路北区", "古冶区", "丰南区", "丰润区", "滦州市"],
    "丰南区": ["滨海新区", "宁河区", "路南区", "路北区", "古冶区", "开平区", "丰润区", "曹妃甸区", "滦南县"],
    "丰润区": ["宁河区", "路北区", "开平区", "丰南区", "迁西县", "玉田县", "遵化市", "滦州市"],
    "曹妃甸区": ["丰南区", "滦南县", "乐亭县"],
    "滦南县": ["古冶区", "丰南区", "曹妃甸区", "乐亭县", "滦州市", "昌黎县"],
    "乐亭县": ["曹妃甸区", "滦南县", "昌黎县"],
    "迁西县": ["丰润区", "遵化市", "迁安市", "滦州市", "青龙满族自治县", "兴隆县", "宽城满族自治县"],
    "玉田县": ["宝坻区", "宁河区", "蓟州区", "丰润区", "遵化市"],
    "遵化市": ["蓟州区", "丰润区", "迁西县", "玉田县", "兴隆县"],
    "迁安市": ["迁西县", "滦州市", "青龙满族自治县", "卢龙县"],
    "滦州市": ["古冶区", "开平区", "丰润区", "滦南县", "迁西县", "迁安市", "昌黎县", "卢龙县"],

    // 秦皇岛市
    "海港区": ["山海关区", "北戴河区", "抚宁区", "青龙满族自治县", "绥中县"],
    "山海关区": ["海港区", "绥中县"],
    "北戴河区": ["海港区", "抚宁区"],
    "抚宁区": ["海港区", "北戴河区", "青龙满族自治县", "昌黎县", "卢龙县"],
    "青龙满族自治县": ["迁西县", "迁安市", "海港区", "抚宁区", "卢龙县", "宽城满族自治县", "凌源市", "绥中县", "建昌县"],
    "昌黎县": ["滦南县", "乐亭县", "滦州市", "抚宁区", "卢龙县"],
    "卢龙县": ["迁安市", "滦州市", "抚宁区", "青龙满族自治县", "昌黎县"],

    // 邯郸市
    "邯山区": ["丛台区", "复兴区", "肥乡区", "临漳县", "成安县", "磁县"],
    "丛台区": ["邯山区", "复兴区", "肥乡区", "永年区", "武安市"],
    "复兴区": ["邯山区", "丛台区", "峰峰矿区", "磁县", "武安市"],
    "峰峰矿区": ["复兴区", "磁县", "武安市"],
    "肥乡区": ["邯山区", "丛台区", "永年区", "成安县", "广平县", "曲周县"],
    "永年区": ["丛台区", "肥乡区", "鸡泽县", "曲周县", "武安市", "南和区", "沙河市"],
    "临漳县": ["邯山区", "成安县", "磁县", "魏县", "北关区", "安阳县"],
    "成安县": ["邯山区", "肥乡区", "临漳县", "广平县", "魏县"],
    "大名县": ["广平县", "馆陶县", "魏县", "莘县", "冠县", "南乐县"],
    "涉县": ["河东区（天津市）", "磁县", "武安市", "平顺县", "黎城县", "左权县", "安阳县", "林州市"],
    "磁县": ["邯山区", "复兴区", "峰峰矿区", "临漳县", "涉县", "武安市", "安阳县"],
    "邱县": ["馆陶县", "曲周县", "广宗县", "平乡县", "威县", "临西县"],
    "鸡泽县": ["永年区", "曲周县", "南和区", "平乡县"],
    "广平县": ["肥乡区", "成安县", "大名县", "馆陶县", "魏县", "曲周县"],
    "馆陶县": ["大名县", "邱县", "广平县", "曲周县", "临西县", "冠县", "临清市"],
    "魏县": ["临漳县", "成安县", "大名县", "广平县", "安阳县", "内黄县", "清丰县", "南乐县"],
    "曲周县": ["肥乡区", "永年区", "邱县", "鸡泽县", "广平县", "馆陶县", "平乡县"],
    "武安市": ["丛台区", "复兴区", "峰峰矿区", "永年区", "涉县", "磁县", "信都区", "沙河市", "左权县"],

    // 邢台市
    "襄都区": ["信都区", "任泽区", "南和区", "内丘县", "沙河市"],
    "信都区": ["武安市", "襄都区", "内丘县", "沙河市", "左权县", "和顺县", "昔阳县"],
    "任泽区": ["襄都区", "南和区", "内丘县", "隆尧县", "巨鹿县", "平乡县"],
    "南和区": ["永年区", "鸡泽县", "襄都区", "任泽区", "平乡县", "沙河市"],
    "临城县": ["高邑县", "赞皇县", "内丘县", "柏乡县", "隆尧县"],
    "内丘县": ["赞皇县", "襄都区", "信都区", "任泽区", "临城县", "隆尧县", "昔阳县"],
    "柏乡县": ["高邑县", "赵县", "临城县", "隆尧县", "宁晋县"],
    "隆尧县": ["任泽区", "临城县", "内丘县", "柏乡县", "宁晋县", "巨鹿县"],
    "宁晋县": ["赵县", "辛集市", "晋州市", "柏乡县", "隆尧县", "巨鹿县", "新河县", "冀州区"],
    "巨鹿县": ["任泽区", "隆尧县", "宁晋县", "新河县", "广宗县", "平乡县", "南宫市"],
    "新河县": ["宁晋县", "巨鹿县", "南宫市", "冀州区"],
    "广宗县": ["邱县", "巨鹿县", "平乡县", "威县", "南宫市"],
    "平乡县": ["邱县", "鸡泽县", "曲周县", "任泽区", "南和区", "巨鹿县", "广宗县"],
    "威县": ["邱县", "广宗县", "清河县", "临西县", "南宫市"],
    "清河县": ["威县", "临西县", "南宫市", "故城县", "夏津县"],
    "临西县": ["邱县", "馆陶县", "威县", "清河县", "夏津县", "临清市"],
    "南宫市": ["巨鹿县", "新河县", "广宗县", "威县", "清河县", "冀州区", "枣强县", "故城县"],
    "沙河市": ["永年区", "武安市", "襄都区", "信都区", "南和区"],

    // 保定市
    "竞秀区": ["莲池区", "满城区"],
    "莲池区": ["竞秀区", "满城区", "清苑区", "徐水区"],
    "满城区": ["竞秀区", "莲池区", "清苑区", "徐水区", "易县", "顺平县"],
    "清苑区": ["莲池区", "满城区", "徐水区", "高阳县", "望都县", "安新县", "蠡县", "顺平县", "博野县", "安国市"],
    "徐水区": ["莲池区", "满城区", "清苑区", "定兴县", "容城县", "安新县", "易县"],
    "涞水县": ["门头沟区", "房山区", "定兴县", "涞源县", "易县", "涿州市", "高碑店市", "蔚县", "涿鹿县"],
    "阜平县": ["行唐县", "灵寿县", "平山县", "唐县", "涞源县", "曲阳县", "灵丘县", "五台县", "繁峙县"],
    "定兴县": ["徐水区", "涞水县", "容城县", "易县", "高碑店市"],
    "唐县": ["阜平县", "涞源县", "望都县", "曲阳县", "顺平县", "定州市"],
    "高阳县": ["清苑区", "安新县", "蠡县", "肃宁县", "任丘市", "河间市"],
    "容城县": ["徐水区", "定兴县", "安新县", "雄县", "高碑店市"],
    "涞源县": ["涞水县", "阜平县", "唐县", "易县", "顺平县", "蔚县", "灵丘县"],
    "望都县": ["清苑区", "唐县", "顺平县", "定州市", "安国市"],
    "安新县": ["清苑区", "徐水区", "高阳县", "容城县", "雄县", "任丘市"],
    "易县": ["满城区", "徐水区", "涞水县", "定兴县", "涞源县", "顺平县"],
    "曲阳县": ["行唐县", "新乐市", "阜平县", "唐县", "定州市"],
    "蠡县": ["清苑区", "高阳县", "博野县", "肃宁县", "饶阳县", "安平县"],
    "顺平县": ["满城区", "清苑区", "唐县", "涞源县", "望都县", "易县"],
    "博野县": ["清苑区", "蠡县", "安国市", "安平县"],
    "雄县": ["容城县", "安新县", "高碑店市", "任丘市", "固安县", "文安县", "霸州市"],
    "涿州市": ["房山区", "大兴区", "涞水县", "高碑店市", "固安县"],
    "定州市": ["深泽县", "无极县", "新乐市", "唐县", "望都县", "曲阳县", "安国市"],
    "安国市": ["深泽县", "清苑区", "望都县", "博野县", "定州市", "安平县"],
    "高碑店市": ["涞水县", "定兴县", "容城县", "雄县", "涿州市", "固安县"],

    // 张家口市
    "桥东区": ["桥西区（张家口市）", "宣化区", "崇礼区"],
    "桥西区（张家口市）": ["桥东区", "宣化区", "万全区", "崇礼区", "张北县"],
    "宣化区": ["桥东区", "桥西区（张家口市）", "下花园区", "万全区", "崇礼区", "蔚县", "阳原县", "怀安县", "怀来县", "涿鹿县", "赤城县"],
    "下花园区": ["宣化区", "怀来县", "涿鹿县"],
    "万全区": ["桥西区（张家口市）", "宣化区", "张北县", "尚义县", "怀安县"],
    "崇礼区": ["桥东区", "桥西区（张家口市）", "宣化区", "张北县", "沽源县", "赤城县"],
    "张北县": ["桥西区（张家口市）", "万全区", "崇礼区", "康保县", "沽源县", "尚义县", "商都县"],
    "康保县": ["张北县", "沽源县", "化德县", "商都县", "太仆寺旗", "正镶白旗"],
    "沽源县": ["崇礼区", "张北县", "康保县", "赤城县", "丰宁满族自治县", "太仆寺旗", "正蓝旗", "多伦县"],
    "尚义县": ["万全区", "张北县", "怀安县", "天镇县", "商都县", "兴和县"],
    "蔚县": ["涞水县", "涞源县", "宣化区", "阳原县", "涿鹿县", "广灵县", "灵丘县"],
    "阳原县": ["宣化区", "蔚县", "怀安县", "阳高县", "天镇县", "广灵县"],
    "怀安县": ["宣化区", "万全区", "尚义县", "阳原县", "天镇县"],
    "怀来县": ["门头沟区", "昌平区", "延庆区", "宣化区", "下花园区", "涿鹿县", "赤城县"],
    "涿鹿县": ["门头沟区", "涞水县", "宣化区", "下花园区", "蔚县", "怀来县"],
    "赤城县": ["怀柔区", "延庆区", "宣化区", "崇礼区", "沽源县", "怀来县", "丰宁满族自治县"],

    // 承德市
    "双桥区": ["双滦区", "承德县"],
    "双滦区": ["双桥区", "承德县", "滦平县", "隆化县"],
    "鹰手营子矿区": ["承德县", "兴隆县"],
    "承德县": ["密云区", "双桥区", "双滦区", "鹰手营子矿区", "兴隆县", "滦平县", "隆化县", "宽城满族自治县", "平泉市", "宁城县"],
    "兴隆县": ["平谷区", "密云区", "蓟州区", "迁西县", "遵化市", "鹰手营子矿区", "承德县", "宽城满族自治县"],
    "滦平县": ["怀柔区", "密云区", "双滦区", "承德县", "隆化县", "丰宁满族自治县"],
    "隆化县": ["双滦区", "承德县", "滦平县", "丰宁满族自治县", "围场满族蒙古族自治县", "喀喇沁旗", "宁城县"],
    "丰宁满族自治县": ["怀柔区", "沽源县", "赤城县", "滦平县", "隆化县", "围场满族蒙古族自治县", "多伦县"],
    "宽城满族自治县": ["迁西县", "青龙满族自治县", "承德县", "兴隆县", "平泉市", "凌源市"],
    "围场满族蒙古族自治县": ["隆化县", "丰宁满族自治县", "松山区", "克什克腾旗", "喀喇沁旗", "多伦县"],
    "平泉市": ["承德县", "宽城满族自治县", "宁城县", "凌源市"],

    // 沧州市
    "新华区（沧州市）": ["运河区", "沧县"],
    "运河区": ["新华区（沧州市）", "沧县", "青县"],
    "沧县": ["新华区（沧州市）", "运河区", "青县", "南皮县", "献县", "孟村回族自治县", "泊头市", "黄骅市", "河间市"],
    "青县": ["静海区", "运河区", "沧县", "黄骅市", "河间市", "大城县"],
    "东光县": ["南皮县", "吴桥县", "泊头市", "景县", "阜城县", "宁津县"],
    "海兴县": ["盐山县", "孟村回族自治县", "黄骅市", "庆云县", "无棣县"],
    "盐山县": ["海兴县", "南皮县", "孟村回族自治县", "庆云县", "乐陵市"],
    "肃宁县": ["高阳县", "蠡县", "献县", "河间市", "饶阳县"],
    "南皮县": ["沧县", "东光县", "盐山县", "孟村回族自治县", "泊头市", "宁津县", "乐陵市"],
    "吴桥县": ["东光县", "景县", "德城区", "宁津县"],
    "献县": ["沧县", "肃宁县", "泊头市", "河间市", "武强县", "饶阳县"],
    "孟村回族自治县": ["沧县", "海兴县", "盐山县", "南皮县", "黄骅市"],
    "泊头市": ["沧县", "东光县", "南皮县", "献县", "武邑县", "武强县", "阜城县"],
    "任丘市": ["高阳县", "安新县", "雄县", "河间市", "大城县", "文安县"],
    "黄骅市": ["滨海新区", "静海区", "沧县", "青县", "海兴县", "孟村回族自治县", "无棣县"],
    "河间市": ["高阳县", "沧县", "青县", "肃宁县", "献县", "任丘市", "大城县"],

    // 廊坊市
    "安次区": ["武清区", "广阳区", "永清县", "霸州市"],
    "广阳区": ["通州区（北京市）", "大兴区", "武清区", "安次区", "固安县", "永清县"],
    "固安县": ["大兴区", "雄县", "涿州市", "高碑店市", "广阳区", "永清县", "霸州市"],
    "永清县": ["安次区", "广阳区", "固安县", "霸州市"],
    "香河县": ["通州区（北京市）", "武清区", "宝坻区", "大厂回族自治县", "三河市"],
    "大城县": ["静海区", "青县", "任丘市", "河间市", "文安县"],
    "文安县": ["静海区", "雄县", "任丘市", "大城县", "霸州市"],
    "大厂回族自治县": ["通州区（北京市）", "香河县", "三河市"],
    "霸州市": ["西青区", "武清区", "静海区", "雄县", "安次区", "固安县", "永清县", "文安县"],
    "三河市": ["通州区（北京市）", "顺义区", "平谷区", "宝坻区", "蓟州区", "香河县", "大厂回族自治县"],

    // 衡水市
    "桃城区": ["冀州区", "枣强县", "武邑县", "深州市"],
    "冀州区": ["辛集市", "宁晋县", "新河县", "南宫市", "桃城区", "枣强县", "深州市"],
    "枣强县": ["南宫市", "桃城区", "冀州区", "武邑县", "故城县", "景县"],
    "武邑县": ["泊头市", "桃城区", "枣强县", "武强县", "景县", "阜城县", "深州市"],
    "武强县": ["献县", "泊头市", "武邑县", "饶阳县", "深州市"],
    "饶阳县": ["蠡县", "肃宁县", "献县", "武强县", "安平县", "深州市"],
    "安平县": ["深泽县", "辛集市", "蠡县", "博野县", "安国市", "饶阳县", "深州市"],
    "故城县": ["清河县", "南宫市", "枣强县", "景县", "德城区", "夏津县", "武城县"],
    "景县": ["东光县", "吴桥县", "枣强县", "武邑县", "故城县", "阜城县", "德城区"],
    "阜城县": ["东光县", "泊头市", "武邑县", "景县"],
    "深州市": ["辛集市", "桃城区", "冀州区", "武邑县", "武强县", "饶阳县", "安平县"],


    // ==================== 山西省 ====================
    // 太原市
    "小店区": ["迎泽区", "万柏林区", "晋源区", "清徐县", "榆次区"],
    "迎泽区": ["小店区", "杏花岭区", "万柏林区", "榆次区", "寿阳县"],
    "杏花岭区": ["迎泽区", "尖草坪区", "万柏林区", "阳曲县", "寿阳县"],
    "尖草坪区": ["杏花岭区", "万柏林区", "阳曲县"],
    "万柏林区": ["小店区", "迎泽区", "杏花岭区", "尖草坪区", "晋源区", "阳曲县", "古交市"],
    "晋源区": ["小店区", "万柏林区", "清徐县"],
    "清徐县": ["小店区", "晋源区", "古交市", "榆次区", "太谷区", "祁县", "文水县", "交城县"],
    "阳曲县": ["杏花岭区", "尖草坪区", "万柏林区", "古交市", "盂县", "寿阳县", "忻府区", "定襄县", "静乐县"],
    "娄烦县": ["古交市", "静乐县", "交城县", "岚县", "方山县"],
    "古交市": ["万柏林区", "清徐县", "阳曲县", "娄烦县", "静乐县", "交城县"],

    // 大同市
    "新荣区": ["平城区", "云冈区", "云州区", "阳高县", "左云县", "凉城县", "丰镇市"],
    "平城区": ["新荣区", "云冈区", "云州区"],
    "云冈区": ["新荣区", "平城区", "云州区", "左云县", "怀仁市"],
    "云州区": ["新荣区", "平城区", "云冈区", "阳高县", "浑源县", "怀仁市"],
    "阳高县": ["阳原县", "新荣区", "云州区", "天镇县", "广灵县", "浑源县", "兴和县", "丰镇市"],
    "天镇县": ["尚义县", "阳原县", "怀安县", "阳高县", "兴和县"],
    "广灵县": ["蔚县", "阳原县", "阳高县", "灵丘县", "浑源县"],
    "灵丘县": ["阜平县", "涞源县", "蔚县", "广灵县", "浑源县", "繁峙县"],
    "浑源县": ["云州区", "阳高县", "广灵县", "灵丘县", "应县", "怀仁市", "繁峙县"],
    "左云县": ["新荣区", "云冈区", "山阴县", "右玉县", "怀仁市", "凉城县"],

    // 阳泉市
    "城区（阳泉市）": ["矿区", "郊区（阳泉市）"],
    "矿区": ["城区（阳泉市）", "郊区（阳泉市）", "平定县"],
    "郊区（阳泉市）": ["城区（阳泉市）", "矿区", "平定县", "盂县", "寿阳县"],
    "平定县": ["井陉县", "矿区", "郊区（阳泉市）", "盂县", "昔阳县", "寿阳县"],
    "盂县": ["井陉县", "平山县", "阳曲县", "郊区（阳泉市）", "平定县", "寿阳县", "定襄县", "五台县"],

    // 长治市
    "潞州区": ["上党区", "屯留区", "潞城区", "襄垣县", "平顺县", "壶关县", "长子县"],
    "上党区": ["潞州区", "壶关县", "长子县", "陵川县", "高平市"],
    "屯留区": ["潞州区", "襄垣县", "长子县", "沁县", "沁源县", "安泽县"],
    "潞城区": ["潞州区", "襄垣县", "平顺县", "黎城县"],
    "襄垣县": ["潞州区", "屯留区", "潞城区", "黎城县", "武乡县", "沁县"],
    "平顺县": ["涉县", "潞州区", "潞城区", "黎城县", "壶关县", "林州市"],
    "黎城县": ["涉县", "潞城区", "襄垣县", "平顺县", "武乡县", "左权县"],
    "壶关县": ["潞州区", "上党区", "平顺县", "陵川县", "林州市", "辉县市"],
    "长子县": ["潞州区", "上党区", "屯留区", "沁水县", "高平市", "安泽县"],
    "武乡县": ["襄垣县", "黎城县", "沁县", "榆社县", "左权县", "祁县", "平遥县"],
    "沁县": ["屯留区", "襄垣县", "武乡县", "沁源县", "平遥县"],
    "沁源县": ["屯留区", "沁县", "平遥县", "灵石县", "介休市", "古县", "安泽县", "霍州市"],

    // 晋城市
    "城区（晋城市）": ["泽州县"],
    "沁水县": ["长子县", "阳城县", "泽州县", "高平市", "垣曲县", "翼城县", "安泽县", "浮山县"],
    "阳城县": ["沁水县", "泽州县", "垣曲县", "济源市"],
    "陵川县": ["上党区", "壶关县", "泽州县", "高平市", "辉县市", "修武县"],
    "泽州县": ["城区（晋城市）", "沁水县", "阳城县", "陵川县", "高平市", "中站区", "修武县", "博爱县", "沁阳市", "济源市"],
    "高平市": ["上党区", "长子县", "沁水县", "陵川县", "泽州县"],

    // 朔州市
    "朔城区": ["平鲁区", "山阴县", "代县", "宁武县", "神池县", "原平市"],
    "平鲁区": ["朔城区", "山阴县", "右玉县", "神池县", "偏关县", "清水河县"],
    "山阴县": ["左云县", "朔城区", "平鲁区", "应县", "右玉县", "怀仁市", "代县"],
    "应县": ["浑源县", "山阴县", "怀仁市", "代县", "繁峙县"],
    "右玉县": ["左云县", "平鲁区", "山阴县", "和林格尔县", "凉城县"],
    "怀仁市": ["云冈区", "云州区", "浑源县", "左云县", "山阴县", "应县"],

    // 晋中市
    "榆次区": ["小店区", "迎泽区", "清徐县", "太谷区", "榆社县", "和顺县", "寿阳县"],
    "太谷区": ["清徐县", "榆次区", "榆社县", "祁县"],
    "榆社县": ["武乡县", "榆次区", "太谷区", "左权县", "和顺县", "祁县"],
    "左权县": ["涉县", "武安市", "信都区", "黎城县", "武乡县", "榆社县", "和顺县"],
    "和顺县": ["信都区", "榆次区", "榆社县", "左权县", "昔阳县", "寿阳县"],
    "昔阳县": ["井陉县", "赞皇县", "信都区", "内丘县", "平定县", "和顺县", "寿阳县"],
    "寿阳县": ["迎泽区", "杏花岭区", "阳曲县", "郊区（阳泉市）", "平定县", "盂县", "榆次区", "和顺县", "昔阳县"],
    "祁县": ["清徐县", "武乡县", "太谷区", "榆社县", "平遥县", "文水县"],
    "平遥县": ["武乡县", "沁县", "沁源县", "祁县", "介休市", "文水县", "汾阳市"],
    "灵石县": ["沁源县", "介休市", "汾西县", "霍州市", "交口县", "孝义市"],
    "介休市": ["沁源县", "平遥县", "灵石县", "孝义市", "汾阳市"],

    // 运城市
    "盐湖区": ["临猗县", "万荣县", "闻喜县", "夏县", "平陆县", "芮城县", "永济市"],
    "临猗县": ["盐湖区", "万荣县", "永济市", "合阳县"],
    "万荣县": ["盐湖区", "临猗县", "闻喜县", "稷山县", "河津市", "合阳县", "韩城市"],
    "闻喜县": ["盐湖区", "万荣县", "稷山县", "新绛县", "绛县", "垣曲县", "夏县", "侯马市"],
    "稷山县": ["万荣县", "闻喜县", "新绛县", "河津市", "乡宁县"],
    "新绛县": ["闻喜县", "稷山县", "襄汾县", "乡宁县", "侯马市"],
    "绛县": ["闻喜县", "垣曲县", "曲沃县", "翼城县", "侯马市"],
    "垣曲县": ["沁水县", "阳城县", "闻喜县", "绛县", "夏县", "翼城县", "新安县", "渑池县", "济源市"],
    "夏县": ["盐湖区", "闻喜县", "垣曲县", "平陆县", "渑池县"],
    "平陆县": ["盐湖区", "夏县", "芮城县", "湖滨区", "陕州区", "渑池县", "灵宝市"],
    "芮城县": ["盐湖区", "平陆县", "永济市", "灵宝市", "潼关县", "大荔县"],
    "永济市": ["盐湖区", "临猗县", "芮城县", "大荔县", "合阳县"],
    "河津市": ["万荣县", "稷山县", "乡宁县", "韩城市"],

    // 忻州市
    "忻府区": ["阳曲县", "定襄县", "宁武县", "静乐县", "原平市"],
    "定襄县": ["阳曲县", "盂县", "忻府区", "五台县", "原平市"],
    "五台县": ["平山县", "阜平县", "盂县", "定襄县", "代县", "繁峙县", "原平市"],
    "代县": ["朔城区", "山阴县", "应县", "五台县", "繁峙县", "原平市"],
    "繁峙县": ["阜平县", "灵丘县", "浑源县", "应县", "五台县", "代县"],
    "宁武县": ["朔城区", "忻府区", "静乐县", "神池县", "五寨县", "岢岚县", "原平市"],
    "静乐县": ["阳曲县", "娄烦县", "古交市", "忻府区", "宁武县", "岢岚县", "岚县"],
    "神池县": ["朔城区", "平鲁区", "宁武县", "五寨县", "偏关县"],
    "五寨县": ["宁武县", "神池县", "岢岚县", "河曲县", "偏关县"],
    "岢岚县": ["宁武县", "静乐县", "五寨县", "河曲县", "保德县", "兴县", "岚县"],
    "河曲县": ["五寨县", "岢岚县", "保德县", "偏关县", "准格尔旗", "府谷县"],
    "保德县": ["岢岚县", "河曲县", "兴县", "府谷县"],
    "偏关县": ["平鲁区", "神池县", "五寨县", "河曲县", "清水河县", "准格尔旗"],
    "原平市": ["朔城区", "忻府区", "定襄县", "五台县", "代县", "宁武县"],

    // 临汾市
    "尧都区": ["襄汾县", "洪洞县", "古县", "浮山县", "吉县", "乡宁县", "蒲县"],
    "曲沃县": ["绛县", "翼城县", "襄汾县", "侯马市"],
    "翼城县": ["沁水县", "绛县", "垣曲县", "曲沃县", "襄汾县", "浮山县"],
    "襄汾县": ["新绛县", "尧都区", "曲沃县", "翼城县", "浮山县", "乡宁县", "侯马市"],
    "洪洞县": ["尧都区", "古县", "蒲县", "汾西县", "霍州市"],
    "古县": ["沁源县", "尧都区", "洪洞县", "安泽县", "浮山县", "霍州市"],
    "安泽县": ["屯留区", "长子县", "沁源县", "沁水县", "古县", "浮山县"],
    "浮山县": ["沁水县", "尧都区", "翼城县", "襄汾县", "古县", "安泽县"],
    "吉县": ["尧都区", "乡宁县", "大宁县", "蒲县", "延长县", "宜川县"],
    "乡宁县": ["稷山县", "新绛县", "河津市", "尧都区", "襄汾县", "吉县", "韩城市", "宜川县"],
    "大宁县": ["吉县", "隰县", "永和县", "蒲县", "延长县"],
    "隰县": ["大宁县", "永和县", "蒲县", "汾西县", "石楼县", "交口县"],
    "永和县": ["大宁县", "隰县", "石楼县", "延长县", "延川县"],
    "蒲县": ["尧都区", "洪洞县", "吉县", "大宁县", "隰县", "汾西县"],
    "汾西县": ["灵石县", "洪洞县", "隰县", "蒲县", "霍州市", "交口县"],
    "侯马市": ["闻喜县", "新绛县", "绛县", "曲沃县", "襄汾县"],
    "霍州市": ["沁源县", "灵石县", "洪洞县", "古县", "汾西县"],
    
    // 吕梁市
    "离石区": ["文水县", "交城县", "临县", "柳林县", "方山县", "中阳县", "汾阳市"],
    "文水县": ["清徐县", "祁县", "平遥县", "离石区", "交城县", "汾阳市"],
    "交城县": ["清徐县", "娄烦县", "古交市", "离石区", "文水县", "方山县"],
    "兴县": ["岢岚县", "保德县", "临县", "岚县", "方山县", "府谷县", "神木市"],
    "临县": ["离石区", "兴县", "柳林县", "方山县", "佳县", "吴堡县", "神木市"],
    "柳林县": ["离石区", "临县", "石楼县", "中阳县", "绥德县", "吴堡县", "清涧县"],
    "石楼县": ["隰县", "永和县", "柳林县", "中阳县", "交口县", "延川县", "清涧县"],
    "岚县": ["娄烦县", "静乐县", "岢岚县", "兴县", "方山县"],
    "方山县": ["娄烦县", "离石区", "交城县", "兴县", "临县", "岚县"],
    "中阳县": ["离石区", "柳林县", "石楼县", "交口县", "孝义市", "汾阳市"],
    "交口县": ["灵石县", "隰县", "汾西县", "石楼县", "中阳县", "孝义市"],
    "孝义市": ["灵石县", "介休市", "中阳县", "交口县", "汾阳市"],
    "汾阳市": ["平遥县", "介休市", "离石区", "文水县", "中阳县", "孝义市"],


    // ==================== 内蒙古自治区 ====================
    // 呼和浩特市
    "新城区（呼和浩特市）": ["回民区", "赛罕区", "武川县", "卓资县"],
    "回民区": ["新城区（呼和浩特市）", "玉泉区", "赛罕区", "土默特左旗", "武川县"],
    "玉泉区": ["回民区", "赛罕区", "土默特左旗"],
    "赛罕区": ["新城区（呼和浩特市）", "回民区", "玉泉区", "土默特左旗", "和林格尔县", "卓资县", "凉城县"],
    "土默特左旗": ["回民区", "玉泉区", "赛罕区", "托克托县", "和林格尔县", "武川县", "土默特右旗"],
    "托克托县": ["土默特左旗", "和林格尔县", "清水河县", "土默特右旗", "准格尔旗"],
    "和林格尔县": ["右玉县", "赛罕区", "土默特左旗", "托克托县", "清水河县", "凉城县"],
    "清水河县": ["平鲁区", "偏关县", "托克托县", "和林格尔县", "准格尔旗"],
    "武川县": ["新城区（呼和浩特市）", "回民区", "土默特左旗", "土默特右旗", "固阳县", "达尔罕茂明安联合旗", "卓资县", "四子王旗"],

    // 包头市
    "东河区": ["石拐区", "九原区", "土默特右旗", "达拉特旗"],
    "昆都仑区": ["青山区（包头市）", "九原区", "固阳县", "乌拉特前旗"],
    "青山区（包头市）": ["昆都仑区", "石拐区", "九原区", "固阳县"],
    "石拐区": ["东河区", "青山区（包头市）", "九原区", "土默特右旗", "固阳县"],
    "白云鄂博矿区": ["达尔罕茂明安联合旗"],
    "九原区": ["东河区", "昆都仑区", "青山区（包头市）", "石拐区", "达拉特旗", "乌拉特前旗"],
    "土默特右旗": ["土默特左旗", "托克托县", "武川县", "东河区", "石拐区", "固阳县", "达拉特旗", "准格尔旗"],
    "固阳县": ["武川县", "昆都仑区", "青山区（包头市）", "石拐区", "土默特右旗", "达尔罕茂明安联合旗", "乌拉特前旗", "乌拉特中旗"],
    "达尔罕茂明安联合旗": ["武川县", "白云鄂博矿区", "固阳县", "乌拉特中旗", "四子王旗"],

    // 乌海市
    "海勃湾区": ["海南区", "乌达区", "鄂托克旗", "阿拉善左旗"],
    "海南区": ["海勃湾区", "乌达区", "鄂托克旗", "阿拉善左旗", "惠农区", "平罗县"],
    "乌达区": ["海勃湾区", "海南区", "阿拉善左旗"],
    
    // 赤峰市
    "红山区": ["元宝山区", "松山区", "喀喇沁旗"],
    "元宝山区": ["红山区", "松山区", "喀喇沁旗", "敖汉旗", "建平县"],
    "松山区": ["围场满族蒙古族自治县", "红山区", "元宝山区", "克什克腾旗", "翁牛特旗", "喀喇沁旗", "敖汉旗"],
    "阿鲁科尔沁旗": ["巴林左旗", "巴林右旗", "翁牛特旗", "开鲁县", "扎鲁特旗", "西乌珠穆沁旗"],
    "巴林左旗": ["阿鲁科尔沁旗", "巴林右旗", "西乌珠穆沁旗"],
    "巴林右旗": ["阿鲁科尔沁旗", "巴林左旗", "林西县", "翁牛特旗", "西乌珠穆沁旗"],
    "林西县": ["巴林右旗", "克什克腾旗", "翁牛特旗", "西乌珠穆沁旗"],
    "克什克腾旗": ["围场满族蒙古族自治县", "松山区", "林西县", "翁牛特旗", "锡林浩特市", "西乌珠穆沁旗", "正蓝旗", "多伦县"],
    "翁牛特旗": ["松山区", "阿鲁科尔沁旗", "巴林右旗", "林西县", "克什克腾旗", "敖汉旗", "开鲁县", "奈曼旗"],
    "喀喇沁旗": ["隆化县", "围场满族蒙古族自治县", "红山区", "元宝山区", "松山区", "宁城县", "建平县"],
    "宁城县": ["承德县", "隆化县", "平泉市", "喀喇沁旗", "建平县", "凌源市"],
    "敖汉旗": ["元宝山区", "松山区", "翁牛特旗", "奈曼旗", "朝阳县", "建平县", "北票市"],

    // 通辽市
    "科尔沁区": ["科尔沁左翼中旗", "科尔沁左翼后旗", "开鲁县"],
    "科尔沁左翼中旗": ["科尔沁区", "科尔沁左翼后旗", "开鲁县", "扎鲁特旗", "科尔沁右翼中旗", "双辽市", "长岭县", "通榆县"],
    "科尔沁左翼后旗": ["科尔沁区", "科尔沁左翼中旗", "开鲁县", "库伦旗", "奈曼旗", "康平县", "彰武县", "昌图县", "双辽市"],
    "开鲁县": ["阿鲁科尔沁旗", "翁牛特旗", "科尔沁区", "科尔沁左翼中旗", "科尔沁左翼后旗", "奈曼旗", "扎鲁特旗"],
    "库伦旗": ["科尔沁左翼后旗", "奈曼旗", "阜新蒙古族自治县", "彰武县"],
    "奈曼旗": ["翁牛特旗", "敖汉旗", "科尔沁左翼后旗", "开鲁县", "库伦旗", "阜新蒙古族自治县", "北票市"],
    "扎鲁特旗": ["阿鲁科尔沁旗", "科尔沁左翼中旗", "开鲁县", "霍林郭勒市", "科尔沁右翼中旗", "东乌珠穆沁旗", "西乌珠穆沁旗"],
    "霍林郭勒市": ["扎鲁特旗", "科尔沁右翼中旗", "东乌珠穆沁旗"],

    // 鄂尔多斯市
    "东胜区": ["康巴什区", "达拉特旗", "准格尔旗", "杭锦旗", "伊金霍洛旗"],
    "康巴什区": ["东胜区", "伊金霍洛旗"],
    "达拉特旗": ["东河区", "九原区", "土默特右旗", "东胜区", "准格尔旗", "杭锦旗", "乌拉特前旗"],
    "准格尔旗": ["河曲县", "偏关县", "托克托县", "清水河县", "土默特右旗", "东胜区", "达拉特旗", "伊金霍洛旗", "府谷县"],
    "鄂托克前旗": ["鄂托克旗", "乌审旗", "靖边县", "定边县", "兴庆区", "灵武市", "平罗县", "盐池县"],
    "鄂托克旗": ["海勃湾区", "海南区", "鄂托克前旗", "杭锦旗", "乌审旗", "磴口县", "阿拉善左旗", "平罗县"],
    "杭锦旗": ["东胜区", "达拉特旗", "鄂托克旗", "乌审旗", "伊金霍洛旗", "临河区", "五原县", "磴口县", "乌拉特前旗", "杭锦后旗"],
    "乌审旗": ["鄂托克前旗", "鄂托克旗", "杭锦旗", "伊金霍洛旗", "榆阳区", "横山区", "靖边县", "神木市"],
    "伊金霍洛旗": ["东胜区", "康巴什区", "准格尔旗", "杭锦旗", "乌审旗", "府谷县", "神木市"],

    // 呼伦贝尔市
    "海拉尔区": ["鄂温克族自治旗", "陈巴尔虎旗"],
    "扎赉诺尔区": ["新巴尔虎左旗", "新巴尔虎右旗", "满洲里市"],
    "阿荣旗": ["莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "牙克石市", "扎兰屯市", "甘南县"],
    "莫力达瓦达斡尔族自治旗": ["阿荣旗", "鄂伦春自治旗", "甘南县", "讷河市", "嫩江市"],
    "鄂伦春自治旗": ["阿荣旗", "莫力达瓦达斡尔族自治旗", "牙克石市", "根河市", "嫩江市", "呼玛县", "加格达奇区"],
    "鄂温克族自治旗": ["海拉尔区", "陈巴尔虎旗", "新巴尔虎左旗", "牙克石市", "扎兰屯市", "阿尔山市"],
    "陈巴尔虎旗": ["海拉尔区", "鄂温克族自治旗", "新巴尔虎左旗", "牙克石市", "额尔古纳市"],
    "新巴尔虎左旗": ["扎赉诺尔区", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎右旗", "满洲里市", "阿尔山市"],
    "新巴尔虎右旗": ["扎赉诺尔区", "新巴尔虎左旗", "满洲里市"],
    "满洲里市": ["扎赉诺尔区", "新巴尔虎左旗", "新巴尔虎右旗"],
    "牙克石市": ["阿荣旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "扎兰屯市", "额尔古纳市", "根河市"],
    "扎兰屯市": ["阿荣旗", "鄂温克族自治旗", "牙克石市", "阿尔山市", "扎赉特旗", "碾子山区", "龙江县", "甘南县"],
    "额尔古纳市": ["陈巴尔虎旗", "牙克石市", "根河市", "漠河市"],
    "根河市": ["鄂伦春自治旗", "牙克石市", "额尔古纳市", "漠河市", "呼玛县"],

    // 巴彦淖尔市
    "临河区": ["杭锦旗", "五原县", "乌拉特中旗", "杭锦后旗"],
    "五原县": ["杭锦旗", "临河区", "乌拉特前旗", "乌拉特中旗"],
    "磴口县": ["鄂托克旗", "杭锦旗", "乌拉特后旗", "杭锦后旗", "阿拉善左旗"],
    "乌拉特前旗": ["昆都仑区", "九原区", "固阳县", "达拉特旗", "杭锦旗", "五原县", "乌拉特中旗"],
    "乌拉特中旗": ["固阳县", "达尔罕茂明安联合旗", "临河区", "五原县", "乌拉特前旗", "乌拉特后旗", "杭锦后旗"],
    "乌拉特后旗": ["磴口县", "乌拉特中旗", "杭锦后旗", "阿拉善左旗"],
    "杭锦后旗": ["杭锦旗", "临河区", "磴口县", "乌拉特中旗", "乌拉特后旗"],

    // 乌兰察布市
    "集宁区": ["察哈尔右翼前旗", "察哈尔右翼后旗"],
    "卓资县": ["新城区（呼和浩特市）", "赛罕区", "武川县", "凉城县", "察哈尔右翼前旗", "察哈尔右翼中旗", "察哈尔右翼后旗", "四子王旗", "丰镇市"],
    "化德县": ["康保县", "商都县", "镶黄旗", "正镶白旗"],
    "商都县": ["张北县", "康保县", "尚义县", "化德县", "兴和县", "察哈尔右翼后旗", "苏尼特右旗", "镶黄旗"],
    "兴和县": ["尚义县", "阳高县", "天镇县", "商都县", "察哈尔右翼前旗", "察哈尔右翼后旗", "丰镇市"],
    "凉城县": ["新荣区", "左云县", "右玉县", "赛罕区", "和林格尔县", "卓资县", "丰镇市"],
    "察哈尔右翼前旗": ["集宁区", "卓资县", "兴和县", "察哈尔右翼后旗", "丰镇市"],
    "察哈尔右翼中旗": ["卓资县", "察哈尔右翼后旗", "四子王旗"],
    "察哈尔右翼后旗": ["集宁区", "卓资县", "商都县", "兴和县", "察哈尔右翼前旗", "察哈尔右翼中旗", "四子王旗", "苏尼特右旗"],
    "四子王旗": ["武川县", "达尔罕茂明安联合旗", "卓资县", "察哈尔右翼中旗", "察哈尔右翼后旗", "苏尼特右旗"],
    "丰镇市": ["新荣区", "阳高县", "卓资县", "兴和县", "凉城县", "察哈尔右翼前旗"],

    // 兴安盟
    "乌兰浩特市": ["科尔沁右翼前旗", "扎赉特旗", "洮北区", "镇赉县", "洮南市"],
    "阿尔山市": ["鄂温克族自治旗", "新巴尔虎左旗", "扎兰屯市", "科尔沁右翼前旗", "扎赉特旗"],
    "科尔沁右翼前旗": ["乌兰浩特市", "阿尔山市", "科尔沁右翼中旗", "扎赉特旗", "突泉县", "东乌珠穆沁旗", "洮南市"],
    "科尔沁右翼中旗": ["科尔沁左翼中旗", "扎鲁特旗", "霍林郭勒市", "科尔沁右翼前旗", "突泉县", "东乌珠穆沁旗", "通榆县", "洮南市"],
    "扎赉特旗": ["扎兰屯市", "乌兰浩特市", "阿尔山市", "科尔沁右翼前旗", "镇赉县", "龙江县", "泰来县"],
    "突泉县": ["科尔沁右翼前旗", "科尔沁右翼中旗", "洮南市"],

    // 锡林郭勒盟
    "二连浩特市": ["苏尼特左旗", "苏尼特右旗"],
    "锡林浩特市": ["克什克腾旗", "阿巴嘎旗", "东乌珠穆沁旗", "西乌珠穆沁旗", "正蓝旗"],
    "阿巴嘎旗": ["锡林浩特市", "苏尼特左旗", "东乌珠穆沁旗", "正蓝旗"],
    "苏尼特左旗": ["二连浩特市", "阿巴嘎旗", "苏尼特右旗", "正镶白旗", "正蓝旗"],
    "苏尼特右旗": ["商都县", "察哈尔右翼后旗", "四子王旗", "二连浩特市", "苏尼特左旗", "镶黄旗"],
    "东乌珠穆沁旗": ["扎鲁特旗", "霍林郭勒市", "科尔沁右翼前旗", "科尔沁右翼中旗", "锡林浩特市", "阿巴嘎旗", "西乌珠穆沁旗"],
    "西乌珠穆沁旗": ["阿鲁科尔沁旗", "巴林左旗", "巴林右旗", "林西县", "克什克腾旗", "扎鲁特旗", "锡林浩特市", "东乌珠穆沁旗"],
    "太仆寺旗": ["康保县", "沽源县", "正镶白旗", "正蓝旗"],
    "镶黄旗": ["化德县", "商都县", "苏尼特右旗", "正镶白旗"],
    "正镶白旗": ["康保县", "化德县", "苏尼特左旗", "太仆寺旗", "镶黄旗", "正蓝旗"],
    "正蓝旗": ["沽源县", "克什克腾旗", "锡林浩特市", "阿巴嘎旗", "苏尼特左旗", "太仆寺旗", "正镶白旗", "多伦县"],
    "多伦县": ["沽源县", "丰宁满族自治县", "围场满族蒙古族自治县", "克什克腾旗", "正蓝旗"],

    // 阿拉善盟
    "阿拉善左旗": ["海勃湾区", "海南区", "乌达区", "鄂托克旗", "磴口县", "乌拉特后旗", "阿拉善右旗", "景泰县", "凉州区", "民勤县", "古浪县", "西夏区", "永宁县", "贺兰县", "大武口区", "惠农区", "平罗县", "青铜峡市", "沙坡头区", "中宁县"],
    "阿拉善右旗": ["阿拉善左旗", "额济纳旗", "金川区", "民勤县", "甘州区", "临泽县", "高台县", "山丹县", "金塔县"],
    "额济纳旗": ["阿拉善右旗", "金塔县", "肃北蒙古族自治县", "玉门市"],


    // ==================== 辽宁省 ====================
    // 沈阳市
    "和平区（沈阳市）": ["沈河区", "皇姑区", "铁西区（沈阳市）", "苏家屯区", "浑南区", "于洪区"],
    "沈河区": ["和平区（沈阳市）", "大东区", "皇姑区", "浑南区"],
    "大东区": ["沈河区", "皇姑区", "浑南区", "沈北新区"],
    "皇姑区": ["和平区（沈阳市）", "沈河区", "大东区", "铁西区（沈阳市）", "沈北新区", "于洪区"],
    "铁西区（沈阳市）": ["和平区（沈阳市）", "皇姑区", "苏家屯区", "于洪区", "辽中区", "新民市", "灯塔市"],
    "苏家屯区": ["和平区（沈阳市）", "铁西区（沈阳市）", "浑南区", "于洪区", "望花区", "抚顺县", "溪湖区", "灯塔市"],
    "浑南区": ["和平区（沈阳市）", "沈河区", "大东区", "苏家屯区", "沈北新区", "望花区", "铁岭县"],
    "沈北新区": ["大东区", "皇姑区", "浑南区", "于洪区", "法库县", "新民市", "铁岭县"],
    "于洪区": ["和平区（沈阳市）", "皇姑区", "铁西区（沈阳市）", "苏家屯区", "沈北新区", "新民市"],
    "辽中区": ["铁西区（沈阳市）", "新民市", "台安县", "黑山县", "辽阳县", "灯塔市"],
    "康平县": ["科尔沁左翼后旗", "法库县", "彰武县", "昌图县"],
    "法库县": ["沈北新区", "康平县", "新民市", "彰武县", "铁岭县", "昌图县", "调兵山市", "开原市"],
    "新民市": ["铁西区（沈阳市）", "沈北新区", "于洪区", "辽中区", "法库县", "黑山县", "阜新蒙古族自治县", "彰武县", "兴隆台区"],

    // 大连市
    "中山区": ["西岗区"],
    "西岗区": ["中山区", "沙河口区", "甘井子区"],
    "沙河口区": ["西岗区", "甘井子区"],
    "甘井子区": ["西岗区", "沙河口区", "旅顺口区", "金州区"],
    "旅顺口区": ["甘井子区"],
    "金州区": ["甘井子区", "普兰店区", "瓦房店市"],
    "普兰店区": ["金州区", "瓦房店市", "庄河市", "盖州市"],
    "长海县": [],
    "瓦房店市": ["金州区", "普兰店区", "盖州市"],
    "庄河市": ["普兰店区", "岫岩满族自治县", "东港市", "盖州市"],

    // 鞍山市
    "铁东区（鞍山市）": ["铁西区（鞍山市）", "立山区", "千山区", "辽阳县"],
    "铁西区（鞍山市）": ["铁东区（鞍山市）", "立山区", "千山区", "海城市", "辽阳县"],
    "立山区": ["铁东区（鞍山市）", "铁西区（鞍山市）", "宏伟区", "太子河区", "辽阳县"],
    "千山区": ["铁东区（鞍山市）", "铁西区（鞍山市）", "海城市", "辽阳县"],
    "台安县": ["辽中区", "海城市", "黑山县", "北镇市", "辽阳县", "盘山县"],
    "岫岩满族自治县": ["庄河市", "海城市", "东港市", "凤城市", "盖州市", "大石桥市", "辽阳县"],
    "海城市": ["铁西区（鞍山市）", "千山区", "台安县", "岫岩满族自治县", "站前区", "大石桥市", "辽阳县", "大洼区", "盘山县"],

    // 抚顺市
    "新抚区": ["东洲区", "望花区", "顺城区", "抚顺县"],
    "东洲区": ["新抚区", "顺城区", "抚顺县", "新宾满族自治县", "清原满族自治县", "铁岭县"],
    "望花区": ["苏家屯区", "浑南区", "新抚区", "顺城区", "抚顺县", "铁岭县"],
    "顺城区": ["新抚区", "东洲区", "望花区", "铁岭县"],
    "抚顺县": ["苏家屯区", "新抚区", "东洲区", "望花区", "新宾满族自治县", "溪湖区", "本溪满族自治县"],
    "新宾满族自治县": ["东洲区", "抚顺县", "清原满族自治县", "本溪满族自治县", "桓仁满族自治县", "通化县", "柳河县"],
    "清原满族自治县": ["东洲区", "新宾满族自治县", "铁岭县", "西丰县", "开原市", "东丰县", "柳河县", "梅河口市"],

    // 本溪市
    "平山区": ["溪湖区", "明山区", "南芬区", "辽阳县", "灯塔市"],
    "溪湖区": ["苏家屯区", "抚顺县", "平山区", "明山区", "本溪满族自治县", "灯塔市"],
    "明山区": ["平山区", "溪湖区", "南芬区", "本溪满族自治县"],
    "南芬区": ["平山区", "明山区", "本溪满族自治县", "辽阳县"],
    "本溪满族自治县": ["抚顺县", "新宾满族自治县", "溪湖区", "明山区", "南芬区", "桓仁满族自治县", "宽甸满族自治县", "凤城市", "辽阳县"],
    "桓仁满族自治县": ["新宾满族自治县", "本溪满族自治县", "宽甸满族自治县", "通化县", "集安市"],

    // 丹东市
    "元宝区": ["振兴区", "振安区"],
    "振兴区": ["元宝区", "振安区", "东港市"],
    "振安区": ["元宝区", "振兴区", "宽甸满族自治县", "东港市", "凤城市"],
    "宽甸满族自治县": ["本溪满族自治县", "桓仁满族自治县", "振安区", "凤城市", "集安市"],
    "东港市": ["庄河市", "岫岩满族自治县", "振兴区", "振安区", "凤城市"],
    "凤城市": ["岫岩满族自治县", "本溪满族自治县", "振安区", "宽甸满族自治县", "东港市", "辽阳县"],

    // 锦州市
    "古塔区": ["凌河区", "太和区", "凌海市"],
    "凌河区": ["古塔区", "太和区", "凌海市"],
    "太和区": ["古塔区", "凌河区", "义县", "凌海市", "连山区", "南票区"],
    "黑山县": ["辽中区", "新民市", "台安县", "北镇市", "阜新蒙古族自治县"],
    "义县": ["太和区", "凌海市", "北镇市", "清河门区", "阜新蒙古族自治县", "北票市"],
    "凌海市": ["古塔区", "凌河区", "太和区", "义县", "北镇市", "兴隆台区", "盘山县", "朝阳县", "北票市", "南票区"],
    "北镇市": ["台安县", "黑山县", "义县", "凌海市", "阜新蒙古族自治县", "盘山县"],

    // 营口市
    "站前区": ["海城市", "西市区", "老边区", "大石桥市", "大洼区"],
    "西市区": ["站前区", "老边区", "盖州市", "大洼区"],
    "鲅鱼圈区": ["盖州市"],
    "老边区": ["站前区", "西市区", "盖州市", "大石桥市"],
    "盖州市": ["普兰店区", "瓦房店市", "庄河市", "岫岩满族自治县", "西市区", "鲅鱼圈区", "老边区", "大石桥市"],
    "大石桥市": ["岫岩满族自治县", "海城市", "站前区", "老边区", "盖州市", "大洼区"],

    // 阜新市
    "海州区（阜新市）": ["太平区", "细河区", "阜新蒙古族自治县"],
    "新邱区": ["太平区", "阜新蒙古族自治县"],
    "太平区": ["海州区（阜新市）", "新邱区", "细河区", "阜新蒙古族自治县"],
    "清河门区": ["义县", "阜新蒙古族自治县"],
    "细河区": ["海州区（阜新市）", "太平区", "阜新蒙古族自治县"],
    "阜新蒙古族自治县": ["库伦旗", "奈曼旗", "新民市", "黑山县", "义县", "北镇市", "海州区（阜新市）", "新邱区", "太平区", "清河门区", "细河区", "彰武县", "北票市"],
    "彰武县": ["科尔沁左翼后旗", "库伦旗", "康平县", "法库县", "新民市", "阜新蒙古族自治县"],

    // 辽阳市
    "白塔区": ["文圣区", "宏伟区", "太子河区"],
    "文圣区": ["白塔区", "宏伟区", "弓长岭区", "太子河区", "灯塔市"],
    "宏伟区": ["立山区", "白塔区", "文圣区", "弓长岭区", "太子河区", "辽阳县"],
    "弓长岭区": ["文圣区", "宏伟区", "辽阳县", "灯塔市"],
    "太子河区": ["立山区", "白塔区", "文圣区", "宏伟区", "辽阳县", "灯塔市"],
    "辽阳县": ["辽中区", "铁东区（鞍山市）", "铁西区（鞍山市）", "立山区", "千山区", "台安县", "岫岩满族自治县", "海城市", "平山区", "南芬区", "本溪满族自治县", "凤城市", "宏伟区", "弓长岭区", "太子河区", "灯塔市"],
    "灯塔市": ["铁西区（沈阳市）", "苏家屯区", "辽中区", "平山区", "溪湖区", "文圣区", "弓长岭区", "太子河区", "辽阳县"],

    // 盘锦市
    "双台子区": ["兴隆台区", "盘山县"],
    "兴隆台区": ["新民市", "凌海市", "双台子区", "大洼区", "盘山县"],
    "大洼区": ["海城市", "站前区", "西市区", "大石桥市", "兴隆台区", "盘山县"],
    "盘山县": ["台安县", "海城市", "凌海市", "北镇市", "双台子区", "兴隆台区", "大洼区"],

    // 铁岭市
    "银州区": ["铁岭县"],
    "清河区": ["西丰县", "开原市"],
    "铁岭县": ["浑南区", "沈北新区", "法库县", "东洲区", "望花区", "顺城区", "清原满族自治县", "银州区", "调兵山市", "开原市"],
    "西丰县": ["清原满族自治县", "清河区", "开原市", "铁东区（四平市）", "东丰县", "东辽县"],
    "昌图县": ["科尔沁左翼后旗", "康平县", "法库县", "开原市", "铁西区（四平市）", "铁东区（四平市）", "梨树县", "双辽市"],
    "调兵山市": ["法库县", "铁岭县"],
    "开原市": ["法库县", "清原满族自治县", "清河区", "铁岭县", "西丰县", "昌图县", "铁东区（四平市）"],

    // 朝阳市
    "双塔区": ["龙城区", "朝阳县", "北票市"],
    "龙城区": ["双塔区", "朝阳县", "北票市"],
    "朝阳县": ["敖汉旗", "凌海市", "双塔区", "龙城区", "建平县", "喀喇沁左翼蒙古族自治县", "北票市", "连山区", "南票区", "建昌县"],
    "建平县": ["元宝山区", "喀喇沁旗", "宁城县", "敖汉旗", "朝阳县", "喀喇沁左翼蒙古族自治县", "凌源市"],
    "喀喇沁左翼蒙古族自治县": ["朝阳县", "建平县", "凌源市", "建昌县"],
    "北票市": ["敖汉旗", "奈曼旗", "义县", "凌海市", "阜新蒙古族自治县", "双塔区", "龙城区", "朝阳县"],
    "凌源市": ["青龙满族自治县", "宽城满族自治县", "平泉市", "宁城县", "建平县", "喀喇沁左翼蒙古族自治县", "建昌县"],

    // 葫芦岛市
    "连山区": ["太和区", "朝阳县", "龙港区", "南票区", "建昌县", "兴城市"],
    "龙港区": ["连山区", "兴城市"],
    "南票区": ["太和区", "凌海市", "朝阳县", "连山区"],
    "绥中县": ["海港区", "山海关区", "青龙满族自治县", "建昌县", "兴城市"],
    "建昌县": ["青龙满族自治县", "朝阳县", "喀喇沁左翼蒙古族自治县", "凌源市", "连山区", "绥中县", "兴城市"],
    "兴城市": ["连山区", "龙港区", "绥中县", "建昌县"],


    // ==================== 吉林省 ====================
    // 长春市
    "南关区": ["宽城区", "朝阳区（长春市）", "二道区", "双阳区", "伊通满族自治县"],
    "宽城区": ["南关区", "朝阳区（长春市）", "二道区", "绿园区", "九台区", "农安县", "德惠市"],
    "朝阳区（长春市）": ["南关区", "宽城区", "绿园区", "公主岭市", "伊通满族自治县"],
    "二道区": ["南关区", "宽城区", "双阳区", "九台区", "永吉县"],
    "绿园区": ["宽城区", "朝阳区（长春市）", "农安县", "公主岭市"],
    "双阳区": ["南关区", "二道区", "永吉县", "磐石市", "伊通满族自治县"],
    "九台区": ["宽城区", "二道区", "德惠市", "昌邑区", "龙潭区", "船营区", "永吉县", "舒兰市"],
    "农安县": ["宽城区", "绿园区", "德惠市", "公主岭市", "前郭尔罗斯蒙古族自治县", "长岭县", "扶余市"],
    "榆树市": ["德惠市", "舒兰市", "扶余市", "双城区", "五常市"],
    "德惠市": ["宽城区", "九台区", "农安县", "榆树市", "扶余市"],
    "公主岭市": ["朝阳区（长春市）", "绿园区", "农安县", "铁西区（四平市）", "铁东区（四平市）", "梨树县", "伊通满族自治县", "双辽市", "长岭县"],

    // 吉林市
    "昌邑区": ["九台区", "龙潭区", "船营区", "丰满区"],
    "龙潭区": ["九台区", "昌邑区", "丰满区", "蛟河市", "舒兰市"],
    "船营区": ["九台区", "昌邑区", "丰满区", "永吉县"],
    "丰满区": ["昌邑区", "龙潭区", "船营区", "永吉县", "蛟河市", "桦甸市"],
    "永吉县": ["二道区", "双阳区", "九台区", "船营区", "丰满区", "桦甸市", "磐石市"],
    "蛟河市": ["龙潭区", "丰满区", "桦甸市", "舒兰市", "敦化市", "五常市"],
    "桦甸市": ["丰满区", "永吉县", "蛟河市", "磐石市", "辉南县", "抚松县", "靖宇县", "敦化市"],
    "舒兰市": ["九台区", "榆树市", "龙潭区", "蛟河市", "五常市"],
    "磐石市": ["双阳区", "永吉县", "桦甸市", "伊通满族自治县", "东丰县", "辉南县", "梅河口市"],

    // 四平市
    "铁西区（四平市）": ["昌图县", "公主岭市", "铁东区（四平市）", "梨树县"],
    "铁东区（四平市）": ["西丰县", "昌图县", "开原市", "公主岭市", "铁西区（四平市）", "伊通满族自治县"],
    "梨树县": ["昌图县", "公主岭市", "铁西区（四平市）", "双辽市"],
    "伊通满族自治县": ["南关区", "朝阳区（长春市）", "双阳区", "公主岭市", "磐石市", "铁东区（四平市）", "东丰县", "东辽县"],
    "双辽市": ["科尔沁左翼中旗", "科尔沁左翼后旗", "昌图县", "公主岭市", "梨树县", "长岭县"],

    // 辽源市
    "龙山区": ["西安区（辽源市）", "东辽县"],
    "西安区（辽源市）": ["龙山区", "东辽县"],
    "东丰县": ["清原满族自治县", "西丰县", "磐石市", "伊通满族自治县", "东辽县", "梅河口市"],
    "东辽县": ["西丰县", "伊通满族自治县", "龙山区", "西安区（辽源市）", "东丰县"],

    // 通化市
    "东昌区": ["二道江区", "通化县", "集安市"],
    "二道江区": ["东昌区", "通化县", "浑江区"],
    "通化县": ["新宾满族自治县", "桓仁满族自治县", "东昌区", "二道江区", "柳河县", "集安市", "浑江区"],
    "辉南县": ["桦甸市", "磐石市", "柳河县", "梅河口市", "靖宇县"],
    "柳河县": ["新宾满族自治县", "清原满族自治县", "通化县", "辉南县", "梅河口市", "浑江区", "江源区", "靖宇县"],
    "梅河口市": ["清原满族自治县", "磐石市", "东丰县", "辉南县", "柳河县"],
    "集安市": ["桓仁满族自治县", "宽甸满族自治县", "东昌区", "通化县", "浑江区"],

    // 白山市
    "浑江区": ["二道江区", "通化县", "柳河县", "集安市", "江源区", "临江市"],
    "江源区": ["柳河县", "浑江区", "抚松县", "靖宇县", "临江市"],
    "抚松县": ["桦甸市", "江源区", "靖宇县", "长白朝鲜族自治县", "临江市", "安图县", "敦化市"],
    "靖宇县": ["桦甸市", "辉南县", "柳河县", "江源区", "抚松县"],
    "长白朝鲜族自治县": ["抚松县", "临江市"],
    "临江市": ["浑江区", "江源区", "抚松县", "长白朝鲜族自治县"],

    // 松原市
    "宁江区": ["前郭尔罗斯蒙古族自治县", "扶余市", "肇源县"],
    "前郭尔罗斯蒙古族自治县": ["农安县", "宁江区", "长岭县", "乾安县", "扶余市", "大安市", "肇源县"],
    "长岭县": ["科尔沁左翼中旗", "农安县", "公主岭市", "双辽市", "前郭尔罗斯蒙古族自治县", "乾安县", "通榆县"],
    "乾安县": ["前郭尔罗斯蒙古族自治县", "长岭县", "通榆县", "大安市"],
    "扶余市": ["农安县", "榆树市", "德惠市", "宁江区", "前郭尔罗斯蒙古族自治县", "双城区", "肇源县"],

    // 白城市
    "洮北区": ["乌兰浩特市", "镇赉县", "洮南市", "大安市"],
    "镇赉县": ["乌兰浩特市", "扎赉特旗", "洮北区", "大安市", "泰来县", "肇源县", "杜尔伯特蒙古族自治县"],
    "通榆县": ["科尔沁左翼中旗", "科尔沁右翼中旗", "长岭县", "乾安县", "洮南市", "大安市"],
    "洮南市": ["乌兰浩特市", "科尔沁右翼前旗", "科尔沁右翼中旗", "突泉县", "洮北区", "通榆县", "大安市"],
    "大安市": ["前郭尔罗斯蒙古族自治县", "乾安县", "洮北区", "镇赉县", "通榆县", "洮南市", "肇源县"],

    // 延边朝鲜族自治州
    "延吉市": ["图们市", "敦化市", "龙井市", "汪清县", "安图县"],
    "图们市": ["延吉市", "珲春市", "龙井市", "汪清县"],
    "敦化市": ["蛟河市", "桦甸市", "抚松县", "延吉市", "汪清县", "安图县", "五常市", "海林市", "宁安市"],
    "珲春市": ["图们市", "汪清县", "东宁市"],
    "龙井市": ["延吉市", "图们市", "和龙市", "安图县"],
    "和龙市": ["龙井市", "安图县"],
    "汪清县": ["延吉市", "图们市", "敦化市", "珲春市", "宁安市", "穆棱市", "东宁市"],
    "安图县": ["抚松县", "延吉市", "敦化市", "龙井市", "和龙市"],


    // ==================== 黑龙江省 ====================
    // 哈尔滨市
    "道里区": ["南岗区", "道外区", "松北区", "双城区", "肇东市"],
    "南岗区": ["道里区", "道外区", "平房区", "香坊区", "双城区"],
    "道外区": ["道里区", "南岗区", "松北区", "香坊区", "呼兰区", "阿城区", "宾县"],
    "平房区": ["南岗区", "香坊区", "阿城区", "双城区"],
    "松北区": ["道里区", "道外区", "呼兰区", "兰西县", "肇东市"],
    "香坊区": ["南岗区", "道外区", "平房区", "阿城区"],
    "呼兰区": ["道外区", "松北区", "宾县", "巴彦县", "北林区", "兰西县"],
    "阿城区": ["道外区", "平房区", "香坊区", "双城区", "宾县", "尚志市", "五常市"],
    "双城区": ["榆树市", "扶余市", "道里区", "南岗区", "平房区", "阿城区", "五常市", "肇源县", "肇东市"],
    "依兰县": ["方正县", "通河县", "大箐山县", "南岔县", "郊区（佳木斯市）", "桦南县", "汤原县", "勃利县", "林口县"],
    "方正县": ["依兰县", "宾县", "通河县", "延寿县", "尚志市", "林口县", "海林市"],
    "宾县": ["道外区", "呼兰区", "阿城区", "方正县", "巴彦县", "木兰县", "通河县", "延寿县", "尚志市"],
    "巴彦县": ["呼兰区", "宾县", "木兰县", "北林区", "庆安县"],
    "木兰县": ["宾县", "巴彦县", "通河县", "庆安县"],
    "通河县": ["依兰县", "方正县", "宾县", "木兰县", "大箐山县", "铁力市", "庆安县"],
    "延寿县": ["方正县", "宾县", "尚志市"],
    "尚志市": ["阿城区", "方正县", "宾县", "延寿县", "五常市", "海林市"],
    "五常市": ["榆树市", "蛟河市", "舒兰市", "敦化市", "阿城区", "双城区", "尚志市", "海林市"],

    // 齐齐哈尔市
    "龙沙区": ["建华区", "铁锋区", "昂昂溪区", "梅里斯达斡尔族区"],
    "建华区": ["龙沙区", "铁锋区", "梅里斯达斡尔族区", "富裕县"],
    "铁锋区": ["龙沙区", "建华区", "昂昂溪区", "富裕县", "林甸县", "杜尔伯特蒙古族自治县"],
    "昂昂溪区": ["龙沙区", "铁锋区", "富拉尔基区", "梅里斯达斡尔族区", "泰来县", "杜尔伯特蒙古族自治县"],
    "富拉尔基区": ["昂昂溪区", "梅里斯达斡尔族区", "龙江县", "泰来县"],
    "碾子山区": ["扎兰屯市", "龙江县", "甘南县"],
    "梅里斯达斡尔族区": ["龙沙区", "建华区", "昂昂溪区", "富拉尔基区", "龙江县", "甘南县", "富裕县"],
    "龙江县": ["扎兰屯市", "扎赉特旗", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "泰来县", "甘南县"],
    "依安县": ["富裕县", "克山县", "拜泉县", "讷河市", "林甸县", "明水县"],
    "泰来县": ["扎赉特旗", "镇赉县", "昂昂溪区", "富拉尔基区", "龙江县", "杜尔伯特蒙古族自治县"],
    "甘南县": ["阿荣旗", "莫力达瓦达斡尔族自治旗", "扎兰屯市", "碾子山区", "梅里斯达斡尔族区", "龙江县", "富裕县", "讷河市"],
    "富裕县": ["建华区", "铁锋区", "梅里斯达斡尔族区", "依安县", "甘南县", "讷河市", "林甸县"],
    "克山县": ["依安县", "克东县", "拜泉县", "讷河市", "五大连池市"],
    "克东县": ["克山县", "拜泉县", "北安市", "五大连池市"],
    "拜泉县": ["依安县", "克山县", "克东县", "北安市", "明水县", "海伦市"],
    "讷河市": ["莫力达瓦达斡尔族自治旗", "依安县", "甘南县", "富裕县", "克山县", "五大连池市", "嫩江市"],

    // 鸡西市
    "鸡冠区": ["恒山区", "滴道区", "城子河区", "鸡东县"],
    "恒山区": ["鸡冠区", "滴道区", "梨树区", "鸡东县"],
    "滴道区": ["鸡冠区", "恒山区", "梨树区", "城子河区", "麻山区", "鸡东县", "林口县"],
    "梨树区": ["恒山区", "滴道区", "麻山区", "鸡东县", "穆棱市"],
    "城子河区": ["鸡冠区", "滴道区", "鸡东县"],
    "麻山区": ["滴道区", "梨树区", "林口县", "穆棱市"],
    "鸡东县": ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "密山市", "茄子河区", "勃利县", "林口县", "穆棱市"],
    "虎林市": ["密山市", "宝清县", "饶河县"],
    "密山市": ["鸡东县", "虎林市", "宝清县", "茄子河区"],

    // 鹤岗市
    "向阳区（鹤岗市）": ["工农区", "南山区（鹤岗市）", "东山区", "兴山区"],
    "工农区": ["向阳区（鹤岗市）", "南山区（鹤岗市）", "东山区"],
    "南山区（鹤岗市）": ["向阳区（鹤岗市）", "工农区", "兴安区", "东山区"],
    "兴安区": ["南山区（鹤岗市）", "东山区", "汤原县"],
    "东山区": ["向阳区（鹤岗市）", "工农区", "南山区（鹤岗市）", "兴安区", "兴山区", "萝北县", "伊美区", "嘉荫县", "丰林县", "南岔县", "金林区", "汤原县"],
    "兴山区": ["向阳区（鹤岗市）", "东山区"],
    "萝北县": ["东山区", "绥滨县", "嘉荫县", "桦川县", "汤原县"],
    "绥滨县": ["萝北县", "桦川县", "同江市", "富锦市"],

    // 双鸭山市
    "尖山区": ["岭东区", "四方台区", "集贤县"],
    "岭东区": ["尖山区", "四方台区", "宝山区（双鸭山市）", "集贤县", "宝清县", "桦南县"],
    "四方台区": ["尖山区", "岭东区", "宝山区（双鸭山市）", "集贤县"],
    "宝山区（双鸭山市）": ["岭东区", "四方台区", "集贤县", "友谊县", "宝清县"],
    "集贤县": ["尖山区", "岭东区", "四方台区", "宝山区（双鸭山市）", "友谊县", "桦南县", "桦川县", "富锦市"],
    "友谊县": ["宝山区（双鸭山市）", "集贤县", "宝清县", "富锦市"],
    "宝清县": ["虎林市", "密山市", "岭东区", "宝山区（双鸭山市）", "友谊县", "饶河县", "桦南县", "富锦市", "新兴区", "茄子河区"],
    "饶河县": ["虎林市", "宝清县", "同江市", "富锦市", "抚远市"],

    // 大庆市
    "萨尔图区": ["龙凤区", "让胡路区", "红岗区", "林甸县", "安达市"],
    "龙凤区": ["萨尔图区", "红岗区", "安达市"],
    "让胡路区": ["萨尔图区", "红岗区", "大同区", "林甸县", "杜尔伯特蒙古族自治县"],
    "红岗区": ["萨尔图区", "龙凤区", "让胡路区", "大同区", "肇州县", "安达市"],
    "大同区": ["让胡路区", "红岗区", "肇州县", "肇源县", "杜尔伯特蒙古族自治县", "安达市"],
    "肇州县": ["红岗区", "大同区", "肇源县", "安达市", "肇东市"],
    "肇源县": ["宁江区", "前郭尔罗斯蒙古族自治县", "扶余市", "镇赉县", "大安市", "双城区", "大同区", "肇州县", "杜尔伯特蒙古族自治县", "肇东市"],
    "林甸县": ["铁锋区", "依安县", "富裕县", "萨尔图区", "让胡路区", "杜尔伯特蒙古族自治县", "青冈县", "明水县", "安达市"],
    "杜尔伯特蒙古族自治县": ["镇赉县", "铁锋区", "昂昂溪区", "泰来县", "让胡路区", "大同区", "肇源县", "林甸县"],

    // 伊春市
    "伊美区": ["东山区", "乌翠区", "友好区", "丰林县", "南岔县", "金林区"],
    "乌翠区": ["伊美区", "友好区", "大箐山县", "铁力市", "庆安县", "绥棱县"],
    "友好区": ["伊美区", "乌翠区", "丰林县", "逊克县", "绥棱县"],
    "嘉荫县": ["东山区", "萝北县", "汤旺县", "丰林县", "逊克县"],
    "汤旺县": ["嘉荫县", "丰林县", "逊克县"],
    "丰林县": ["东山区", "伊美区", "友好区", "嘉荫县", "汤旺县", "逊克县"],
    "大箐山县": ["依兰县", "通河县", "乌翠区", "南岔县", "铁力市"],
    "南岔县": ["依兰县", "东山区", "伊美区", "大箐山县", "金林区", "汤原县"],
    "金林区": ["东山区", "伊美区", "南岔县"],
    "铁力市": ["通河县", "乌翠区", "大箐山县", "庆安县"],

    // 佳木斯市
    "向阳区（佳木斯市）": ["前进区", "东风区", "郊区（佳木斯市）"],
    "前进区": ["向阳区（佳木斯市）", "东风区", "郊区（佳木斯市）"],
    "东风区": ["向阳区（佳木斯市）", "前进区", "郊区（佳木斯市）", "桦川县"],
    "郊区（佳木斯市）": ["依兰县", "向阳区（佳木斯市）", "前进区", "东风区", "桦南县", "桦川县", "汤原县"],
    "桦南县": ["依兰县", "岭东区", "集贤县", "宝清县", "郊区（佳木斯市）", "桦川县", "新兴区", "勃利县"],
    "桦川县": ["萝北县", "绥滨县", "集贤县", "东风区", "郊区（佳木斯市）", "桦南县", "汤原县", "富锦市"],
    "汤原县": ["依兰县", "兴安区", "东山区", "萝北县", "南岔县", "郊区（佳木斯市）", "桦川县"],
    "同江市": ["绥滨县", "饶河县", "富锦市", "抚远市"],
    "富锦市": ["绥滨县", "集贤县", "友谊县", "宝清县", "饶河县", "桦川县", "同江市"],
    "抚远市": ["饶河县", "同江市"],

    // 七台河市
    "新兴区": ["宝清县", "桦南县", "桃山区", "茄子河区", "勃利县"],
    "桃山区": ["新兴区", "茄子河区", "勃利县"],
    "茄子河区": ["鸡东县", "密山市", "宝清县", "新兴区", "桃山区", "勃利县"],
    "勃利县": ["依兰县", "鸡东县", "桦南县", "新兴区", "桃山区", "茄子河区", "林口县"],
    
    // 牡丹江市
    "东安区": ["阳明区", "爱民区", "西安区（牡丹江市）", "宁安市", "穆棱市"],
    "阳明区": ["东安区", "爱民区", "林口县", "海林市", "穆棱市"],
    "爱民区": ["东安区", "阳明区", "西安区（牡丹江市）", "海林市"],
    "西安区（牡丹江市）": ["东安区", "爱民区", "海林市", "宁安市"],
    "林口县": ["依兰县", "方正县", "滴道区", "麻山区", "鸡东县", "勃利县", "阳明区", "海林市", "穆棱市"],
    "绥芬河市": ["东宁市"],
    "海林市": ["敦化市", "方正县", "尚志市", "五常市", "阳明区", "爱民区", "西安区（牡丹江市）", "林口县", "宁安市"],
    "宁安市": ["敦化市", "汪清县", "东安区", "西安区（牡丹江市）", "海林市", "穆棱市"],
    "穆棱市": ["汪清县", "梨树区", "麻山区", "鸡东县", "东安区", "阳明区", "林口县", "宁安市", "东宁市"],
    "东宁市": ["珲春市", "汪清县", "绥芬河市", "穆棱市"],

    // 黑河市
    "爱辉区": ["孙吴县", "嫩江市", "呼玛县"],
    "逊克县": ["友好区", "嘉荫县", "汤旺县", "丰林县", "孙吴县", "北安市", "五大连池市", "绥棱县"],
    "孙吴县": ["爱辉区", "逊克县", "五大连池市", "嫩江市"],
    "北安市": ["克东县", "拜泉县", "逊克县", "五大连池市", "绥棱县", "海伦市"],
    "五大连池市": ["克山县", "克东县", "讷河市", "逊克县", "孙吴县", "北安市", "嫩江市"],
    "嫩江市": ["莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "讷河市", "爱辉区", "孙吴县", "五大连池市", "呼玛县"],

    // 绥化市
    "北林区": ["呼兰区", "巴彦县", "望奎县", "兰西县", "庆安县", "绥棱县", "海伦市"],
    "望奎县": ["北林区", "兰西县", "青冈县", "海伦市"],
    "兰西县": ["松北区", "呼兰区", "北林区", "望奎县", "青冈县", "安达市", "肇东市"],
    "青冈县": ["林甸县", "望奎县", "兰西县", "明水县", "安达市", "海伦市"],
    "庆安县": ["巴彦县", "木兰县", "通河县", "乌翠区", "铁力市", "北林区", "绥棱县"],
    "明水县": ["依安县", "拜泉县", "林甸县", "青冈县", "海伦市"],
    "绥棱县": ["乌翠区", "友好区", "逊克县", "北安市", "北林区", "庆安县", "海伦市"],
    "安达市": ["萨尔图区", "龙凤区", "红岗区", "大同区", "肇州县", "林甸县", "兰西县", "青冈县", "肇东市"],
    "肇东市": ["道里区", "松北区", "双城区", "肇州县", "肇源县", "兰西县", "安达市"],
    "海伦市": ["拜泉县", "北安市", "北林区", "望奎县", "青冈县", "明水县", "绥棱县"],

    // 大兴安岭地区
    "漠河市": ["额尔古纳市", "根河市", "呼玛县", "塔河县"],
    "呼玛县": ["鄂伦春自治旗", "根河市", "爱辉区", "嫩江市", "漠河市", "塔河县"],
    "塔河县": ["漠河市", "呼玛县"],
    "加格达奇区": ["鄂伦春自治旗"],


    // ==================== 上海市 ====================
    "黄浦区": ["徐汇区", "静安区", "虹口区", "浦东新区"],
    "徐汇区": ["黄浦区", "长宁区", "静安区", "闵行区", "浦东新区"],
    "长宁区": ["徐汇区", "静安区", "普陀区（上海市）", "闵行区", "嘉定区"],
    "静安区": ["黄浦区", "徐汇区", "长宁区", "普陀区（上海市）", "虹口区", "宝山区（上海市）"],
    "普陀区（上海市）": ["长宁区", "静安区", "宝山区（上海市）", "嘉定区"],
    "虹口区": ["黄浦区", "静安区", "杨浦区", "宝山区（上海市）", "浦东新区"],
    "杨浦区": ["虹口区", "宝山区（上海市）", "浦东新区"],
    "闵行区": ["徐汇区", "长宁区", "嘉定区", "浦东新区", "松江区", "青浦区", "奉贤区"],
    "宝山区（上海市）": ["静安区", "普陀区（上海市）", "虹口区", "杨浦区", "嘉定区", "浦东新区", "太仓市"],
    "嘉定区": ["长宁区", "普陀区（上海市）", "闵行区", "宝山区（上海市）", "青浦区", "昆山市", "太仓市"],
    "浦东新区": ["黄浦区", "徐汇区", "虹口区", "杨浦区", "闵行区", "宝山区（上海市）", "奉贤区", "嵊泗县"],
    "金山区": ["松江区", "青浦区", "奉贤区", "嘉善县", "平湖市"],
    "松江区": ["闵行区", "金山区", "青浦区", "奉贤区"],
    "青浦区": ["闵行区", "嘉定区", "金山区", "松江区", "吴江区", "昆山市", "嘉善县"],
    "奉贤区": ["闵行区", "浦东新区", "金山区", "松江区"],
    "崇明区": ["太仓市", "海门区", "启东市"],


    // ==================== 江苏省 ====================
    // 南京市
    "玄武区": ["秦淮区", "鼓楼区（南京市）", "栖霞区", "江宁区"],
    "秦淮区": ["玄武区", "建邺区", "鼓楼区（南京市）", "雨花台区", "江宁区"],
    "建邺区": ["秦淮区", "鼓楼区（南京市）", "浦口区", "雨花台区"],
    "鼓楼区（南京市）": ["玄武区", "秦淮区", "建邺区", "浦口区", "栖霞区"],
    "浦口区": ["建邺区", "鼓楼区（南京市）", "栖霞区", "雨花台区", "江宁区", "六合区", "和县", "南谯区", "来安县", "全椒县"],
    "栖霞区": ["玄武区", "鼓楼区（南京市）", "浦口区", "江宁区", "六合区", "仪征市", "丹徒区", "句容市"],
    "雨花台区": ["秦淮区", "建邺区", "浦口区", "江宁区"],
    "江宁区": ["玄武区", "秦淮区", "浦口区", "栖霞区", "雨花台区", "溧水区", "句容市", "花山区", "雨山区", "博望区", "和县"],
    "六合区": ["浦口区", "栖霞区", "仪征市", "来安县", "天长市"],
    "溧水区": ["江宁区", "高淳区", "溧阳市", "句容市", "博望区"],
    "高淳区": ["溧水区", "溧阳市", "博望区", "当涂县", "宣州区", "郎溪县"],

    // 无锡市
    "锡山区": ["惠山区", "梁溪区", "新吴区", "江阴市", "相城区", "常熟市"],
    "惠山区": ["锡山区", "滨湖区", "梁溪区", "江阴市", "武进区"],
    "滨湖区": ["惠山区", "梁溪区", "新吴区", "宜兴市", "武进区", "虎丘区", "吴中区", "相城区"],
    "梁溪区": ["锡山区", "惠山区", "滨湖区", "新吴区"],
    "新吴区": ["锡山区", "滨湖区", "梁溪区", "相城区"],
    "江阴市": ["锡山区", "惠山区", "天宁区", "新北区", "武进区", "常熟市", "张家港市", "靖江市", "泰兴市"],
    "宜兴市": ["滨湖区", "武进区", "金坛区", "溧阳市", "吴中区", "长兴县", "广德市"],

    // 徐州市
    "鼓楼区（徐州市）": ["云龙区", "贾汪区", "泉山区", "铜山区"],
    "云龙区": ["鼓楼区（徐州市）", "贾汪区", "泉山区", "铜山区"],
    "贾汪区": ["鼓楼区（徐州市）", "云龙区", "铜山区", "邳州市", "台儿庄区"],
    "泉山区": ["鼓楼区（徐州市）", "云龙区", "铜山区"],
    "铜山区": ["鼓楼区（徐州市）", "云龙区", "贾汪区", "泉山区", "丰县", "沛县", "睢宁县", "邳州市", "杜集区", "埇桥区", "萧县", "灵璧县", "台儿庄区", "微山县"],
    "丰县": ["铜山区", "沛县", "砀山县", "萧县", "鱼台县", "金乡县", "单县"],
    "沛县": ["铜山区", "丰县", "微山县", "鱼台县"],
    "睢宁县": ["铜山区", "邳州市", "宿城区", "宿豫区", "灵璧县", "泗县"],
    "新沂市": ["邳州市", "东海县", "宿豫区", "沭阳县", "郯城县"],
    "邳州市": ["贾汪区", "铜山区", "睢宁县", "新沂市", "宿豫区", "峄城区", "台儿庄区", "郯城县", "兰陵县"],

    // 常州市
    "天宁区": ["江阴市", "钟楼区", "新北区", "武进区"],
    "钟楼区": ["天宁区", "新北区", "武进区", "丹阳市"],
    "新北区": ["江阴市", "天宁区", "钟楼区", "丹阳市", "扬中市", "泰兴市"],
    "武进区": ["惠山区", "滨湖区", "江阴市", "宜兴市", "天宁区", "钟楼区", "金坛区", "丹阳市"],
    "金坛区": ["宜兴市", "武进区", "溧阳市", "丹徒区", "丹阳市", "句容市"],
    "溧阳市": ["溧水区", "高淳区", "宜兴市", "金坛区", "句容市", "郎溪县", "广德市"],

    // 苏州市
    "虎丘区": ["滨湖区", "吴中区", "相城区", "姑苏区"],
    "吴中区": ["滨湖区", "宜兴市", "虎丘区", "相城区", "姑苏区", "吴江区", "昆山市", "吴兴区", "长兴县"],
    "相城区": ["锡山区", "滨湖区", "新吴区", "虎丘区", "吴中区", "姑苏区", "常熟市", "昆山市"],
    "姑苏区": ["虎丘区", "吴中区", "相城区"],
    "吴江区": ["青浦区", "吴中区", "昆山市", "秀洲区", "嘉善县", "桐乡市", "吴兴区", "南浔区"],
    "常熟市": ["锡山区", "江阴市", "相城区", "张家港市", "昆山市", "太仓市", "崇川区", "海门区"],
    "张家港市": ["江阴市", "常熟市", "通州区（南通市）", "崇川区", "如皋市", "靖江市"],
    "昆山市": ["嘉定区", "青浦区", "吴中区", "相城区", "吴江区", "常熟市", "太仓市"],
    "太仓市": ["宝山区（上海市）", "嘉定区", "崇明区", "常熟市", "昆山市", "海门区"],

    // 南通市
    "通州区（南通市）": ["张家港市", "崇川区", "海门区", "如东县", "如皋市"],
    "崇川区": ["常熟市", "张家港市", "通州区（南通市）", "海门区"],
    "海门区": ["崇明区", "常熟市", "太仓市", "通州区（南通市）", "崇川区", "启东市"],
    "如东县": ["通州区（南通市）", "如皋市", "海安市"],
    "启东市": ["崇明区", "海门区"],
    "如皋市": ["张家港市", "通州区（南通市）", "如东县", "海安市", "靖江市", "泰兴市"],
    "海安市": ["如东县", "如皋市", "东台市", "姜堰区", "泰兴市"],

    // 连云港市
    "连云区": ["海州区（连云港市）", "赣榆区", "灌云县"],
    "海州区（连云港市）": ["连云区", "赣榆区", "东海县", "灌云县"],
    "赣榆区": ["连云区", "海州区（连云港市）", "东海县", "岚山区", "莒南县", "临沭县"],
    "东海县": ["新沂市", "海州区（连云港市）", "赣榆区", "灌云县", "沭阳县", "郯城县", "临沭县"],
    "灌云县": ["连云区", "海州区（连云港市）", "东海县", "灌南县", "响水县", "沭阳县"],
    "灌南县": ["灌云县", "涟水县", "响水县", "沭阳县"],

    // 淮安市
    "淮安区": ["清江浦区", "洪泽区", "涟水县", "阜宁县", "建湖县", "宝应县"],
    "淮阴区": ["清江浦区", "洪泽区", "涟水县", "沭阳县", "泗阳县", "泗洪县"],
    "清江浦区": ["淮安区", "淮阴区", "洪泽区", "涟水县"],
    "洪泽区": ["淮安区", "淮阴区", "清江浦区", "盱眙县", "金湖县", "宝应县", "泗洪县"],
    "涟水县": ["灌南县", "淮安区", "淮阴区", "清江浦区", "响水县", "滨海县", "阜宁县", "沭阳县"],
    "盱眙县": ["洪泽区", "金湖县", "泗洪县", "来安县", "天长市", "明光市"],
    "金湖县": ["洪泽区", "盱眙县", "宝应县", "高邮市", "天长市"],

    // 盐城市
    "亭湖区": ["盐都区", "大丰区", "射阳县", "建湖县"],
    "盐都区": ["亭湖区", "大丰区", "建湖县", "宝应县", "兴化市"],
    "大丰区": ["亭湖区", "盐都区", "东台市", "兴化市"],
    "响水县": ["灌云县", "灌南县", "涟水县", "滨海县"],
    "滨海县": ["涟水县", "响水县", "阜宁县", "射阳县"],
    "阜宁县": ["淮安区", "涟水县", "滨海县", "射阳县", "建湖县"],
    "射阳县": ["亭湖区", "滨海县", "阜宁县", "建湖县"],
    "建湖县": ["淮安区", "亭湖区", "盐都区", "阜宁县", "射阳县", "宝应县"],
    "东台市": ["海安市", "大丰区", "姜堰区", "兴化市"],

    // 扬州市
    "广陵区": ["邗江区", "江都区", "京口区", "丹徒区", "扬中市"],
    "邗江区": ["广陵区", "江都区", "仪征市", "高邮市", "润州区", "丹徒区"],
    "江都区": ["广陵区", "邗江区", "高邮市", "扬中市", "海陵区", "高港区", "姜堰区", "兴化市"],
    "宝应县": ["淮安区", "洪泽区", "金湖县", "盐都区", "建湖县", "高邮市", "兴化市"],
    "仪征市": ["栖霞区", "六合区", "邗江区", "高邮市", "丹徒区", "天长市"],
    "高邮市": ["金湖县", "邗江区", "江都区", "宝应县", "仪征市", "兴化市", "天长市"],

    // 镇江市
    "京口区": ["广陵区", "润州区", "丹徒区", "丹阳市", "扬中市"],
    "润州区": ["邗江区", "京口区", "丹徒区", "句容市"],
    "丹徒区": ["栖霞区", "金坛区", "广陵区", "邗江区", "仪征市", "京口区", "润州区", "丹阳市", "扬中市", "句容市"],
    "丹阳市": ["钟楼区", "新北区", "武进区", "金坛区", "京口区", "丹徒区", "扬中市"],
    "扬中市": ["新北区", "广陵区", "江都区", "京口区", "丹徒区", "丹阳市", "高港区", "泰兴市"],
    "句容市": ["栖霞区", "江宁区", "溧水区", "金坛区", "溧阳市", "润州区", "丹徒区"],

    // 泰州市
    "海陵区": ["江都区", "高港区", "姜堰区"],
    "高港区": ["江都区", "扬中市", "海陵区", "姜堰区", "泰兴市"],
    "姜堰区": ["海安市", "东台市", "江都区", "海陵区", "高港区", "兴化市", "泰兴市"],
    "兴化市": ["盐都区", "大丰区", "东台市", "江都区", "宝应县", "高邮市", "姜堰区"],
    "靖江市": ["江阴市", "张家港市", "如皋市", "泰兴市"],
    "泰兴市": ["江阴市", "新北区", "如皋市", "海安市", "扬中市", "高港区", "姜堰区", "靖江市"],

    // 宿迁市
    "宿城区": ["睢宁县", "宿豫区", "泗阳县", "泗洪县", "泗县"],
    "宿豫区": ["睢宁县", "新沂市", "邳州市", "宿城区", "沭阳县", "泗阳县"],
    "沭阳县": ["新沂市", "东海县", "灌云县", "灌南县", "淮阴区", "涟水县", "宿豫区", "泗阳县"],
    "泗阳县": ["淮阴区", "宿城区", "宿豫区", "沭阳县", "泗洪县"],
    "泗洪县": ["淮阴区", "洪泽区", "盱眙县", "宿城区", "泗阳县", "五河县", "明光市", "泗县"],


    // ==================== 浙江省 ====================
    // 杭州市
    "上城区": ["拱墅区", "西湖区（杭州市）", "滨江区", "萧山区", "临平区", "钱塘区"],
    "拱墅区": ["上城区", "西湖区（杭州市）", "余杭区", "临平区"],
    "西湖区（杭州市）": ["上城区", "拱墅区", "滨江区", "萧山区", "余杭区", "富阳区"],
    "滨江区": ["上城区", "西湖区（杭州市）", "萧山区"],
    "萧山区": ["上城区", "西湖区（杭州市）", "滨江区", "富阳区", "钱塘区", "柯桥区", "诸暨市"],
    "余杭区": ["拱墅区", "西湖区（杭州市）", "富阳区", "临安区", "临平区", "德清县", "安吉县"],
    "富阳区": ["西湖区（杭州市）", "萧山区", "余杭区", "临安区", "桐庐县", "诸暨市"],
    "临安区": ["余杭区", "富阳区", "桐庐县", "淳安县", "安吉县", "歙县", "绩溪县", "宁国市"],
    "临平区": ["上城区", "拱墅区", "余杭区", "钱塘区", "海宁市", "桐乡市", "德清县"],
    "钱塘区": ["上城区", "萧山区", "临平区", "海宁市", "柯桥区"],
    "桐庐县": ["富阳区", "临安区", "淳安县", "建德市", "诸暨市", "浦江县"],
    "淳安县": ["临安区", "桐庐县", "建德市", "衢江区", "常山县", "开化县", "歙县", "休宁县"],
    "建德市": ["桐庐县", "淳安县", "浦江县", "兰溪市", "衢江区", "龙游县"],

    // 宁波市
    "海曙区": ["江北区", "鄞州区", "奉化区", "余姚市"],
    "江北区": ["海曙区", "镇海区", "鄞州区", "余姚市", "慈溪市"],
    "北仑区": ["镇海区", "鄞州区"],
    "镇海区": ["江北区", "北仑区", "鄞州区", "慈溪市"],
    "鄞州区": ["海曙区", "江北区", "北仑区", "镇海区", "奉化区", "象山县"],
    "奉化区": ["海曙区", "鄞州区", "象山县", "宁海县", "余姚市", "新昌县", "嵊州市"],
    "象山县": ["鄞州区", "奉化区", "宁海县"],
    "宁海县": ["奉化区", "象山县", "新昌县", "三门县", "天台县"],
    "余姚市": ["海曙区", "江北区", "奉化区", "慈溪市", "海盐县", "上虞区", "嵊州市"],
    "慈溪市": ["江北区", "镇海区", "余姚市", "海盐县"],

    // 温州市
    "鹿城区": ["龙湾区", "瓯海区", "永嘉县", "乐清市", "青田县"],
    "龙湾区": ["鹿城区", "瓯海区", "洞头区", "瑞安市", "乐清市"],
    "瓯海区": ["鹿城区", "龙湾区", "瑞安市", "青田县"],
    "洞头区": ["龙湾区", "乐清市"],
    "永嘉县": ["鹿城区", "乐清市", "黄岩区", "仙居县", "青田县", "缙云县"],
    "平阳县": ["苍南县", "文成县", "瑞安市", "龙港市"],
    "苍南县": ["平阳县", "文成县", "泰顺县", "龙港市", "福鼎市"],
    "文成县": ["平阳县", "苍南县", "泰顺县", "瑞安市", "青田县", "景宁畲族自治县"],
    "泰顺县": ["苍南县", "文成县", "景宁畲族自治县", "寿宁县", "柘荣县", "福安市", "福鼎市"],
    "瑞安市": ["龙湾区", "瓯海区", "平阳县", "文成县", "青田县"],
    "乐清市": ["鹿城区", "龙湾区", "洞头区", "永嘉县", "黄岩区", "温岭市", "玉环市"],
    "龙港市": ["平阳县", "苍南县"],

    // 嘉兴市
    "南湖区": ["秀洲区", "嘉善县", "海盐县", "平湖市"],
    "秀洲区": ["吴江区", "南湖区", "嘉善县", "海盐县", "海宁市", "桐乡市"],
    "嘉善县": ["金山区", "青浦区", "吴江区", "南湖区", "秀洲区", "平湖市"],
    "海盐县": ["余姚市", "慈溪市", "南湖区", "秀洲区", "海宁市", "平湖市"],
    "海宁市": ["临平区", "钱塘区", "秀洲区", "海盐县", "桐乡市", "柯桥区", "上虞区"],
    "平湖市": ["金山区", "南湖区", "嘉善县", "海盐县"],
    "桐乡市": ["吴江区", "临平区", "秀洲区", "海宁市", "南浔区", "德清县"],

    // 湖州市
    "吴兴区": ["吴中区", "吴江区", "南浔区", "德清县", "长兴县", "安吉县"],
    "南浔区": ["吴江区", "桐乡市", "吴兴区", "德清县"],
    "德清县": ["余杭区", "临平区", "桐乡市", "吴兴区", "南浔区", "安吉县"],
    "长兴县": ["宜兴市", "吴中区", "吴兴区", "安吉县", "广德市"],
    "安吉县": ["余杭区", "临安区", "吴兴区", "德清县", "长兴县", "宁国市", "广德市"],

    // 绍兴市
    "越城区": ["柯桥区", "上虞区"],
    "柯桥区": ["萧山区", "钱塘区", "海宁市", "越城区", "上虞区", "诸暨市", "嵊州市"],
    "上虞区": ["余姚市", "海宁市", "越城区", "柯桥区", "嵊州市"],
    "新昌县": ["奉化区", "宁海县", "嵊州市", "磐安县", "东阳市", "天台县"],
    "诸暨市": ["萧山区", "富阳区", "桐庐县", "柯桥区", "嵊州市", "浦江县", "义乌市", "东阳市"],
    "嵊州市": ["奉化区", "余姚市", "柯桥区", "上虞区", "新昌县", "诸暨市", "东阳市"],

    // 金华市
    "婺城区": ["金东区", "武义县", "兰溪市", "龙游县", "遂昌县"],
    "金东区": ["婺城区", "武义县", "兰溪市", "义乌市"],
    "武义县": ["婺城区", "金东区", "义乌市", "永康市", "莲都区", "缙云县", "遂昌县", "松阳县"],
    "浦江县": ["桐庐县", "建德市", "诸暨市", "兰溪市", "义乌市"],
    "磐安县": ["新昌县", "东阳市", "永康市", "天台县", "仙居县", "缙云县"],
    "兰溪市": ["建德市", "婺城区", "金东区", "浦江县", "义乌市", "龙游县"],
    "义乌市": ["诸暨市", "金东区", "武义县", "浦江县", "兰溪市", "东阳市", "永康市"],
    "东阳市": ["新昌县", "诸暨市", "嵊州市", "磐安县", "义乌市", "永康市"],
    "永康市": ["武义县", "磐安县", "义乌市", "东阳市", "缙云县"],

    // 衢州市
    "柯城区": ["衢江区", "常山县", "江山市"],
    "衢江区": ["淳安县", "建德市", "柯城区", "常山县", "龙游县", "江山市", "遂昌县"],
    "常山县": ["淳安县", "柯城区", "衢江区", "开化县", "江山市", "玉山县"],
    "开化县": ["淳安县", "常山县", "休宁县", "玉山县", "婺源县", "德兴市"],
    "龙游县": ["建德市", "婺城区", "兰溪市", "衢江区", "遂昌县"],
    "江山市": ["柯城区", "衢江区", "常山县", "遂昌县", "浦城县", "广丰区", "玉山县"],

    // 舟山市
    "定海区": ["普陀区（舟山市）"],
    "普陀区（舟山市）": ["定海区"],
    "岱山县": [],
    "嵊泗县": ["浦东新区"],

    // 台州市
    "椒江区": ["黄岩区", "路桥区", "临海市"],
    "黄岩区": ["永嘉县", "乐清市", "椒江区", "路桥区", "仙居县", "温岭市", "临海市"],
    "路桥区": ["椒江区", "黄岩区", "温岭市"],
    "三门县": ["宁海县", "天台县", "临海市"],
    "天台县": ["宁海县", "新昌县", "磐安县", "三门县", "仙居县", "临海市"],
    "仙居县": ["永嘉县", "磐安县", "黄岩区", "天台县", "临海市", "缙云县"],
    "温岭市": ["乐清市", "黄岩区", "路桥区", "玉环市"],
    "临海市": ["椒江区", "黄岩区", "三门县", "天台县", "仙居县"],
    "玉环市": ["乐清市", "温岭市"],

    // 丽水市
    "莲都区": ["武义县", "青田县", "缙云县", "松阳县", "云和县", "景宁畲族自治县"],
    "青田县": ["鹿城区", "瓯海区", "永嘉县", "文成县", "瑞安市", "莲都区", "缙云县", "景宁畲族自治县"],
    "缙云县": ["永嘉县", "武义县", "磐安县", "永康市", "仙居县", "莲都区", "青田县"],
    "遂昌县": ["婺城区", "武义县", "衢江区", "龙游县", "江山市", "松阳县", "龙泉市", "浦城县"],
    "松阳县": ["武义县", "莲都区", "遂昌县", "云和县", "龙泉市"],
    "云和县": ["莲都区", "松阳县", "景宁畲族自治县", "龙泉市"],
    "庆元县": ["景宁畲族自治县", "龙泉市", "松溪县", "政和县", "寿宁县"],
    "景宁畲族自治县": ["文成县", "泰顺县", "莲都区", "青田县", "云和县", "庆元县", "龙泉市", "寿宁县"],
    "龙泉市": ["遂昌县", "松阳县", "云和县", "庆元县", "景宁畲族自治县", "浦城县", "松溪县"],


    // ==================== 安徽省 ====================
    // 合肥市
    "瑶海区": ["庐阳区", "包河区", "长丰县", "肥东县"],
    "庐阳区": ["瑶海区", "蜀山区", "包河区", "长丰县"],
    "蜀山区": ["庐阳区", "包河区", "长丰县", "肥西县", "寿县"],
    "包河区": ["瑶海区", "庐阳区", "蜀山区", "肥东县", "肥西县"],
    "长丰县": ["瑶海区", "庐阳区", "蜀山区", "肥东县", "大通区", "田家庵区", "寿县", "定远县"],
    "肥东县": ["瑶海区", "包河区", "长丰县", "肥西县", "庐江县", "巢湖市", "南谯区", "全椒县", "定远县"],
    "肥西县": ["蜀山区", "包河区", "肥东县", "庐江县", "寿县", "金安区", "舒城县"],
    "庐江县": ["肥东县", "肥西县", "巢湖市", "无为市", "枞阳县", "桐城市", "舒城县"],
    "巢湖市": ["肥东县", "庐江县", "无为市", "含山县", "全椒县"],

    // 芜湖市
    "镜湖区": ["鸠江区", "弋江区", "湾沚区", "南陵县"],
    "鸠江区": ["镜湖区", "弋江区", "湾沚区", "繁昌区", "无为市", "当涂县", "含山县", "和县"],
    "弋江区": ["镜湖区", "鸠江区", "繁昌区", "南陵县"],
    "湾沚区": ["镜湖区", "鸠江区", "南陵县", "当涂县", "宣州区"],
    "繁昌区": ["鸠江区", "弋江区", "南陵县", "无为市", "义安区"],
    "南陵县": ["镜湖区", "弋江区", "湾沚区", "繁昌区", "义安区", "青阳县", "宣州区", "泾县"],
    "无为市": ["庐江县", "巢湖市", "鸠江区", "繁昌区", "含山县", "义安区", "郊区（铜陵市）", "枞阳县"],

    // 蚌埠市
    "龙子湖区": ["蚌山区", "淮上区", "凤阳县"],
    "蚌山区": ["龙子湖区", "禹会区", "淮上区", "凤阳县"],
    "禹会区": ["蚌山区", "淮上区", "怀远县", "大通区", "凤阳县"],
    "淮上区": ["龙子湖区", "蚌山区", "禹会区", "怀远县", "五河县", "固镇县", "凤阳县"],
    "怀远县": ["禹会区", "淮上区", "固镇县", "大通区", "潘集区", "濉溪县", "埇桥区", "蒙城县"],
    "五河县": ["泗洪县", "淮上区", "固镇县", "凤阳县", "明光市", "灵璧县", "泗县"],
    "固镇县": ["淮上区", "怀远县", "五河县", "埇桥区", "灵璧县"],

    // 淮南市
    "大通区": ["长丰县", "禹会区", "怀远县", "田家庵区", "潘集区", "定远县", "凤阳县"],
    "田家庵区": ["长丰县", "大通区", "谢家集区", "潘集区", "寿县"],
    "谢家集区": ["田家庵区", "八公山区", "潘集区", "寿县"],
    "八公山区": ["谢家集区", "潘集区", "凤台县", "寿县"],
    "潘集区": ["怀远县", "大通区", "田家庵区", "谢家集区", "八公山区", "凤台县", "蒙城县"],
    "凤台县": ["八公山区", "潘集区", "寿县", "颍上县", "蒙城县", "利辛县"],
    "寿县": ["蜀山区", "长丰县", "肥西县", "田家庵区", "谢家集区", "八公山区", "凤台县", "颍上县", "金安区", "裕安区", "霍邱县"],

    // 马鞍山市
    "花山区": ["江宁区", "雨山区", "当涂县", "和县"],
    "雨山区": ["江宁区", "花山区", "博望区", "当涂县"],
    "博望区": ["江宁区", "溧水区", "高淳区", "雨山区", "当涂县"],
    "当涂县": ["高淳区", "鸠江区", "湾沚区", "花山区", "雨山区", "博望区", "和县", "宣州区"],
    "含山县": ["巢湖市", "鸠江区", "无为市", "和县", "全椒县"],
    "和县": ["浦口区", "江宁区", "鸠江区", "花山区", "当涂县", "含山县", "全椒县"],

    // 淮北市
    "杜集区": ["铜山区", "相山区", "烈山区", "萧县"],
    "相山区": ["杜集区", "烈山区", "濉溪县", "萧县", "永城市"],
    "烈山区": ["杜集区", "相山区", "濉溪县", "埇桥区", "萧县"],
    "濉溪县": ["怀远县", "相山区", "烈山区", "埇桥区", "涡阳县", "蒙城县", "永城市"],

    // 铜陵市
    "铜官区": ["义安区", "郊区（铜陵市）"],
    "义安区": ["繁昌区", "南陵县", "无为市", "铜官区", "郊区（铜陵市）", "贵池区", "青阳县"],
    "郊区（铜陵市）": ["无为市", "铜官区", "义安区", "枞阳县", "宜秀区", "怀宁县", "贵池区"],
    "枞阳县": ["庐江县", "无为市", "郊区（铜陵市）", "迎江区", "宜秀区", "桐城市", "贵池区"],

    // 安庆市
    "迎江区": ["枞阳县", "大观区", "宜秀区", "桐城市", "贵池区", "东至县"],
    "大观区": ["迎江区", "宜秀区", "怀宁县", "望江县", "东至县"],
    "宜秀区": ["郊区（铜陵市）", "枞阳县", "迎江区", "大观区", "怀宁县", "桐城市"],
    "怀宁县": ["郊区（铜陵市）", "大观区", "宜秀区", "太湖县", "望江县", "桐城市", "潜山市"],
    "太湖县": ["怀宁县", "宿松县", "望江县", "岳西县", "潜山市", "英山县", "蕲春县"],
    "宿松县": ["太湖县", "望江县", "柴桑区", "湖口县", "彭泽县", "蕲春县", "黄梅县"],
    "望江县": ["大观区", "怀宁县", "太湖县", "宿松县", "东至县", "彭泽县"],
    "岳西县": ["太湖县", "潜山市", "舒城县", "霍山县", "英山县"],
    "桐城市": ["庐江县", "枞阳县", "迎江区", "宜秀区", "怀宁县", "潜山市", "舒城县"],
    "潜山市": ["怀宁县", "太湖县", "岳西县", "桐城市", "舒城县"],

    // 黄山市
    "屯溪区": ["徽州区", "歙县", "休宁县"],
    "黄山区": ["徽州区", "歙县", "休宁县", "黟县", "石台县", "青阳县", "泾县", "绩溪县", "旌德县"],
    "徽州区": ["屯溪区", "黄山区", "歙县", "休宁县"],
    "歙县": ["临安区", "淳安县", "屯溪区", "黄山区", "徽州区", "休宁县", "绩溪县"],
    "休宁县": ["淳安县", "开化县", "屯溪区", "黄山区", "徽州区", "歙县", "黟县", "祁门县", "浮梁县", "婺源县"],
    "黟县": ["黄山区", "休宁县", "祁门县", "石台县"],
    "祁门县": ["休宁县", "黟县", "东至县", "石台县", "浮梁县"],

    // 滁州市
    "琅琊区": ["南谯区", "来安县"],
    "南谯区": ["浦口区", "肥东县", "琅琊区", "来安县", "全椒县", "定远县", "明光市"],
    "来安县": ["浦口区", "六合区", "盱眙县", "琅琊区", "南谯区", "天长市", "明光市"],
    "全椒县": ["浦口区", "肥东县", "巢湖市", "含山县", "和县", "南谯区"],
    "定远县": ["长丰县", "肥东县", "大通区", "南谯区", "凤阳县", "明光市"],
    "凤阳县": ["龙子湖区", "蚌山区", "禹会区", "淮上区", "五河县", "大通区", "定远县", "明光市"],
    "天长市": ["六合区", "盱眙县", "金湖县", "仪征市", "高邮市", "来安县"],
    "明光市": ["盱眙县", "泗洪县", "五河县", "南谯区", "来安县", "定远县", "凤阳县"],

    // 阜阳市
    "颍州区": ["颍东区", "颍泉区", "临泉县", "阜南县", "颍上县"],
    "颍东区": ["颍州区", "颍泉区", "颍上县", "利辛县"],
    "颍泉区": ["颍州区", "颍东区", "临泉县", "太和县", "界首市", "利辛县"],
    "临泉县": ["颍州区", "颍泉区", "阜南县", "界首市", "淮滨县", "沈丘县", "项城市", "平舆县", "新蔡县"],
    "太和县": ["颍泉区", "界首市", "谯城区", "涡阳县", "利辛县", "郸城县"],
    "阜南县": ["颍州区", "临泉县", "颍上县", "霍邱县", "固始县", "淮滨县"],
    "颍上县": ["凤台县", "寿县", "颍州区", "颍东区", "阜南县", "霍邱县", "利辛县"],
    "界首市": ["颍泉区", "临泉县", "太和县", "沈丘县", "郸城县"],

    // 宿州市
    "埇桥区": ["铜山区", "怀远县", "固镇县", "烈山区", "濉溪县", "萧县", "灵璧县"],
    "砀山县": ["丰县", "萧县", "单县", "虞城县", "夏邑县", "永城市"],
    "萧县": ["铜山区", "丰县", "杜集区", "相山区", "烈山区", "埇桥区", "砀山县", "永城市"],
    "灵璧县": ["铜山区", "睢宁县", "五河县", "固镇县", "埇桥区", "泗县"],
    "泗县": ["睢宁县", "宿城区", "泗洪县", "五河县", "灵璧县"],

    // 六安市
    "金安区": ["肥西县", "寿县", "裕安区", "舒城县", "霍山县"],
    "裕安区": ["寿县", "金安区", "叶集区", "霍邱县", "金寨县", "霍山县"],
    "叶集区": ["裕安区", "霍邱县", "金寨县", "固始县"],
    "霍邱县": ["寿县", "阜南县", "颍上县", "裕安区", "叶集区", "固始县"],
    "舒城县": ["肥西县", "庐江县", "岳西县", "桐城市", "潜山市", "金安区", "霍山县"],
    "金寨县": ["裕安区", "叶集区", "霍山县", "商城县", "固始县", "罗田县", "英山县", "麻城市"],
    "霍山县": ["岳西县", "金安区", "裕安区", "舒城县", "金寨县", "英山县"],

    // 亳州市
    "谯城区": ["太和县", "涡阳县", "睢阳区", "虞城县", "夏邑县", "永城市", "郸城县", "鹿邑县"],
    "涡阳县": ["濉溪县", "太和县", "谯城区", "蒙城县", "利辛县", "永城市"],
    "蒙城县": ["怀远县", "潘集区", "凤台县", "濉溪县", "涡阳县", "利辛县"],
    "利辛县": ["凤台县", "颍东区", "颍泉区", "太和县", "颍上县", "涡阳县", "蒙城县"],

    // 池州市
    "贵池区": ["义安区", "郊区（铜陵市）", "枞阳县", "迎江区", "东至县", "石台县", "青阳县"],
    "东至县": ["迎江区", "大观区", "望江县", "祁门县", "贵池区", "石台县", "浮梁县", "彭泽县", "鄱阳县"],
    "石台县": ["黄山区", "黟县", "祁门县", "贵池区", "东至县", "青阳县"],
    "青阳县": ["南陵县", "义安区", "黄山区", "贵池区", "石台县", "泾县"],

    // 宣城市
    "宣州区": ["高淳区", "湾沚区", "南陵县", "当涂县", "郎溪县", "泾县", "宁国市", "广德市"],
    "郎溪县": ["高淳区", "溧阳市", "宣州区", "广德市"],
    "泾县": ["南陵县", "黄山区", "青阳县", "宣州区", "旌德县", "宁国市"],
    "绩溪县": ["临安区", "黄山区", "歙县", "旌德县", "宁国市"],
    "旌德县": ["黄山区", "泾县", "绩溪县", "宁国市"],
    "宁国市": ["临安区", "安吉县", "宣州区", "泾县", "绩溪县", "旌德县", "广德市"],
    "广德市": ["宜兴市", "溧阳市", "长兴县", "安吉县", "宣州区", "郎溪县", "宁国市"],


    // ==================== 福建省 ====================
    // 福州市
    "鼓楼区（福州市）": ["台江区", "仓山区", "晋安区", "闽侯县"],
    "台江区": ["鼓楼区（福州市）", "仓山区", "晋安区"],
    "仓山区": ["鼓楼区（福州市）", "台江区", "马尾区", "晋安区", "长乐区", "闽侯县"],
    "马尾区": ["仓山区", "晋安区", "长乐区", "连江县"],
    "晋安区": ["鼓楼区（福州市）", "台江区", "仓山区", "马尾区", "闽侯县", "连江县", "罗源县"],
    "长乐区": ["仓山区", "马尾区", "闽侯县", "福清市"],
    "闽侯县": ["鼓楼区（福州市）", "仓山区", "晋安区", "长乐区", "罗源县", "闽清县", "永泰县", "福清市", "古田县"],
    "连江县": ["马尾区", "晋安区", "罗源县"],
    "罗源县": ["晋安区", "闽侯县", "连江县", "蕉城区", "古田县"],
    "闽清县": ["闽侯县", "永泰县", "尤溪县", "延平区", "古田县"],
    "永泰县": ["闽侯县", "闽清县", "福清市", "涵江区", "仙游县", "尤溪县", "德化县"],
    "平潭县": ["福清市"],
    "福清市": ["长乐区", "闽侯县", "永泰县", "平潭县", "涵江区"],

    // 厦门市
    "思明区": ["湖里区"],
    "海沧区": ["集美区", "龙海区", "长泰区"],
    "湖里区": ["思明区"],
    "集美区": ["海沧区", "同安区", "长泰区"],
    "同安区": ["集美区", "翔安区", "安溪县", "南安市", "长泰区"],
    "翔安区": ["同安区", "南安市"],

    // 莆田市
    "城厢区": ["涵江区", "荔城区", "秀屿区", "仙游县"],
    "涵江区": ["永泰县", "福清市", "城厢区", "荔城区", "仙游县"],
    "荔城区": ["城厢区", "涵江区", "秀屿区"],
    "秀屿区": ["城厢区", "荔城区"],
    "仙游县": ["永泰县", "城厢区", "涵江区", "洛江区", "泉港区", "永春县", "德化县", "南安市"],

    // 三明市
    "三元区": ["沙县区", "明溪县", "大田县", "永安市"],
    "沙县区": ["三元区", "明溪县", "大田县", "尤溪县", "将乐县", "延平区", "顺昌县"],
    "明溪县": ["三元区", "沙县区", "清流县", "宁化县", "将乐县", "泰宁县", "建宁县", "永安市"],
    "清流县": ["明溪县", "宁化县", "永安市", "长汀县", "连城县"],
    "宁化县": ["明溪县", "清流县", "建宁县", "长汀县", "石城县", "广昌县"],
    "大田县": ["三元区", "沙县区", "尤溪县", "永安市", "永春县", "德化县", "漳平市"],
    "尤溪县": ["闽清县", "永泰县", "沙县区", "大田县", "德化县", "延平区"],
    "将乐县": ["沙县区", "明溪县", "泰宁县", "顺昌县", "邵武市"],
    "泰宁县": ["明溪县", "将乐县", "建宁县", "邵武市", "黎川县"],
    "建宁县": ["明溪县", "宁化县", "泰宁县", "黎川县", "南丰县", "广昌县"],
    "永安市": ["三元区", "明溪县", "清流县", "大田县", "新罗区", "连城县", "漳平市"],

    // 泉州市
    "鲤城区": ["丰泽区", "晋江市", "南安市"],
    "丰泽区": ["鲤城区", "洛江区", "惠安县", "晋江市", "南安市"],
    "洛江区": ["仙游县", "丰泽区", "泉港区", "惠安县", "南安市"],
    "泉港区": ["仙游县", "洛江区", "惠安县"],
    "惠安县": ["丰泽区", "洛江区", "泉港区"],
    "安溪县": ["同安区", "永春县", "南安市", "长泰区", "华安县", "漳平市"],
    "永春县": ["仙游县", "大田县", "安溪县", "德化县", "南安市", "漳平市"],
    "德化县": ["永泰县", "仙游县", "大田县", "尤溪县", "永春县"],
    "金门县": [],
    "石狮市": ["晋江市"],
    "晋江市": ["鲤城区", "丰泽区", "石狮市", "南安市"],
    "南安市": ["同安区", "翔安区", "仙游县", "鲤城区", "丰泽区", "洛江区", "安溪县", "永春县", "晋江市"],

    // 漳州市
    "芗城区": ["龙文区", "龙海区", "长泰区", "南靖县", "华安县"],
    "龙文区": ["芗城区", "龙海区", "长泰区"],
    "龙海区": ["海沧区", "芗城区", "龙文区", "长泰区", "漳浦县", "南靖县", "平和县"],
    "长泰区": ["海沧区", "集美区", "同安区", "安溪县", "芗城区", "龙文区", "龙海区", "华安县"],
    "云霄县": ["漳浦县", "诏安县", "东山县", "平和县"],
    "漳浦县": ["龙海区", "云霄县", "东山县", "平和县"],
    "诏安县": ["云霄县", "东山县", "平和县", "饶平县"],
    "东山县": ["云霄县", "漳浦县", "诏安县"],
    "南靖县": ["芗城区", "龙海区", "平和县", "华安县", "新罗区", "永定区（龙岩市）", "漳平市"],
    "平和县": ["龙海区", "云霄县", "漳浦县", "诏安县", "南靖县", "永定区（龙岩市）", "大埔县", "饶平县"],
    "华安县": ["安溪县", "芗城区", "长泰区", "南靖县", "漳平市"],

    // 南平市
    "延平区": ["闽清县", "沙县区", "尤溪县", "顺昌县", "建瓯市", "古田县"],
    "建阳区": ["顺昌县", "浦城县", "光泽县", "松溪县", "政和县", "邵武市", "武夷山市", "建瓯市"],
    "顺昌县": ["沙县区", "将乐县", "延平区", "建阳区", "邵武市", "建瓯市"],
    "浦城县": ["江山市", "遂昌县", "龙泉市", "建阳区", "松溪县", "武夷山市", "广丰区"],
    "光泽县": ["建阳区", "邵武市", "武夷山市", "贵溪市", "黎川县", "资溪县", "铅山县"],
    "松溪县": ["庆元县", "龙泉市", "建阳区", "浦城县", "政和县"],
    "政和县": ["庆元县", "建阳区", "松溪县", "建瓯市", "屏南县", "寿宁县", "周宁县"],
    "邵武市": ["将乐县", "泰宁县", "建阳区", "顺昌县", "光泽县", "黎川县"],
    "武夷山市": ["建阳区", "浦城县", "光泽县", "广丰区", "广信区", "铅山县"],
    "建瓯市": ["延平区", "建阳区", "顺昌县", "政和县", "古田县", "屏南县"],

    // 龙岩市
    "新罗区": ["永安市", "南靖县", "永定区（龙岩市）", "上杭县", "连城县", "漳平市"],
    "永定区（龙岩市）": ["南靖县", "平和县", "新罗区", "上杭县", "梅县区", "大埔县"],
    "长汀县": ["清流县", "宁化县", "上杭县", "武平县", "连城县", "会昌县", "石城县", "瑞金市"],
    "上杭县": ["新罗区", "永定区（龙岩市）", "长汀县", "武平县", "连城县", "梅县区", "蕉岭县"],
    "武平县": ["长汀县", "上杭县", "会昌县", "寻乌县", "平远县", "蕉岭县"],
    "连城县": ["清流县", "永安市", "新罗区", "长汀县", "上杭县"],
    "漳平市": ["大田县", "永安市", "安溪县", "永春县", "南靖县", "华安县", "新罗区"],

    // 宁德市
    "蕉城区": ["罗源县", "古田县", "屏南县", "周宁县", "福安市"],
    "霞浦县": ["柘荣县", "福安市", "福鼎市"],
    "古田县": ["闽侯县", "罗源县", "闽清县", "延平区", "建瓯市", "蕉城区", "屏南县"],
    "屏南县": ["政和县", "建瓯市", "蕉城区", "古田县", "周宁县"],
    "寿宁县": ["泰顺县", "庆元县", "景宁畲族自治县", "政和县", "周宁县", "福安市"],
    "周宁县": ["政和县", "蕉城区", "屏南县", "寿宁县", "福安市"],
    "柘荣县": ["泰顺县", "霞浦县", "福安市", "福鼎市"],
    "福安市": ["泰顺县", "蕉城区", "霞浦县", "寿宁县", "周宁县", "柘荣县"],
    "福鼎市": ["苍南县", "泰顺县", "霞浦县", "柘荣县"],


    // ==================== 江西省 ====================
    // 南昌市
    "东湖区": ["西湖区（南昌市）", "青山湖区", "新建区", "红谷滩区", "南昌县"],
    "西湖区（南昌市）": ["东湖区", "青云谱区", "青山湖区", "红谷滩区", "南昌县"],
    "青云谱区": ["西湖区（南昌市）", "青山湖区", "南昌县"],
    "青山湖区": ["东湖区", "西湖区（南昌市）", "青云谱区", "南昌县"],
    "新建区": ["东湖区", "红谷滩区", "南昌县", "安义县", "永修县", "都昌县", "丰城市", "高安市", "余干县"],
    "红谷滩区": ["东湖区", "西湖区（南昌市）", "新建区", "南昌县", "丰城市"],
    "南昌县": ["东湖区", "西湖区（南昌市）", "青云谱区", "青山湖区", "新建区", "红谷滩区", "进贤县", "丰城市", "余干县"],
    "安义县": ["新建区", "永修县", "奉新县", "靖安县", "高安市"],
    "进贤县": ["南昌县", "丰城市", "临川区", "东乡区", "余干县"],

    // 景德镇市
    "昌江区": ["珠山区", "浮梁县", "乐平市", "鄱阳县"],
    "珠山区": ["昌江区", "浮梁县"],
    "浮梁县": ["休宁县", "祁门县", "东至县", "昌江区", "珠山区", "乐平市", "鄱阳县", "婺源县"],
    "乐平市": ["昌江区", "浮梁县", "弋阳县", "鄱阳县", "万年县", "婺源县", "德兴市"],

    // 萍乡市
    "安源区": ["湘东区", "上栗县", "芦溪县"],
    "湘东区": ["安源区", "莲花县", "上栗县", "芦溪县", "攸县", "醴陵市"],
    "莲花县": ["湘东区", "芦溪县", "安福县", "永新县", "攸县", "茶陵县"],
    "上栗县": ["安源区", "湘东区", "芦溪县", "袁州区", "浏阳市", "醴陵市"],
    "芦溪县": ["安源区", "湘东区", "莲花县", "上栗县", "安福县", "袁州区"],

    // 九江市
    "濂溪区": ["浔阳区", "柴桑区", "湖口县", "庐山市", "黄梅县"],
    "浔阳区": ["濂溪区", "柴桑区", "黄梅县"],
    "柴桑区": ["宿松县", "濂溪区", "浔阳区", "德安县", "湖口县", "瑞昌市", "共青城市", "庐山市", "黄梅县", "武穴市"],
    "武宁县": ["修水县", "永修县", "德安县", "瑞昌市", "靖安县", "阳新县", "通山县"],
    "修水县": ["武宁县", "奉新县", "宜丰县", "靖安县", "铜鼓县", "通城县", "崇阳县", "通山县", "平江县"],
    "永修县": ["新建区", "安义县", "武宁县", "德安县", "都昌县", "共青城市", "庐山市", "靖安县"],
    "德安县": ["柴桑区", "武宁县", "永修县", "瑞昌市", "共青城市"],
    "都昌县": ["新建区", "永修县", "湖口县", "彭泽县", "庐山市", "鄱阳县"],
    "湖口县": ["宿松县", "濂溪区", "柴桑区", "都昌县", "彭泽县", "庐山市"],
    "彭泽县": ["宿松县", "望江县", "东至县", "都昌县", "湖口县", "鄱阳县"],
    "瑞昌市": ["柴桑区", "武宁县", "德安县", "阳新县", "武穴市"],
    "共青城市": ["柴桑区", "永修县", "德安县", "庐山市"],
    "庐山市": ["濂溪区", "柴桑区", "永修县", "都昌县", "湖口县", "共青城市"],

    // 新余市
    "渝水区": ["分宜县", "吉安县", "峡江县", "新干县", "上高县", "樟树市", "高安市"],
    "分宜县": ["渝水区", "吉安县", "安福县", "袁州区", "上高县"],

    // 鹰潭市
    "月湖区": ["余江区", "贵溪市"],
    "余江区": ["月湖区", "贵溪市", "东乡区", "金溪县", "余干县", "万年县"],
    "贵溪市": ["光泽县", "月湖区", "余江区", "金溪县", "资溪县", "铅山县", "弋阳县", "万年县"],

    // 赣州市
    "章贡区": ["南康区", "赣县区"],
    "南康区": ["章贡区", "赣县区", "信丰县", "大余县", "上犹县", "崇义县", "遂川县", "万安县"],
    "赣县区": ["章贡区", "南康区", "信丰县", "安远县", "于都县", "兴国县", "万安县"],
    "信丰县": ["南康区", "赣县区", "大余县", "安远县", "定南县", "全南县", "龙南市", "南雄市"],
    "大余县": ["南康区", "信丰县", "崇义县", "仁化县", "南雄市"],
    "上犹县": ["南康区", "崇义县", "遂川县", "桂东县"],
    "崇义县": ["南康区", "大余县", "上犹县", "汝城县", "桂东县", "仁化县"],
    "安远县": ["赣县区", "信丰县", "定南县", "于都县", "会昌县", "寻乌县"],
    "定南县": ["信丰县", "安远县", "寻乌县", "龙南市", "龙川县", "和平县"],
    "全南县": ["信丰县", "龙南市", "始兴县", "翁源县", "南雄市", "连平县"],
    "宁都县": ["于都县", "兴国县", "石城县", "瑞金市", "永丰县", "南丰县", "乐安县", "宜黄县", "广昌县"],
    "于都县": ["赣县区", "安远县", "宁都县", "兴国县", "会昌县", "瑞金市"],
    "兴国县": ["赣县区", "宁都县", "于都县", "青原区", "永丰县", "泰和县", "万安县"],
    "会昌县": ["长汀县", "武平县", "安远县", "于都县", "寻乌县", "瑞金市"],
    "寻乌县": ["武平县", "安远县", "定南县", "会昌县", "平远县", "兴宁市", "龙川县"],
    "石城县": ["宁化县", "长汀县", "宁都县", "瑞金市", "广昌县"],
    "瑞金市": ["长汀县", "宁都县", "于都县", "会昌县", "石城县"],
    "龙南市": ["信丰县", "定南县", "全南县", "连平县", "和平县"],

    // 吉安市
    "吉州区": ["青原区", "吉安县", "吉水县"],
    "青原区": ["兴国县", "吉州区", "吉安县", "吉水县", "永丰县", "泰和县"],
    "吉安县": ["渝水区", "分宜县", "吉州区", "青原区", "吉水县", "峡江县", "泰和县", "安福县", "永新县"],
    "吉水县": ["吉州区", "青原区", "吉安县", "峡江县", "永丰县"],
    "峡江县": ["渝水区", "吉安县", "吉水县", "新干县", "永丰县"],
    "新干县": ["渝水区", "峡江县", "永丰县", "丰城市", "樟树市", "乐安县"],
    "永丰县": ["宁都县", "兴国县", "青原区", "吉水县", "峡江县", "新干县", "乐安县"],
    "泰和县": ["兴国县", "青原区", "吉安县", "遂川县", "万安县", "永新县", "井冈山市"],
    "遂川县": ["南康区", "上犹县", "泰和县", "万安县", "井冈山市", "炎陵县", "桂东县"],
    "万安县": ["南康区", "赣县区", "兴国县", "泰和县", "遂川县"],
    "安福县": ["莲花县", "芦溪县", "分宜县", "吉安县", "永新县", "袁州区"],
    "永新县": ["莲花县", "吉安县", "泰和县", "安福县", "井冈山市", "茶陵县"],
    "井冈山市": ["泰和县", "遂川县", "永新县", "茶陵县", "炎陵县"],

    // 宜春市
    "袁州区": ["上栗县", "芦溪县", "分宜县", "安福县", "万载县", "上高县", "浏阳市"],
    "奉新县": ["安义县", "修水县", "宜丰县", "靖安县", "高安市"],
    "万载县": ["袁州区", "上高县", "宜丰县", "铜鼓县", "浏阳市"],
    "上高县": ["渝水区", "分宜县", "袁州区", "万载县", "宜丰县", "高安市"],
    "宜丰县": ["修水县", "奉新县", "万载县", "上高县", "铜鼓县", "高安市"],
    "靖安县": ["安义县", "武宁县", "修水县", "永修县", "奉新县"],
    "铜鼓县": ["修水县", "万载县", "宜丰县", "浏阳市", "平江县"],
    "丰城市": ["新建区", "红谷滩区", "南昌县", "进贤县", "新干县", "樟树市", "高安市", "临川区", "崇仁县", "乐安县"],
    "樟树市": ["渝水区", "新干县", "丰城市", "高安市"],
    "高安市": ["新建区", "安义县", "渝水区", "奉新县", "上高县", "宜丰县", "丰城市", "樟树市"],

    // 抚州市
    "临川区": ["进贤县", "丰城市", "东乡区", "南城县", "崇仁县", "宜黄县", "金溪县"],
    "东乡区": ["进贤县", "余江区", "临川区", "金溪县", "余干县"],
    "南城县": ["临川区", "黎川县", "南丰县", "宜黄县", "金溪县", "资溪县"],
    "黎川县": ["泰宁县", "建宁县", "光泽县", "邵武市", "南城县", "南丰县", "资溪县"],
    "南丰县": ["建宁县", "宁都县", "南城县", "黎川县", "宜黄县", "广昌县"],
    "崇仁县": ["丰城市", "临川区", "乐安县", "宜黄县"],
    "乐安县": ["宁都县", "新干县", "永丰县", "丰城市", "崇仁县", "宜黄县"],
    "宜黄县": ["宁都县", "临川区", "南城县", "南丰县", "崇仁县", "乐安县"],
    "金溪县": ["余江区", "贵溪市", "临川区", "东乡区", "南城县", "资溪县"],
    "资溪县": ["光泽县", "贵溪市", "南城县", "黎川县", "金溪县"],
    "广昌县": ["宁化县", "建宁县", "宁都县", "石城县", "南丰县"],

    // 上饶市
    "信州区": ["广丰区", "广信区", "玉山县"],
    "广丰区": ["江山市", "浦城县", "武夷山市", "信州区", "广信区", "玉山县"],
    "广信区": ["武夷山市", "信州区", "广丰区", "玉山县", "铅山县", "横峰县", "德兴市"],
    "玉山县": ["常山县", "开化县", "江山市", "信州区", "广丰区", "广信区", "德兴市"],
    "铅山县": ["光泽县", "武夷山市", "贵溪市", "广信区", "横峰县", "弋阳县"],
    "横峰县": ["广信区", "铅山县", "弋阳县", "德兴市"],
    "弋阳县": ["乐平市", "贵溪市", "铅山县", "横峰县", "万年县", "德兴市"],
    "余干县": ["新建区", "南昌县", "进贤县", "余江区", "东乡区", "鄱阳县", "万年县"],
    "鄱阳县": ["东至县", "昌江区", "浮梁县", "乐平市", "都昌县", "彭泽县", "余干县", "万年县"],
    "万年县": ["乐平市", "余江区", "贵溪市", "弋阳县", "余干县", "鄱阳县"],
    "婺源县": ["开化县", "休宁县", "浮梁县", "乐平市", "德兴市"],
    "德兴市": ["开化县", "乐平市", "广信区", "玉山县", "横峰县", "弋阳县", "婺源县"],


    // ==================== 山东省 ====================
    // 济南市
    "历下区": ["市中区（济南市）", "天桥区", "历城区"],
    "市中区（济南市）": ["历下区", "槐荫区", "天桥区", "历城区", "长清区"],
    "槐荫区": ["市中区（济南市）", "天桥区", "长清区", "齐河县"],
    "天桥区": ["历下区", "市中区（济南市）", "槐荫区", "历城区", "济阳区", "齐河县"],
    "历城区": ["历下区", "市中区（济南市）", "天桥区", "长清区", "章丘区", "济阳区", "泰山区", "岱岳区"],
    "长清区": ["市中区（济南市）", "槐荫区", "历城区", "平阴县", "泰山区", "岱岳区", "肥城市", "齐河县", "东阿县"],
    "章丘区": ["历城区", "济阳区", "莱芜区", "淄川区", "博山区", "周村区", "岱岳区", "邹平市"],
    "济阳区": ["天桥区", "历城区", "章丘区", "商河县", "临邑县", "齐河县", "惠民县", "邹平市"],
    "莱芜区": ["章丘区", "钢城区", "博山区", "岱岳区", "新泰市"],
    "钢城区": ["莱芜区", "博山区", "沂源县", "新泰市"],
    "平阴县": ["长清区", "东平县", "肥城市", "东阿县"],
    "商河县": ["济阳区", "临邑县", "乐陵市", "惠民县", "阳信县"],

    // 青岛市
    "市南区": ["市北区", "崂山区"],
    "市北区": ["市南区", "崂山区", "李沧区"],
    "黄岛区": ["胶州市", "诸城市", "东港区", "五莲县"],
    "崂山区": ["市南区", "市北区", "李沧区", "城阳区", "即墨区"],
    "李沧区": ["市北区", "崂山区", "城阳区"],
    "城阳区": ["崂山区", "李沧区", "即墨区", "胶州市"],
    "即墨区": ["崂山区", "城阳区", "胶州市", "平度市", "莱西市", "莱阳市"],
    "胶州市": ["黄岛区", "城阳区", "即墨区", "平度市", "诸城市", "高密市"],
    "平度市": ["即墨区", "胶州市", "莱西市", "莱州市", "高密市", "昌邑市"],
    "莱西市": ["即墨区", "平度市", "莱阳市", "莱州市", "招远市"],

    // 淄博市
    "淄川区": ["章丘区", "张店区", "博山区", "临淄区", "周村区", "沂源县", "临朐县", "青州市"],
    "张店区": ["淄川区", "临淄区", "周村区", "桓台县"],
    "博山区": ["章丘区", "莱芜区", "钢城区", "淄川区", "沂源县"],
    "临淄区": ["淄川区", "张店区", "桓台县", "广饶县", "青州市", "博兴县"],
    "周村区": ["章丘区", "淄川区", "张店区", "桓台县", "邹平市"],
    "桓台县": ["张店区", "临淄区", "周村区", "高青县", "博兴县", "邹平市"],
    "高青县": ["桓台县", "滨城区", "惠民县", "博兴县", "邹平市"],
    "沂源县": ["钢城区", "淄川区", "博山区", "临朐县", "新泰市", "沂水县", "蒙阴县"],

    // 枣庄市
    "市中区（枣庄市）": ["薛城区", "峄城区", "山亭区", "兰陵县"],
    "薛城区": ["市中区（枣庄市）", "峄城区", "山亭区", "滕州市", "微山县"],
    "峄城区": ["邳州市", "市中区（枣庄市）", "薛城区", "台儿庄区", "微山县", "兰陵县"],
    "台儿庄区": ["贾汪区", "铜山区", "邳州市", "峄城区", "微山县"],
    "山亭区": ["市中区（枣庄市）", "薛城区", "滕州市", "邹城市", "兰陵县", "费县", "平邑县"],
    "滕州市": ["薛城区", "山亭区", "微山县", "邹城市"],

    // 东营市
    "东营区": ["垦利区", "利津县", "广饶县", "博兴县"],
    "河口区": ["垦利区", "利津县", "沾化区"],
    "垦利区": ["东营区", "河口区", "利津县"],
    "利津县": ["东营区", "河口区", "垦利区", "滨城区", "沾化区", "博兴县"],
    "广饶县": ["临淄区", "东营区", "青州市", "寿光市", "博兴县"],

    // 烟台市
    "芝罘区": ["福山区", "莱山区"],
    "福山区": ["芝罘区", "牟平区", "莱山区", "蓬莱区", "栖霞市"],
    "牟平区": ["福山区", "莱山区", "栖霞市", "海阳市", "环翠区", "文登区", "乳山市"],
    "莱山区": ["芝罘区", "福山区", "牟平区"],
    "蓬莱区": ["福山区", "龙口市", "栖霞市"],
    "龙口市": ["蓬莱区", "招远市", "栖霞市"],
    "莱阳市": ["即墨区", "莱西市", "招远市", "栖霞市", "海阳市"],
    "莱州市": ["平度市", "莱西市", "招远市", "昌邑市"],
    "招远市": ["莱西市", "龙口市", "莱阳市", "莱州市", "栖霞市"],
    "栖霞市": ["福山区", "牟平区", "蓬莱区", "龙口市", "莱阳市", "招远市", "海阳市"],
    "海阳市": ["牟平区", "莱阳市", "栖霞市", "乳山市"],

    // 潍坊市
    "潍城区": ["寒亭区", "坊子区", "奎文区", "昌乐县", "寿光市"],
    "寒亭区": ["潍城区", "坊子区", "奎文区", "寿光市", "昌邑市"],
    "坊子区": ["潍城区", "寒亭区", "奎文区", "昌乐县", "诸城市", "安丘市", "高密市", "昌邑市"],
    "奎文区": ["潍城区", "寒亭区", "坊子区"],
    "临朐县": ["淄川区", "沂源县", "昌乐县", "青州市", "安丘市", "沂水县"],
    "昌乐县": ["潍城区", "坊子区", "临朐县", "青州市", "寿光市", "安丘市"],
    "青州市": ["淄川区", "临淄区", "广饶县", "临朐县", "昌乐县", "寿光市"],
    "诸城市": ["黄岛区", "胶州市", "坊子区", "安丘市", "高密市", "五莲县", "莒县", "沂水县"],
    "寿光市": ["广饶县", "潍城区", "寒亭区", "昌乐县", "青州市"],
    "安丘市": ["坊子区", "临朐县", "昌乐县", "诸城市", "沂水县"],
    "高密市": ["胶州市", "平度市", "坊子区", "诸城市", "昌邑市"],
    "昌邑市": ["平度市", "莱州市", "寒亭区", "坊子区", "高密市"],

    // 济宁市
    "任城区": ["兖州区", "微山县", "鱼台县", "金乡县", "嘉祥县", "汶上县", "邹城市"],
    "兖州区": ["任城区", "汶上县", "曲阜市", "邹城市", "宁阳县"],
    "微山县": ["铜山区", "沛县", "薛城区", "峄城区", "台儿庄区", "滕州市", "任城区", "鱼台县", "邹城市"],
    "鱼台县": ["丰县", "沛县", "任城区", "微山县", "金乡县"],
    "金乡县": ["丰县", "任城区", "鱼台县", "嘉祥县", "单县", "成武县", "巨野县"],
    "嘉祥县": ["任城区", "金乡县", "汶上县", "梁山县", "巨野县", "郓城县"],
    "汶上县": ["任城区", "兖州区", "嘉祥县", "梁山县", "宁阳县", "东平县", "肥城市"],
    "泗水县": ["曲阜市", "邹城市", "宁阳县", "新泰市", "平邑县"],
    "梁山县": ["嘉祥县", "汶上县", "东平县", "郓城县", "台前县"],
    "曲阜市": ["兖州区", "泗水县", "邹城市", "宁阳县"],
    "邹城市": ["山亭区", "滕州市", "任城区", "兖州区", "微山县", "泗水县", "曲阜市", "平邑县"],

    // 泰安市
    "泰山区": ["历城区", "长清区", "岱岳区"],
    "岱岳区": ["历城区", "长清区", "章丘区", "莱芜区", "泰山区", "宁阳县", "新泰市", "肥城市"],
    "宁阳县": ["兖州区", "汶上县", "泗水县", "曲阜市", "岱岳区", "新泰市", "肥城市"],
    "东平县": ["平阴县", "汶上县", "梁山县", "肥城市", "阳谷县", "东阿县", "台前县"],
    "新泰市": ["莱芜区", "钢城区", "沂源县", "泗水县", "岱岳区", "宁阳县", "平邑县", "蒙阴县"],
    "肥城市": ["长清区", "平阴县", "汶上县", "岱岳区", "宁阳县", "东平县"],

    // 威海市
    "环翠区": ["牟平区", "文登区", "荣成市"],
    "文登区": ["牟平区", "环翠区", "荣成市", "乳山市"],
    "荣成市": ["环翠区", "文登区"],
    "乳山市": ["牟平区", "海阳市", "文登区"],

    // 日照市
    "东港区": ["黄岛区", "岚山区", "五莲县", "莒县"],
    "岚山区": ["赣榆区", "东港区", "莒县", "莒南县"],
    "五莲县": ["黄岛区", "诸城市", "东港区", "莒县"],
    "莒县": ["诸城市", "东港区", "岚山区", "五莲县", "沂南县", "沂水县", "莒南县"],

    // 临沂市
    "兰山区": ["罗庄区", "河东区（临沂市）", "沂南县", "兰陵县", "费县"],
    "罗庄区": ["兰山区", "河东区（临沂市）", "郯城县", "兰陵县"],
    "河东区（临沂市）": ["兰山区", "罗庄区", "沂南县", "郯城县", "莒南县", "临沭县"],
    "沂南县": ["莒县", "兰山区", "河东区（临沂市）", "沂水县", "费县", "莒南县", "蒙阴县"],
    "郯城县": ["新沂市", "邳州市", "东海县", "罗庄区", "河东区（临沂市）", "兰陵县", "临沭县"],
    "沂水县": ["沂源县", "临朐县", "诸城市", "安丘市", "莒县", "沂南县", "蒙阴县"],
    "兰陵县": ["邳州市", "市中区（枣庄市）", "峄城区", "山亭区", "兰山区", "罗庄区", "郯城县", "费县"],
    "费县": ["山亭区", "兰山区", "沂南县", "兰陵县", "平邑县", "蒙阴县"],
    "平邑县": ["山亭区", "泗水县", "邹城市", "新泰市", "费县", "蒙阴县"],
    "莒南县": ["赣榆区", "岚山区", "莒县", "河东区（临沂市）", "沂南县", "临沭县"],
    "蒙阴县": ["沂源县", "新泰市", "沂南县", "沂水县", "费县", "平邑县"],
    "临沭县": ["赣榆区", "东海县", "河东区（临沂市）", "郯城县", "莒南县"],

    // 德州市
    "德城区": ["吴桥县", "故城县", "景县", "陵城区", "宁津县", "平原县", "武城县"],
    "陵城区": ["德城区", "宁津县", "临邑县", "平原县", "乐陵市"],
    "宁津县": ["东光县", "南皮县", "吴桥县", "德城区", "陵城区", "乐陵市"],
    "庆云县": ["海兴县", "盐山县", "乐陵市", "阳信县", "无棣县"],
    "临邑县": ["济阳区", "商河县", "陵城区", "齐河县", "平原县", "乐陵市", "禹城市"],
    "齐河县": ["槐荫区", "天桥区", "长清区", "济阳区", "临邑县", "禹城市", "茌平区", "东阿县", "高唐县"],
    "平原县": ["德城区", "陵城区", "临邑县", "夏津县", "武城县", "禹城市", "高唐县"],
    "夏津县": ["清河县", "临西县", "故城县", "平原县", "武城县", "高唐县", "临清市"],
    "武城县": ["故城县", "德城区", "平原县", "夏津县"],
    "乐陵市": ["盐山县", "南皮县", "商河县", "陵城区", "宁津县", "庆云县", "临邑县", "阳信县"],
    "禹城市": ["临邑县", "齐河县", "平原县", "高唐县"],

    // 聊城市
    "东昌府区": ["茌平区", "阳谷县", "莘县", "东阿县", "冠县", "临清市"],
    "茌平区": ["齐河县", "东昌府区", "东阿县", "高唐县", "临清市"],
    "阳谷县": ["东平县", "东昌府区", "莘县", "东阿县", "台前县"],
    "莘县": ["大名县", "东昌府区", "阳谷县", "冠县", "清丰县", "南乐县", "范县", "濮阳县"],
    "东阿县": ["长清区", "平阴县", "东平县", "齐河县", "东昌府区", "茌平区", "阳谷县"],
    "冠县": ["大名县", "馆陶县", "东昌府区", "莘县", "临清市"],
    "高唐县": ["齐河县", "平原县", "夏津县", "禹城市", "茌平区", "临清市"],
    "临清市": ["馆陶县", "临西县", "夏津县", "东昌府区", "茌平区", "冠县", "高唐县"],

    // 滨州市
    "滨城区": ["高青县", "利津县", "沾化区", "惠民县", "阳信县", "博兴县"],
    "沾化区": ["河口区", "利津县", "滨城区", "阳信县", "无棣县"],
    "惠民县": ["济阳区", "商河县", "高青县", "滨城区", "阳信县", "邹平市"],
    "阳信县": ["商河县", "庆云县", "乐陵市", "滨城区", "沾化区", "惠民县", "无棣县"],
    "无棣县": ["海兴县", "黄骅市", "庆云县", "沾化区", "阳信县"],
    "博兴县": ["临淄区", "桓台县", "高青县", "东营区", "利津县", "广饶县", "滨城区"],
    "邹平市": ["章丘区", "济阳区", "周村区", "桓台县", "高青县", "惠民县"],

    // 菏泽市
    "牡丹区": ["定陶区", "曹县", "巨野县", "郓城县", "鄄城县", "东明县", "濮阳县"],
    "定陶区": ["牡丹区", "曹县", "成武县", "巨野县"],
    "曹县": ["牡丹区", "定陶区", "单县", "成武县", "东明县", "兰考县", "梁园区", "民权县"],
    "单县": ["丰县", "砀山县", "金乡县", "曹县", "成武县", "梁园区", "虞城县"],
    "成武县": ["金乡县", "定陶区", "曹县", "单县", "巨野县"],
    "巨野县": ["金乡县", "嘉祥县", "牡丹区", "定陶区", "成武县", "郓城县"],
    "郓城县": ["嘉祥县", "梁山县", "牡丹区", "巨野县", "鄄城县", "范县", "台前县"],
    "鄄城县": ["牡丹区", "郓城县", "范县", "濮阳县"],
    "东明县": ["牡丹区", "曹县", "兰考县", "长垣市", "濮阳县"],


    // ==================== 河南省 ====================
    // 郑州市
    "中原区": ["二七区", "金水区", "惠济区", "荥阳市"],
    "二七区": ["中原区", "管城回族区", "金水区", "荥阳市", "新密市", "新郑市"],
    "管城回族区": ["二七区", "金水区", "中牟县", "新郑市"],
    "金水区": ["中原区", "二七区", "管城回族区", "惠济区", "中牟县", "原阳县"],
    "上街区": ["巩义市", "荥阳市"],
    "惠济区": ["中原区", "金水区", "荥阳市", "原阳县", "武陟县"],
    "中牟县": ["管城回族区", "金水区", "新郑市", "龙亭区", "祥符区", "尉氏县", "原阳县"],
    "巩义市": ["上街区", "荥阳市", "新密市", "登封市", "偃师区", "孟津区", "温县", "孟州市"],
    "荥阳市": ["中原区", "二七区", "上街区", "惠济区", "巩义市", "新密市", "武陟县", "温县"],
    "新密市": ["二七区", "巩义市", "荥阳市", "新郑市", "登封市", "禹州市"],
    "新郑市": ["二七区", "管城回族区", "中牟县", "新密市", "尉氏县", "禹州市", "长葛市"],
    "登封市": ["巩义市", "新密市", "偃师区", "伊川县", "汝州市", "禹州市"],

    // 开封市
    "龙亭区": ["中牟县", "顺河回族区", "鼓楼区（开封市）", "祥符区", "原阳县", "封丘县"],
    "顺河回族区": ["龙亭区", "鼓楼区（开封市）", "禹王台区", "祥符区"],
    "鼓楼区（开封市）": ["龙亭区", "顺河回族区", "禹王台区", "祥符区"],
    "禹王台区": ["顺河回族区", "鼓楼区（开封市）", "祥符区"],
    "祥符区": ["中牟县", "龙亭区", "顺河回族区", "鼓楼区（开封市）", "禹王台区", "杞县", "通许县", "尉氏县", "兰考县", "封丘县"],
    "杞县": ["祥符区", "通许县", "兰考县", "民权县", "睢县", "太康县"],
    "通许县": ["祥符区", "杞县", "尉氏县", "扶沟县", "太康县"],
    "尉氏县": ["中牟县", "新郑市", "祥符区", "通许县", "鄢陵县", "长葛市", "扶沟县"],
    "兰考县": ["曹县", "东明县", "祥符区", "杞县", "封丘县", "长垣市", "民权县"],

    // 洛阳市
    "老城区": ["西工区", "瀍河回族区", "孟津区", "洛龙区"],
    "西工区": ["老城区", "涧西区", "孟津区", "洛龙区", "新安县"],
    "瀍河回族区": ["老城区", "偃师区", "孟津区", "洛龙区"],
    "涧西区": ["西工区", "洛龙区", "新安县", "宜阳县"],
    "偃师区": ["巩义市", "登封市", "瀍河回族区", "孟津区", "洛龙区", "伊川县"],
    "孟津区": ["巩义市", "老城区", "西工区", "瀍河回族区", "偃师区", "新安县", "孟州市", "济源市"],
    "洛龙区": ["老城区", "西工区", "瀍河回族区", "涧西区", "偃师区", "宜阳县", "伊川县"],
    "新安县": ["垣曲县", "西工区", "涧西区", "孟津区", "宜阳县", "渑池县", "义马市", "济源市"],
    "栾川县": ["嵩县", "洛宁县", "卢氏县", "西峡县"],
    "嵩县": ["栾川县", "汝阳县", "宜阳县", "洛宁县", "伊川县", "鲁山县", "南召县", "西峡县", "内乡县"],
    "汝阳县": ["嵩县", "伊川县", "鲁山县", "汝州市"],
    "宜阳县": ["涧西区", "洛龙区", "新安县", "嵩县", "洛宁县", "伊川县", "渑池县", "义马市"],
    "洛宁县": ["栾川县", "嵩县", "宜阳县", "陕州区", "渑池县", "卢氏县", "灵宝市"],
    "伊川县": ["登封市", "偃师区", "洛龙区", "嵩县", "汝阳县", "宜阳县", "汝州市"],

    // 平顶山市
    "新华区（平顶山市）": ["卫东区", "湛河区", "宝丰县", "鲁山县"],
    "卫东区": ["新华区（平顶山市）", "湛河区", "宝丰县", "叶县", "郏县", "襄城县"],
    "石龙区": ["宝丰县", "鲁山县"],
    "湛河区": ["新华区（平顶山市）", "卫东区", "叶县", "鲁山县"],
    "宝丰县": ["新华区（平顶山市）", "卫东区", "石龙区", "鲁山县", "郏县", "汝州市"],
    "叶县": ["卫东区", "湛河区", "鲁山县", "舞钢市", "襄城县", "舞阳县", "方城县"],
    "鲁山县": ["嵩县", "汝阳县", "新华区（平顶山市）", "石龙区", "湛河区", "宝丰县", "叶县", "汝州市", "南召县", "方城县"],
    "郏县": ["卫东区", "宝丰县", "汝州市", "襄城县", "禹州市"],
    "舞钢市": ["叶县", "舞阳县", "方城县", "驿城区", "西平县", "泌阳县", "遂平县"],
    "汝州市": ["登封市", "汝阳县", "伊川县", "宝丰县", "鲁山县", "郏县", "禹州市"],

    // 安阳市
    "文峰区": ["北关区", "殷都区", "龙安区", "安阳县", "汤阴县"],
    "北关区": ["临漳县", "文峰区", "殷都区", "安阳县"],
    "殷都区": ["文峰区", "北关区", "龙安区", "安阳县"],
    "龙安区": ["文峰区", "殷都区", "安阳县", "汤阴县", "林州市", "鹤山区", "山城区"],
    "安阳县": ["临漳县", "涉县", "磁县", "魏县", "文峰区", "北关区", "殷都区", "龙安区", "汤阴县", "内黄县", "林州市"],
    "汤阴县": ["文峰区", "龙安区", "安阳县", "内黄县", "山城区", "淇滨区", "浚县"],
    "滑县": ["内黄县", "浚县", "延津县", "封丘县", "长垣市", "濮阳县"],
    "内黄县": ["魏县", "安阳县", "汤阴县", "滑县", "浚县", "华龙区", "清丰县", "濮阳县"],
    "林州市": ["涉县", "平顺县", "壶关县", "龙安区", "安阳县", "鹤山区", "淇滨区", "淇县", "卫辉市", "辉县市"],

    // 鹤壁市
    "鹤山区": ["龙安区", "林州市", "山城区", "淇滨区"],
    "山城区": ["龙安区", "汤阴县", "鹤山区", "淇滨区"],
    "淇滨区": ["汤阴县", "林州市", "鹤山区", "山城区", "浚县", "淇县"],
    "浚县": ["汤阴县", "滑县", "内黄县", "淇滨区", "淇县", "延津县", "卫辉市"],
    "淇县": ["林州市", "淇滨区", "浚县", "卫辉市"],

    // 新乡市
    "红旗区": ["卫滨区", "牧野区", "新乡县", "延津县", "卫辉市"],
    "卫滨区": ["红旗区", "牧野区", "新乡县"],
    "凤泉区": ["牧野区", "新乡县", "卫辉市", "辉县市"],
    "牧野区": ["红旗区", "卫滨区", "凤泉区", "新乡县", "卫辉市"],
    "新乡县": ["红旗区", "卫滨区", "凤泉区", "牧野区", "获嘉县", "原阳县", "延津县", "辉县市"],
    "获嘉县": ["新乡县", "原阳县", "辉县市", "修武县", "武陟县"],
    "原阳县": ["金水区", "惠济区", "中牟县", "龙亭区", "新乡县", "获嘉县", "延津县", "封丘县", "武陟县"],
    "延津县": ["滑县", "浚县", "红旗区", "新乡县", "原阳县", "封丘县", "卫辉市"],
    "封丘县": ["龙亭区", "祥符区", "兰考县", "滑县", "原阳县", "延津县", "长垣市"],
    "卫辉市": ["林州市", "浚县", "淇县", "红旗区", "凤泉区", "牧野区", "延津县", "辉县市"],
    "辉县市": ["壶关县", "陵川县", "林州市", "凤泉区", "新乡县", "获嘉县", "卫辉市", "修武县"],
    "长垣市": ["东明县", "兰考县", "滑县", "封丘县", "濮阳县"],

    // 焦作市
    "解放区": ["中站区", "山阳区", "修武县"],
    "中站区": ["泽州县", "解放区", "山阳区", "修武县", "博爱县", "沁阳市"],
    "马村区": ["山阳区", "修武县"],
    "山阳区": ["解放区", "中站区", "马村区", "修武县", "博爱县", "武陟县"],
    "修武县": ["陵川县", "泽州县", "获嘉县", "辉县市", "解放区", "中站区", "马村区", "山阳区", "武陟县"],
    "博爱县": ["泽州县", "中站区", "山阳区", "武陟县", "温县", "沁阳市"],
    "武陟县": ["惠济区", "荥阳市", "获嘉县", "原阳县", "山阳区", "修武县", "博爱县", "温县"],
    "温县": ["巩义市", "荥阳市", "博爱县", "武陟县", "沁阳市", "孟州市"],
    "沁阳市": ["泽州县", "中站区", "博爱县", "温县", "孟州市", "济源市"],
    "孟州市": ["巩义市", "孟津区", "温县", "沁阳市", "济源市"],

    // 濮阳市
    "华龙区": ["内黄县", "清丰县", "濮阳县"],
    "清丰县": ["魏县", "莘县", "内黄县", "华龙区", "南乐县", "濮阳县"],
    "南乐县": ["大名县", "魏县", "莘县", "清丰县"],
    "范县": ["莘县", "郓城县", "鄄城县", "台前县", "濮阳县"],
    "台前县": ["梁山县", "东平县", "阳谷县", "郓城县", "范县"],
    "濮阳县": ["莘县", "牡丹区", "鄄城县", "东明县", "滑县", "内黄县", "长垣市", "华龙区", "清丰县", "范县"],

    // 许昌市
    "魏都区": ["建安区"],
    "建安区": ["魏都区", "鄢陵县", "襄城县", "禹州市", "长葛市", "临颍县"],
    "鄢陵县": ["尉氏县", "建安区", "长葛市", "临颍县", "扶沟县", "西华县"],
    "襄城县": ["卫东区", "叶县", "郏县", "建安区", "禹州市", "郾城区", "舞阳县", "临颍县"],
    "禹州市": ["新密市", "新郑市", "登封市", "郏县", "汝州市", "建安区", "襄城县", "长葛市"],
    "长葛市": ["新郑市", "尉氏县", "建安区", "鄢陵县", "禹州市"],

    // 漯河市
    "源汇区": ["郾城区", "召陵区", "舞阳县", "西平县"],
    "郾城区": ["襄城县", "源汇区", "召陵区", "舞阳县", "临颍县", "西华县"],
    "召陵区": ["源汇区", "郾城区", "西华县", "商水县", "西平县", "上蔡县"],
    "舞阳县": ["叶县", "舞钢市", "襄城县", "源汇区", "郾城区", "西平县"],
    "临颍县": ["建安区", "鄢陵县", "襄城县", "郾城区", "西华县"],
    
    // 三门峡市
    "湖滨区": ["平陆县", "陕州区"],
    "陕州区": ["平陆县", "洛宁县", "湖滨区", "渑池县", "灵宝市"],
    "渑池县": ["垣曲县", "夏县", "平陆县", "新安县", "宜阳县", "洛宁县", "陕州区", "义马市"],
    "卢氏县": ["栾川县", "洛宁县", "灵宝市", "西峡县", "洛南县", "丹凤县", "商南县"],
    "义马市": ["新安县", "宜阳县", "渑池县"],
    "灵宝市": ["平陆县", "芮城县", "洛宁县", "陕州区", "卢氏县", "潼关县", "洛南县"],

    // 南阳市
    "宛城区": ["卧龙区", "方城县", "社旗县", "唐河县", "新野县"],
    "卧龙区": ["宛城区", "南召县", "方城县", "镇平县", "新野县", "邓州市"],
    "南召县": ["嵩县", "鲁山县", "卧龙区", "方城县", "镇平县", "内乡县"],
    "方城县": ["叶县", "鲁山县", "舞钢市", "宛城区", "卧龙区", "南召县", "社旗县", "泌阳县"],
    "西峡县": ["栾川县", "嵩县", "卢氏县", "内乡县", "淅川县", "商南县"],
    "镇平县": ["卧龙区", "南召县", "内乡县", "邓州市"],
    "内乡县": ["嵩县", "南召县", "西峡县", "镇平县", "淅川县", "邓州市"],
    "淅川县": ["西峡县", "内乡县", "邓州市", "郧阳区", "丹江口市", "老河口市", "商南县"],
    "社旗县": ["宛城区", "方城县", "唐河县", "泌阳县"],
    "唐河县": ["宛城区", "社旗县", "新野县", "桐柏县", "泌阳县", "襄州区", "枣阳市"],
    "新野县": ["宛城区", "卧龙区", "唐河县", "邓州市", "襄州区"],
    "桐柏县": ["唐河县", "平桥区", "确山县", "泌阳县", "枣阳市", "随县"],
    "邓州市": ["卧龙区", "镇平县", "内乡县", "淅川县", "新野县", "襄州区", "老河口市"],

    // 商丘市
    "梁园区": ["曹县", "单县", "睢阳区", "民权县", "宁陵县", "虞城县"],
    "睢阳区": ["谯城区", "梁园区", "宁陵县", "柘城县", "虞城县", "鹿邑县"],
    "民权县": ["曹县", "杞县", "兰考县", "梁园区", "睢县", "宁陵县"],
    "睢县": ["杞县", "民权县", "宁陵县", "柘城县", "太康县"],
    "宁陵县": ["梁园区", "睢阳区", "民权县", "睢县", "柘城县"],
    "柘城县": ["睢阳区", "睢县", "宁陵县", "太康县", "鹿邑县"],
    "虞城县": ["砀山县", "谯城区", "单县", "梁园区", "睢阳区", "夏邑县"],
    "夏邑县": ["砀山县", "谯城区", "虞城县", "永城市"],
    "永城市": ["相山区", "濉溪县", "砀山县", "萧县", "谯城区", "涡阳县", "夏邑县"],

    // 信阳市
    "浉河区": ["平桥区", "罗山县", "大悟县", "随县", "广水市"],
    "平桥区": ["桐柏县", "浉河区", "罗山县", "正阳县", "确山县", "随县"],
    "罗山县": ["浉河区", "平桥区", "光山县", "新县", "息县", "正阳县", "大悟县"],
    "光山县": ["罗山县", "新县", "商城县", "潢川县", "息县"],
    "新县": ["罗山县", "光山县", "商城县", "大悟县", "红安县", "麻城市"],
    "商城县": ["金寨县", "光山县", "新县", "固始县", "潢川县", "麻城市"],
    "固始县": ["阜南县", "叶集区", "霍邱县", "金寨县", "商城县", "潢川县", "淮滨县"],
    "潢川县": ["光山县", "商城县", "固始县", "淮滨县", "息县"],
    "淮滨县": ["临泉县", "阜南县", "固始县", "潢川县", "息县", "新蔡县"],
    "息县": ["罗山县", "光山县", "潢川县", "淮滨县", "正阳县", "新蔡县"],

    // 周口市
    "川汇区": ["淮阳区", "西华县", "商水县"],
    "淮阳区": ["川汇区", "西华县", "商水县", "沈丘县", "郸城县", "太康县", "鹿邑县", "项城市"],
    "扶沟县": ["通许县", "尉氏县", "鄢陵县", "西华县", "太康县"],
    "西华县": ["鄢陵县", "郾城区", "召陵区", "临颍县", "川汇区", "淮阳区", "扶沟县", "商水县", "太康县"],
    "商水县": ["召陵区", "川汇区", "淮阳区", "西华县", "项城市", "上蔡县"],
    "沈丘县": ["临泉县", "界首市", "淮阳区", "郸城县", "项城市"],
    "郸城县": ["太和县", "界首市", "谯城区", "淮阳区", "沈丘县", "鹿邑县"],
    "太康县": ["杞县", "通许县", "睢县", "柘城县", "淮阳区", "扶沟县", "西华县", "鹿邑县"],
    "鹿邑县": ["谯城区", "睢阳区", "柘城县", "淮阳区", "郸城县", "太康县"],
    "项城市": ["临泉县", "淮阳区", "商水县", "沈丘县", "上蔡县", "平舆县"],

    // 驻马店市
    "驿城区": ["舞钢市", "确山县", "泌阳县", "汝南县", "遂平县"],
    "西平县": ["舞钢市", "源汇区", "召陵区", "舞阳县", "上蔡县", "遂平县"],
    "上蔡县": ["召陵区", "商水县", "项城市", "西平县", "平舆县", "汝南县", "遂平县"],
    "平舆县": ["临泉县", "项城市", "上蔡县", "正阳县", "汝南县", "新蔡县"],
    "正阳县": ["平桥区", "罗山县", "息县", "平舆县", "确山县", "汝南县", "新蔡县"],
    "确山县": ["桐柏县", "平桥区", "驿城区", "正阳县", "泌阳县", "汝南县"],
    "泌阳县": ["舞钢市", "方城县", "社旗县", "唐河县", "桐柏县", "驿城区", "确山县"],
    "汝南县": ["驿城区", "上蔡县", "平舆县", "正阳县", "确山县", "遂平县"],
    "遂平县": ["舞钢市", "驿城区", "西平县", "上蔡县", "汝南县"],
    "新蔡县": ["临泉县", "淮滨县", "息县", "平舆县", "正阳县"],

    // 省直辖县级行政区划
    "济源市": ["阳城县", "泽州县", "垣曲县", "孟津区", "新安县", "沁阳市", "孟州市"],


    // ==================== 湖北省 ====================
    // 武汉市
    "江岸区": ["江汉区", "武昌区", "青山区（武汉市）", "洪山区", "东西湖区", "黄陂区"],
    "江汉区": ["江岸区", "硚口区", "汉阳区", "武昌区", "东西湖区"],
    "硚口区": ["江汉区", "汉阳区", "东西湖区"],
    "汉阳区": ["江汉区", "硚口区", "武昌区", "洪山区", "东西湖区", "蔡甸区"],
    "武昌区": ["江岸区", "江汉区", "汉阳区", "青山区（武汉市）", "洪山区", "江夏区"],
    "青山区（武汉市）": ["江岸区", "武昌区", "洪山区"],
    "洪山区": ["江岸区", "汉阳区", "武昌区", "青山区（武汉市）", "蔡甸区", "江夏区", "黄陂区", "新洲区", "华容区"],
    "东西湖区": ["江岸区", "江汉区", "硚口区", "汉阳区", "蔡甸区", "黄陂区", "孝南区", "汉川市"],
    "汉南区": ["蔡甸区", "江夏区", "洪湖市", "嘉鱼县", "仙桃市"],
    "蔡甸区": ["汉阳区", "洪山区", "东西湖区", "汉南区", "江夏区", "汉川市", "仙桃市"],
    "江夏区": ["武昌区", "洪山区", "汉南区", "蔡甸区", "大冶市", "梁子湖区", "华容区", "咸安区", "嘉鱼县"],
    "黄陂区": ["江岸区", "洪山区", "东西湖区", "新洲区", "孝南区", "孝昌县", "大悟县", "红安县"],
    "新洲区": ["洪山区", "黄陂区", "华容区", "团风县", "红安县", "麻城市"],

    // 黄石市
    "黄石港区": ["西塞山区", "下陆区", "鄂城区", "浠水县"],
    "西塞山区": ["黄石港区", "下陆区", "阳新县", "大冶市", "浠水县", "蕲春县"],
    "下陆区": ["黄石港区", "西塞山区", "铁山区", "大冶市", "鄂城区"],
    "铁山区": ["下陆区", "大冶市", "鄂城区"],
    "阳新县": ["武宁县", "瑞昌市", "西塞山区", "大冶市", "蕲春县", "武穴市", "咸安区", "通山县"],
    "大冶市": ["江夏区", "西塞山区", "下陆区", "铁山区", "阳新县", "梁子湖区", "鄂城区", "咸安区"],

    // 十堰市
    "茅箭区": ["张湾区", "郧阳区", "房县", "丹江口市"],
    "张湾区": ["茅箭区", "郧阳区", "房县"],
    "郧阳区": ["淅川县", "茅箭区", "张湾区", "郧西县", "竹山县", "房县", "丹江口市", "白河县", "商南县"],
    "郧西县": ["郧阳区", "白河县", "旬阳市", "商南县", "山阳县", "镇安县"],
    "竹山县": ["郧阳区", "竹溪县", "房县", "神农架林区", "巫溪县", "白河县", "旬阳市"],
    "竹溪县": ["竹山县", "巫溪县", "平利县", "镇坪县", "旬阳市"],
    "房县": ["茅箭区", "张湾区", "郧阳区", "竹山县", "丹江口市", "谷城县", "保康县", "神农架林区"],
    "丹江口市": ["淅川县", "茅箭区", "郧阳区", "房县", "谷城县", "老河口市"],

    // 宜昌市
    "西陵区": ["伍家岗区", "点军区", "夷陵区"],
    "伍家岗区": ["西陵区", "点军区", "猇亭区", "夷陵区"],
    "点军区": ["西陵区", "伍家岗区", "猇亭区", "夷陵区", "长阳土家族自治县", "宜都市"],
    "猇亭区": ["伍家岗区", "点军区", "夷陵区", "宜都市", "枝江市"],
    "夷陵区": ["西陵区", "伍家岗区", "点军区", "猇亭区", "远安县", "兴山县", "秭归县", "长阳土家族自治县", "当阳市", "枝江市", "保康县"],
    "远安县": ["夷陵区", "当阳市", "南漳县", "保康县", "东宝区"],
    "兴山县": ["夷陵区", "秭归县", "保康县", "巴东县", "神农架林区"],
    "秭归县": ["夷陵区", "兴山县", "长阳土家族自治县", "巴东县"],
    "长阳土家族自治县": ["点军区", "夷陵区", "秭归县", "五峰土家族自治县", "宜都市", "巴东县"],
    "五峰土家族自治县": ["长阳土家族自治县", "宜都市", "松滋市", "巴东县", "鹤峰县", "石门县"],
    "宜都市": ["点军区", "猇亭区", "长阳土家族自治县", "五峰土家族自治县", "枝江市", "松滋市"],
    "当阳市": ["夷陵区", "远安县", "枝江市", "东宝区", "掇刀区", "沙洋县", "荆州区"],
    "枝江市": ["猇亭区", "夷陵区", "宜都市", "当阳市", "荆州区", "松滋市"],

    // 襄阳市
    "襄城区": ["樊城区", "襄州区", "南漳县", "谷城县", "宜城市"],
    "樊城区": ["襄城区", "襄州区", "谷城县", "老河口市"],
    "襄州区": ["唐河县", "新野县", "邓州市", "襄城区", "樊城区", "老河口市", "枣阳市", "宜城市"],
    "南漳县": ["远安县", "襄城区", "谷城县", "保康县", "宜城市", "东宝区"],
    "谷城县": ["房县", "丹江口市", "襄城区", "樊城区", "南漳县", "保康县", "老河口市"],
    "保康县": ["房县", "夷陵区", "远安县", "兴山县", "南漳县", "谷城县", "神农架林区"],
    "老河口市": ["淅川县", "邓州市", "丹江口市", "樊城区", "襄州区", "谷城县"],
    "枣阳市": ["唐河县", "桐柏县", "襄州区", "宜城市", "随县"],
    "宜城市": ["襄城区", "襄州区", "南漳县", "枣阳市", "东宝区", "钟祥市", "随县"],

    // 鄂州市
    "梁子湖区": ["江夏区", "大冶市", "华容区", "鄂城区"],
    "华容区": ["洪山区", "江夏区", "新洲区", "梁子湖区", "鄂城区", "黄州区", "团风县"],
    "鄂城区": ["黄石港区", "下陆区", "铁山区", "大冶市", "梁子湖区", "华容区", "黄州区", "浠水县"],

    // 荆门市
    "东宝区": ["远安县", "当阳市", "南漳县", "宜城市", "掇刀区", "钟祥市"],
    "掇刀区": ["当阳市", "东宝区", "沙洋县", "钟祥市"],
    "沙洋县": ["当阳市", "掇刀区", "钟祥市", "沙市区", "荆州区", "潜江市", "天门市"],
    "钟祥市": ["宜城市", "东宝区", "掇刀区", "沙洋县", "京山市", "随县", "天门市"],
    "京山市": ["钟祥市", "应城市", "安陆市", "曾都区", "随县", "天门市"],

    // 孝感市
    "孝南区": ["东西湖区", "黄陂区", "孝昌县", "云梦县", "汉川市"],
    "孝昌县": ["黄陂区", "孝南区", "大悟县", "云梦县", "安陆市", "广水市"],
    "大悟县": ["浉河区", "罗山县", "新县", "黄陂区", "孝昌县", "红安县", "广水市"],
    "云梦县": ["孝南区", "孝昌县", "应城市", "安陆市", "汉川市"],
    "应城市": ["京山市", "云梦县", "安陆市", "汉川市", "天门市"],
    "安陆市": ["京山市", "孝昌县", "云梦县", "应城市", "曾都区", "广水市"],
    "汉川市": ["东西湖区", "蔡甸区", "孝南区", "云梦县", "应城市", "仙桃市", "天门市"],

    // 荆州市
    "沙市区": ["沙洋县", "荆州区", "公安县", "江陵县", "潜江市"],
    "荆州区": ["当阳市", "枝江市", "沙洋县", "沙市区", "公安县", "松滋市"],
    "公安县": ["沙市区", "荆州区", "江陵县", "石首市", "松滋市", "安乡县", "澧县"],
    "江陵县": ["沙市区", "公安县", "石首市", "监利市", "潜江市"],
    "石首市": ["公安县", "江陵县", "监利市", "华容县", "安乡县", "南县"],
    "洪湖市": ["汉南区", "监利市", "嘉鱼县", "赤壁市", "仙桃市", "临湘市"],
    "松滋市": ["五峰土家族自治县", "宜都市", "枝江市", "荆州区", "公安县", "澧县", "石门县"],
    "监利市": ["江陵县", "石首市", "洪湖市", "仙桃市", "潜江市", "岳阳楼区", "云溪区", "君山区", "岳阳县", "华容县", "临湘市"],

    // 黄冈市
    "黄州区": ["华容区", "鄂城区", "团风县", "浠水县"],
    "团风县": ["新洲区", "华容区", "黄州区", "罗田县", "浠水县", "麻城市"],
    "红安县": ["新县", "黄陂区", "新洲区", "大悟县", "麻城市"],
    "罗田县": ["金寨县", "团风县", "英山县", "浠水县", "麻城市"],
    "英山县": ["太湖县", "岳西县", "金寨县", "霍山县", "罗田县", "浠水县", "蕲春县"],
    "浠水县": ["黄石港区", "西塞山区", "鄂城区", "黄州区", "团风县", "罗田县", "英山县", "蕲春县"],
    "蕲春县": ["太湖县", "宿松县", "西塞山区", "阳新县", "英山县", "浠水县", "黄梅县", "武穴市"],
    "黄梅县": ["宿松县", "濂溪区", "浔阳区", "柴桑区", "蕲春县", "武穴市"],
    "麻城市": ["金寨县", "新县", "商城县", "新洲区", "团风县", "红安县", "罗田县"],
    "武穴市": ["柴桑区", "瑞昌市", "阳新县", "蕲春县", "黄梅县"],

    // 咸宁市
    "咸安区": ["江夏区", "阳新县", "大冶市", "嘉鱼县", "崇阳县", "通山县", "赤壁市"],
    "嘉鱼县": ["汉南区", "江夏区", "洪湖市", "咸安区", "赤壁市"],
    "通城县": ["修水县", "崇阳县", "岳阳县", "平江县", "临湘市"],
    "崇阳县": ["修水县", "咸安区", "通城县", "通山县", "赤壁市", "临湘市"],
    "通山县": ["武宁县", "修水县", "阳新县", "咸安区", "崇阳县"],
    "赤壁市": ["洪湖市", "咸安区", "嘉鱼县", "崇阳县", "临湘市"],
    
    // 随州市
    "曾都区": ["京山市", "安陆市", "随县", "广水市"],
    "随县": ["桐柏县", "浉河区", "平桥区", "枣阳市", "宜城市", "钟祥市", "京山市", "曾都区", "广水市"],
    "广水市": ["浉河区", "孝昌县", "大悟县", "安陆市", "曾都区", "随县"],

    // 恩施土家族苗族自治州
    "恩施市": ["利川市", "建始县", "宣恩县", "咸丰县", "鹤峰县", "奉节县"],
    "利川市": ["恩施市", "咸丰县", "万州区", "黔江区", "云阳县", "奉节县", "石柱土家族自治县", "彭水苗族土家族自治县"],
    "建始县": ["恩施市", "巴东县", "鹤峰县", "奉节县", "巫山县"],
    "巴东县": ["兴山县", "秭归县", "长阳土家族自治县", "五峰土家族自治县", "建始县", "鹤峰县", "神农架林区", "巫山县"],
    "宣恩县": ["恩施市", "咸丰县", "来凤县", "鹤峰县", "桑植县", "龙山县"],
    "咸丰县": ["恩施市", "利川市", "宣恩县", "来凤县", "黔江区", "酉阳土家族苗族自治县"],
    "来凤县": ["宣恩县", "咸丰县", "龙山县", "酉阳土家族苗族自治县"],
    "鹤峰县": ["五峰土家族自治县", "恩施市", "建始县", "巴东县", "宣恩县", "石门县", "桑植县"],

    // 省直辖县级行政区划
    "仙桃市": ["汉南区", "蔡甸区", "汉川市", "洪湖市", "监利市", "潜江市", "天门市"],
    "潜江市": ["沙洋县", "沙市区", "江陵县", "监利市", "仙桃市", "天门市"],
    "天门市": ["沙洋县", "钟祥市", "京山市", "应城市", "汉川市", "仙桃市", "潜江市"],
    "神农架林区": ["竹山县", "房县", "兴山县", "保康县", "巴东县", "巫山县", "巫溪县"],


    // ==================== 湖南省 ====================
    // 长沙市
    "芙蓉区": ["天心区", "开福区", "雨花区", "长沙县"],
    "天心区": ["芙蓉区", "岳麓区", "开福区", "雨花区", "雨湖区", "岳塘区"],
    "岳麓区": ["天心区", "开福区", "望城区", "宁乡市", "雨湖区"],
    "开福区": ["芙蓉区", "天心区", "岳麓区", "望城区", "长沙县"],
    "雨花区": ["芙蓉区", "天心区", "长沙县", "浏阳市", "石峰区", "岳塘区"],
    "望城区": ["岳麓区", "开福区", "长沙县", "宁乡市", "湘阴县", "汨罗市", "赫山区"],
    "长沙县": ["芙蓉区", "开福区", "雨花区", "望城区", "浏阳市", "平江县", "汨罗市"],
    "浏阳市": ["上栗县", "袁州区", "万载县", "铜鼓县", "雨花区", "长沙县", "荷塘区", "芦淞区", "石峰区", "醴陵市", "平江县"],
    "宁乡市": ["岳麓区", "望城区", "雨湖区", "湘潭县", "湘乡市", "韶山市", "赫山区", "桃江县", "安化县", "娄星区", "涟源市"],

    // 株洲市
    "荷塘区": ["浏阳市", "芦淞区", "石峰区"],
    "芦淞区": ["浏阳市", "荷塘区", "石峰区", "天元区", "渌口区", "醴陵市"],
    "石峰区": ["雨花区", "浏阳市", "荷塘区", "芦淞区", "天元区", "岳塘区"],
    "天元区": ["芦淞区", "石峰区", "渌口区", "岳塘区", "湘潭县"],
    "渌口区": ["芦淞区", "天元区", "攸县", "醴陵市", "湘潭县", "衡东县"],
    "攸县": ["湘东区", "莲花县", "渌口区", "茶陵县", "醴陵市", "衡东县", "安仁县"],
    "茶陵县": ["莲花县", "永新县", "井冈山市", "攸县", "炎陵县", "安仁县"],
    "炎陵县": ["遂川县", "井冈山市", "茶陵县", "桂东县", "安仁县", "资兴市"],
    "醴陵市": ["湘东区", "上栗县", "浏阳市", "芦淞区", "渌口区", "攸县"],

    // 湘潭市
    "雨湖区": ["天心区", "岳麓区", "宁乡市", "岳塘区", "湘潭县"],
    "岳塘区": ["天心区", "雨花区", "石峰区", "天元区", "雨湖区", "湘潭县"],
    "湘潭县": ["宁乡市", "天元区", "渌口区", "雨湖区", "岳塘区", "湘乡市", "韶山市", "衡山县", "衡东县", "双峰县"],
    "湘乡市": ["宁乡市", "湘潭县", "韶山市", "娄星区", "双峰县"],
    "韶山市": ["宁乡市", "湘潭县", "湘乡市"],

    // 衡阳市
    "珠晖区": ["雁峰区", "石鼓区", "衡阳县", "衡南县"],
    "雁峰区": ["珠晖区", "石鼓区", "蒸湘区", "衡南县"],
    "石鼓区": ["珠晖区", "雁峰区", "蒸湘区", "衡阳县"],
    "蒸湘区": ["雁峰区", "石鼓区", "衡阳县", "衡南县"],
    "南岳区": ["衡阳县", "衡山县"],
    "衡阳县": ["珠晖区", "石鼓区", "蒸湘区", "南岳区", "衡南县", "衡山县", "祁东县", "邵东市", "双峰县"],
    "衡南县": ["珠晖区", "雁峰区", "蒸湘区", "衡阳县", "衡山县", "衡东县", "祁东县", "耒阳市", "常宁市", "安仁县"],
    "衡山县": ["湘潭县", "南岳区", "衡阳县", "衡南县", "衡东县", "双峰县"],
    "衡东县": ["渌口区", "攸县", "湘潭县", "衡南县", "衡山县", "安仁县"],
    "祁东县": ["衡阳县", "衡南县", "常宁市", "邵阳县", "邵东市", "冷水滩区", "东安县", "祁阳市"],
    "耒阳市": ["衡南县", "常宁市", "桂阳县", "永兴县", "安仁县"],
    "常宁市": ["衡南县", "祁东县", "耒阳市", "桂阳县", "祁阳市"],

    // 邵阳市
    "双清区": ["大祥区", "北塔区", "新邵县", "邵东市"],
    "大祥区": ["双清区", "北塔区", "邵阳县", "邵东市"],
    "北塔区": ["双清区", "大祥区", "新邵县", "邵阳县"],
    "新邵县": ["双清区", "北塔区", "邵阳县", "隆回县", "邵东市", "新化县", "冷水江市", "涟源市"],
    "邵阳县": ["祁东县", "大祥区", "北塔区", "新邵县", "隆回县", "新宁县", "武冈市", "邵东市", "东安县"],
    "隆回县": ["新邵县", "邵阳县", "洞口县", "武冈市", "溆浦县", "新化县"],
    "洞口县": ["隆回县", "绥宁县", "武冈市", "溆浦县", "洪江市"],
    "绥宁县": ["洞口县", "城步苗族自治县", "武冈市", "会同县", "靖州苗族侗族自治县", "通道侗族自治县"],
    "新宁县": ["邵阳县", "城步苗族自治县", "武冈市", "东安县", "全州县", "资源县"],
    "城步苗族自治县": ["绥宁县", "新宁县", "武冈市", "通道侗族自治县", "龙胜各族自治县", "资源县"],
    "武冈市": ["邵阳县", "隆回县", "洞口县", "绥宁县", "新宁县", "城步苗族自治县"],
    "邵东市": ["衡阳县", "祁东县", "双清区", "大祥区", "新邵县", "邵阳县", "双峰县", "涟源市"],

    // 岳阳市
    "岳阳楼区": ["监利市", "云溪区", "岳阳县", "临湘市"],
    "云溪区": ["监利市", "岳阳楼区", "临湘市"],
    "君山区": ["监利市", "岳阳县", "华容县"],
    "岳阳县": ["监利市", "通城县", "岳阳楼区", "君山区", "华容县", "平江县", "汨罗市", "临湘市", "南县", "沅江市"],
    "华容县": ["石首市", "监利市", "君山区", "岳阳县", "南县"],
    "湘阴县": ["望城区", "汨罗市", "资阳区", "赫山区", "沅江市"],
    "平江县": ["修水县", "铜鼓县", "通城县", "长沙县", "浏阳市", "岳阳县", "汨罗市"],
    "汨罗市": ["望城区", "长沙县", "岳阳县", "湘阴县", "平江县", "沅江市"],
    "临湘市": ["洪湖市", "监利市", "通城县", "崇阳县", "赤壁市", "岳阳楼区", "云溪区", "岳阳县"],

    // 常德市
    "武陵区": ["鼎城区", "汉寿县", "桃源县"],
    "鼎城区": ["武陵区", "安乡县", "汉寿县", "临澧县", "桃源县", "津市市", "桃江县", "安化县"],
    "安乡县": ["公安县", "石首市", "鼎城区", "汉寿县", "澧县", "津市市", "南县"],
    "汉寿县": ["武陵区", "鼎城区", "安乡县", "资阳区", "南县", "桃江县", "沅江市"],
    "澧县": ["公安县", "松滋市", "安乡县", "临澧县", "石门县", "津市市"],
    "临澧县": ["鼎城区", "澧县", "桃源县", "石门县", "津市市"],
    "桃源县": ["武陵区", "鼎城区", "临澧县", "石门县", "永定区（张家界市）", "慈利县", "安化县", "沅陵县"],
    "石门县": ["五峰土家族自治县", "松滋市", "鹤峰县", "澧县", "临澧县", "桃源县", "慈利县", "桑植县"],
    "津市市": ["鼎城区", "安乡县", "澧县", "临澧县"],

    // 张家界市
    "永定区（张家界市）": ["桃源县", "武陵源区", "慈利县", "桑植县", "沅陵县", "永顺县"],
    "武陵源区": ["永定区（张家界市）", "慈利县", "桑植县"],
    "慈利县": ["桃源县", "石门县", "永定区（张家界市）", "武陵源区", "桑植县"],
    "桑植县": ["宣恩县", "鹤峰县", "石门县", "永定区（张家界市）", "武陵源区", "慈利县", "永顺县", "龙山县"],

    // 益阳市
    "资阳区": ["湘阴县", "汉寿县", "赫山区", "桃江县", "沅江市"],
    "赫山区": ["望城区", "宁乡市", "湘阴县", "资阳区", "桃江县"],
    "南县": ["石首市", "岳阳县", "华容县", "安乡县", "汉寿县", "沅江市"],
    "桃江县": ["宁乡市", "鼎城区", "汉寿县", "资阳区", "赫山区", "安化县"],
    "安化县": ["宁乡市", "鼎城区", "桃源县", "桃江县", "沅陵县", "溆浦县", "新化县", "涟源市"],
    "沅江市": ["岳阳县", "湘阴县", "汨罗市", "汉寿县", "资阳区", "南县"],

    // 郴州市
    "北湖区": ["苏仙区", "桂阳县", "宜章县", "临武县"],
    "苏仙区": ["北湖区", "桂阳县", "宜章县", "永兴县", "资兴市"],
    "桂阳县": ["耒阳市", "常宁市", "北湖区", "苏仙区", "永兴县", "嘉禾县", "临武县", "新田县", "祁阳市"],
    "宜章县": ["北湖区", "苏仙区", "临武县", "汝城县", "资兴市", "乳源瑶族自治县", "乐昌市", "阳山县", "连州市"],
    "永兴县": ["耒阳市", "苏仙区", "桂阳县", "安仁县", "资兴市"],
    "嘉禾县": ["桂阳县", "临武县", "宁远县", "蓝山县", "新田县"],
    "临武县": ["北湖区", "桂阳县", "宜章县", "嘉禾县", "蓝山县", "连州市"],
    "汝城县": ["崇义县", "宜章县", "桂东县", "资兴市", "仁化县", "乐昌市"],
    "桂东县": ["上犹县", "崇义县", "遂川县", "炎陵县", "汝城县", "资兴市"],
    "安仁县": ["攸县", "茶陵县", "炎陵县", "衡南县", "衡东县", "耒阳市", "永兴县", "资兴市"],
    "资兴市": ["炎陵县", "苏仙区", "宜章县", "永兴县", "汝城县", "桂东县", "安仁县"],

    // 永州市
    "零陵区": ["冷水滩区", "东安县", "双牌县", "祁阳市", "全州县"],
    "冷水滩区": ["祁东县", "零陵区", "东安县", "祁阳市"],
    "东安县": ["祁东县", "邵阳县", "新宁县", "零陵区", "冷水滩区", "全州县"],
    "双牌县": ["零陵区", "道县", "宁远县", "祁阳市", "全州县"],
    "道县": ["双牌县", "江永县", "宁远县", "江华瑶族自治县", "全州县", "灌阳县"],
    "江永县": ["道县", "江华瑶族自治县", "灌阳县", "恭城瑶族自治县", "富川瑶族自治县"],
    "宁远县": ["嘉禾县", "双牌县", "道县", "蓝山县", "新田县", "江华瑶族自治县", "祁阳市"],
    "蓝山县": ["嘉禾县", "临武县", "宁远县", "江华瑶族自治县", "连州市"],
    "新田县": ["桂阳县", "嘉禾县", "宁远县", "祁阳市"],
    "江华瑶族自治县": ["道县", "江永县", "宁远县", "蓝山县", "连山壮族瑶族自治县", "连南瑶族自治县", "连州市", "八步区", "平桂区", "富川瑶族自治县"],
    "祁阳市": ["祁东县", "常宁市", "桂阳县", "零陵区", "冷水滩区", "双牌县", "宁远县", "新田县"],

    // 怀化市
    "鹤城区": ["中方县", "辰溪县", "麻阳苗族自治县", "芷江侗族自治县"],
    "中方县": ["鹤城区", "辰溪县", "溆浦县", "芷江侗族自治县", "洪江市"],
    "沅陵县": ["桃源县", "永定区（张家界市）", "安化县", "辰溪县", "溆浦县", "泸溪县", "古丈县", "永顺县"],
    "辰溪县": ["鹤城区", "中方县", "沅陵县", "溆浦县", "麻阳苗族自治县", "泸溪县"],
    "溆浦县": ["隆回县", "洞口县", "安化县", "中方县", "沅陵县", "辰溪县", "洪江市", "新化县"],
    "会同县": ["绥宁县", "芷江侗族自治县", "靖州苗族侗族自治县", "洪江市", "天柱县"],
    "麻阳苗族自治县": ["鹤城区", "辰溪县", "芷江侗族自治县", "泸溪县", "凤凰县", "碧江区"],
    "新晃侗族自治县": ["芷江侗族自治县", "万山区", "玉屏侗族自治县", "三穗县", "镇远县", "天柱县"],
    "芷江侗族自治县": ["鹤城区", "中方县", "会同县", "麻阳苗族自治县", "新晃侗族自治县", "洪江市", "碧江区", "万山区", "天柱县"],
    "靖州苗族侗族自治县": ["绥宁县", "会同县", "通道侗族自治县", "天柱县", "锦屏县", "黎平县"],
    "通道侗族自治县": ["绥宁县", "城步苗族自治县", "靖州苗族侗族自治县", "三江侗族自治县", "龙胜各族自治县", "黎平县"],
    "洪江市": ["洞口县", "中方县", "溆浦县", "会同县", "芷江侗族自治县"],

    // 娄底市
    "娄星区": ["宁乡市", "湘乡市", "双峰县", "涟源市"],
    "双峰县": ["湘潭县", "湘乡市", "衡阳县", "衡山县", "邵东市", "娄星区", "涟源市"],
    "新化县": ["新邵县", "隆回县", "安化县", "溆浦县", "冷水江市", "涟源市"],
    "冷水江市": ["新邵县", "新化县", "涟源市"],
    "涟源市": ["宁乡市", "新邵县", "邵东市", "安化县", "娄星区", "双峰县", "新化县", "冷水江市"],

    // 湘西土家族苗族自治州
    "吉首市": ["泸溪县", "凤凰县", "花垣县", "保靖县", "古丈县"],
    "泸溪县": ["沅陵县", "辰溪县", "麻阳苗族自治县", "吉首市", "凤凰县", "古丈县"],
    "凤凰县": ["麻阳苗族自治县", "吉首市", "泸溪县", "花垣县", "碧江区", "松桃苗族自治县"],
    "花垣县": ["吉首市", "凤凰县", "保靖县", "秀山土家族苗族自治县", "松桃苗族自治县"],
    "保靖县": ["吉首市", "花垣县", "古丈县", "永顺县", "龙山县", "秀山土家族苗族自治县"],
    "古丈县": ["沅陵县", "吉首市", "泸溪县", "保靖县", "永顺县"],
    "永顺县": ["永定区（张家界市）", "桑植县", "沅陵县", "保靖县", "古丈县", "龙山县"],
    "龙山县": ["宣恩县", "来凤县", "桑植县", "保靖县", "永顺县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县"],


    // ==================== 广东省 ====================
    // 广州市
    "荔湾区": ["越秀区", "海珠区", "白云区（广州市）", "番禺区", "南海区"],
    "越秀区": ["荔湾区", "海珠区", "天河区", "白云区（广州市）"],
    "海珠区": ["荔湾区", "越秀区", "天河区", "黄埔区", "番禺区"],
    "天河区": ["越秀区", "海珠区", "白云区（广州市）", "黄埔区"],
    "白云区（广州市）": ["荔湾区", "越秀区", "天河区", "黄埔区", "花都区", "从化区", "南海区"],
    "黄埔区": ["海珠区", "天河区", "白云区（广州市）", "番禺区", "从化区", "增城区", "东莞市"],
    "番禺区": ["荔湾区", "海珠区", "黄埔区", "南沙区（广州市）", "南海区", "顺德区", "东莞市"],
    "花都区": ["白云区（广州市）", "从化区", "南海区", "三水区", "清城区"],
    "南沙区（广州市）": ["番禺区", "顺德区", "东莞市", "中山市"],
    "从化区": ["白云区（广州市）", "黄埔区", "花都区", "增城区", "新丰县", "龙门县", "清城区", "佛冈县"],
    "增城区": ["黄埔区", "从化区", "博罗县", "龙门县", "东莞市"],

    // 韶关市
    "武江区": ["浈江区", "曲江区", "乳源瑶族自治县"],
    "浈江区": ["武江区", "曲江区", "仁化县", "乳源瑶族自治县", "乐昌市"],
    "曲江区": ["武江区", "浈江区", "始兴县", "仁化县", "翁源县", "乳源瑶族自治县", "英德市"],
    "始兴县": ["全南县", "曲江区", "仁化县", "翁源县", "南雄市"],
    "仁化县": ["大余县", "崇义县", "汝城县", "浈江区", "曲江区", "始兴县", "乐昌市", "南雄市"],
    "翁源县": ["全南县", "曲江区", "始兴县", "新丰县", "连平县", "英德市"],
    "乳源瑶族自治县": ["宜章县", "武江区", "浈江区", "曲江区", "乐昌市", "阳山县", "英德市"],
    "新丰县": ["从化区", "翁源县", "龙门县", "连平县", "东源县", "佛冈县", "英德市"],
    "乐昌市": ["宜章县", "汝城县", "浈江区", "仁化县", "乳源瑶族自治县"],
    "南雄市": ["信丰县", "大余县", "全南县", "始兴县", "仁化县"],

    // 深圳市
    //"罗湖区": ["福田区", "龙岗区", "盐田区", "龙华区（深圳市）", "北区"],
    "罗湖区": ["福田区", "龙岗区", "盐田区", "龙华区（深圳市）", "香港特别行政区"],
    //"福田区": ["罗湖区", "南山区（深圳市）", "龙华区（深圳市）", "元朗区", "北区"],
    "福田区": ["罗湖区", "南山区（深圳市）", "龙华区（深圳市）", "香港特别行政区"],
    "南山区（深圳市）": ["福田区", "宝安区", "龙华区（深圳市）"],
    "宝安区": ["南山区（深圳市）", "龙华区（深圳市）", "光明区", "东莞市"],
    "龙岗区": ["罗湖区", "盐田区", "龙华区（深圳市）", "坪山区", "惠阳区", "东莞市"],
    //"盐田区": ["罗湖区", "龙岗区", "坪山区", "北区"],
    "盐田区": ["罗湖区", "龙岗区", "坪山区", "香港特别行政区"],
    "龙华区（深圳市）": ["罗湖区", "福田区", "南山区（深圳市）", "宝安区", "龙岗区", "光明区", "东莞市"],
    "坪山区": ["龙岗区", "盐田区", "惠阳区"],
    "光明区": ["宝安区", "龙华区（深圳市）", "东莞市"],

    // 珠海市
    //"香洲区": ["斗门区", "金湾区", "中山市", "花地玛堂区", "花王堂区", "大堂区", "风顺堂区", "嘉模堂区", "路氹填海区", "圣方济各堂区"],
    "香洲区": ["斗门区", "金湾区", "中山市", "澳门特别行政区"],
    "斗门区": ["香洲区", "金湾区", "新会区", "中山市"],
    "金湾区": ["香洲区", "斗门区"],

    // 汕头市
    "龙湖区": ["金平区", "濠江区", "澄海区", "潮安区"],
    "金平区": ["龙湖区", "濠江区", "潮阳区", "潮安区", "榕城区"],
    "濠江区": ["龙湖区", "金平区", "潮阳区"],
    "潮阳区": ["金平区", "濠江区", "潮南区", "榕城区", "普宁市"],
    "潮南区": ["潮阳区", "惠来县", "普宁市"],
    "澄海区": ["龙湖区", "湘桥区", "潮安区", "饶平县"],
    "南澳县": [],

    // 佛山市
    "禅城区": ["南海区", "顺德区"],
    "南海区": ["荔湾区", "白云区（广州市）", "番禺区", "花都区", "禅城区", "顺德区", "三水区", "高明区", "蓬江区", "鹤山市"],
    "顺德区": ["番禺区", "南沙区（广州市）", "禅城区", "南海区", "蓬江区", "中山市"],
    "三水区": ["花都区", "南海区", "高明区", "鼎湖区", "高要区", "四会市", "清城区", "清新区"],
    "高明区": ["南海区", "三水区", "鹤山市", "高要区", "新兴县"],

    // 江门市
    "蓬江区": ["南海区", "顺德区", "江海区", "新会区", "鹤山市", "中山市"],
    "江海区": ["蓬江区", "新会区", "中山市"],
    "新会区": ["斗门区", "蓬江区", "江海区", "台山市", "开平市", "鹤山市", "中山市"],
    "台山市": ["新会区", "开平市", "恩平市", "阳东区"],
    "开平市": ["新会区", "台山市", "鹤山市", "恩平市", "新兴县"],
    "鹤山市": ["南海区", "高明区", "蓬江区", "新会区", "开平市", "新兴县"],
    "恩平市": ["台山市", "开平市", "阳东区", "阳春市", "新兴县"],

    // 湛江市
    "赤坎区": ["霞山区", "坡头区", "麻章区", "遂溪县"],
    "霞山区": ["赤坎区", "坡头区", "麻章区"],
    "坡头区": ["赤坎区", "霞山区", "遂溪县", "廉江市", "吴川市"],
    "麻章区": ["赤坎区", "霞山区", "遂溪县", "雷州市"],
    "遂溪县": ["赤坎区", "坡头区", "麻章区", "廉江市", "雷州市"],
    "徐闻县": ["雷州市"],
    "廉江市": ["坡头区", "遂溪县", "吴川市", "化州市", "合浦县", "陆川县", "博白县"],
    "雷州市": ["麻章区", "遂溪县", "徐闻县"],
    "吴川市": ["坡头区", "廉江市", "茂南区", "电白区", "化州市"],

    // 茂名市
    "茂南区": ["吴川市", "电白区", "高州市", "化州市"],
    "电白区": ["吴川市", "茂南区", "高州市", "阳西县", "阳春市"],
    "高州市": ["茂南区", "电白区", "化州市", "信宜市", "阳春市", "北流市"],
    "化州市": ["廉江市", "吴川市", "茂南区", "高州市", "陆川县", "北流市"],
    "信宜市": ["高州市", "阳春市", "罗定市", "岑溪市", "容县", "北流市"],

    // 肇庆市
    "端州区": ["鼎湖区", "高要区"],
    "鼎湖区": ["三水区", "端州区", "高要区", "四会市"],
    "高要区": ["三水区", "高明区", "端州区", "鼎湖区", "广宁县", "德庆县", "四会市", "云城区", "云安区", "新兴县"],
    "广宁县": ["高要区", "怀集县", "德庆县", "四会市", "清新区", "阳山县"],
    "怀集县": ["广宁县", "封开县", "德庆县", "阳山县", "连山壮族瑶族自治县", "连南瑶族自治县", "八步区"],
    "封开县": ["怀集县", "德庆县", "郁南县", "万秀区", "龙圩区", "苍梧县", "八步区"],
    "德庆县": ["高要区", "广宁县", "怀集县", "封开县", "云安区", "郁南县"],
    "四会市": ["三水区", "鼎湖区", "高要区", "广宁县", "清新区"],

    // 惠州市
    "惠城区": ["惠阳区", "博罗县", "惠东县", "紫金县", "东莞市"],
    "惠阳区": ["龙岗区", "坪山区", "惠城区", "惠东县", "东莞市"],
    "博罗县": ["增城区", "惠城区", "龙门县", "源城区", "紫金县", "东源县", "东莞市"],
    "惠东县": ["惠城区", "惠阳区", "海丰县", "陆河县", "紫金县"],
    "龙门县": ["从化区", "增城区", "新丰县", "博罗县", "东源县"],

    // 梅州市
    "梅江区": ["梅县区", "大埔县", "丰顺县"],
    "梅县区": ["永定区（龙岩市）", "上杭县", "梅江区", "大埔县", "丰顺县", "平远县", "蕉岭县", "兴宁市"],
    "大埔县": ["平和县", "永定区（龙岩市）", "梅江区", "梅县区", "丰顺县", "潮安区", "饶平县"],
    "丰顺县": ["梅江区", "梅县区", "大埔县", "五华县", "兴宁市", "潮安区", "揭东区", "揭西县"],
    "五华县": ["丰顺县", "兴宁市", "陆河县", "紫金县", "龙川县", "东源县", "揭西县"],
    "平远县": ["武平县", "寻乌县", "梅县区", "蕉岭县", "兴宁市"],
    "蕉岭县": ["上杭县", "武平县", "梅县区", "平远县"],
    "兴宁市": ["寻乌县", "梅县区", "丰顺县", "五华县", "平远县", "龙川县"],

    // 汕尾市
    "城区（汕尾市）": ["海丰县"],
    "海丰县": ["惠东县", "城区（汕尾市）", "陆河县", "陆丰市"],
    "陆河县": ["惠东县", "五华县", "海丰县", "陆丰市", "紫金县", "揭西县", "普宁市"],
    "陆丰市": ["海丰县", "陆河县", "惠来县", "普宁市"],

    // 河源市
    "源城区": ["博罗县", "紫金县", "东源县"], 
    "紫金县": ["惠城区", "博罗县", "惠东县", "五华县", "陆河县", "源城区", "东源县"],
    "龙川县": ["定南县", "寻乌县", "五华县", "兴宁市", "和平县", "东源县"],
    "连平县": ["全南县", "龙南市", "翁源县", "新丰县", "和平县", "东源县"],
    "和平县": ["定南县", "龙南市", "龙川县", "连平县", "东源县"],
    "东源县": ["新丰县", "博罗县", "龙门县", "五华县", "源城区", "紫金县", "龙川县", "连平县", "和平县"],

    // 阳江市
    "江城区": ["阳东区", "阳西县", "阳春市"],
    "阳东区": ["台山市", "恩平市", "江城区", "阳春市"],
    "阳西县": ["电白区", "江城区", "阳春市"],
    "阳春市": ["恩平市", "电白区", "高州市", "信宜市", "江城区", "阳东区", "阳西县", "云安区", "新兴县", "罗定市"],

    // 清远市
    "清城区": ["花都区", "从化区", "三水区", "清新区", "佛冈县", "英德市"],
    "清新区": ["三水区", "广宁县", "四会市", "清城区", "阳山县", "英德市"],
    "佛冈县": ["从化区", "新丰县", "清城区", "英德市"],
    "阳山县": ["宜章县", "乳源瑶族自治县", "广宁县", "怀集县", "清新区", "连南瑶族自治县", "英德市", "连州市"],
    "连山壮族瑶族自治县": ["江华瑶族自治县", "怀集县", "连南瑶族自治县", "八步区"],
    "连南瑶族自治县": ["江华瑶族自治县", "怀集县", "阳山县", "连山壮族瑶族自治县", "连州市"],
    "英德市": ["曲江区", "翁源县", "乳源瑶族自治县", "新丰县", "清城区", "清新区", "佛冈县", "阳山县"],
    "连州市": ["宜章县", "临武县", "蓝山县", "江华瑶族自治县", "阳山县", "连南瑶族自治县"],

    // 东莞市
    "东莞市": ["黄埔区", "番禺区", "南沙区（广州市）", "增城区", "宝安区", "龙岗区", "龙华区（深圳市）", "光明区", "惠城区", "惠阳区", "博罗县"],

    // 中山市
    "中山市": ["南沙区（广州市）", "香洲区", "斗门区", "顺德区", "蓬江区", "江海区", "新会区"],

    // 潮州市
    "湘桥区": ["澄海区", "潮安区", "饶平县"],
    "潮安区": ["龙湖区", "金平区", "澄海区", "大埔县", "丰顺县", "湘桥区", "饶平县", "榕城区", "揭东区"],
    "饶平县": ["诏安县", "平和县", "澄海区", "大埔县", "湘桥区", "潮安区"],

    // 揭阳市
    "榕城区": ["金平区", "潮阳区", "潮安区", "揭东区", "普宁市"],
    "揭东区": ["丰顺县", "潮安区", "榕城区", "揭西县", "普宁市"],
    "揭西县": ["丰顺县", "五华县", "陆河县", "揭东区", "普宁市"],
    "惠来县": ["潮南区", "陆丰市", "普宁市"],
    "普宁市": ["潮阳区", "潮南区", "陆河县", "陆丰市", "榕城区", "揭东区", "揭西县", "惠来县"],

    // 云浮市
    "云城区": ["高要区", "云安区", "新兴县"],
    "云安区": ["高要区", "德庆县", "阳春市", "云城区", "新兴县", "郁南县", "罗定市"],
    "新兴县": ["高明区", "开平市", "鹤山市", "恩平市", "高要区", "阳春市", "云城区", "云安区"],
    "郁南县": ["封开县", "德庆县", "云安区", "罗定市", "龙圩区", "岑溪市"],
    "罗定市": ["信宜市", "阳春市", "云安区", "郁南县", "岑溪市"],


    // ==================== 广西壮族自治区 ====================
    // 南宁市
    "兴宁区": ["青秀区", "西乡塘区", "武鸣区", "宾阳县"],
    "青秀区": ["兴宁区", "江南区", "西乡塘区", "良庆区", "邕宁区", "宾阳县", "横州市"],
    "江南区": ["青秀区", "西乡塘区", "良庆区", "上思县", "扶绥县"],
    "西乡塘区": ["兴宁区", "青秀区", "江南区", "武鸣区", "隆安县", "扶绥县"],
    "良庆区": ["青秀区", "江南区", "邕宁区", "上思县", "钦北区"],
    "邕宁区": ["青秀区", "良庆区", "横州市", "钦北区", "灵山县"],
    "武鸣区": ["兴宁区", "西乡塘区", "隆安县", "马山县", "上林县", "宾阳县", "平果市"],
    "隆安县": ["西乡塘区", "武鸣区", "平果市", "江州区", "扶绥县", "大新县", "天等县"],
    "马山县": ["武鸣区", "上林县", "平果市", "都安瑶族自治县", "大化瑶族自治县", "忻城县"],
    "上林县": ["武鸣区", "马山县", "宾阳县", "兴宾区", "忻城县"],
    "宾阳县": ["兴宁区", "青秀区", "武鸣区", "上林县", "横州市", "覃塘区", "兴宾区"],
    "横州市": ["青秀区", "邕宁区", "宾阳县", "灵山县", "浦北县", "港南区", "覃塘区"],

    // 柳州市
    "城中区（柳州市）": ["鱼峰区", "柳南区", "柳北区"],
    "鱼峰区": ["城中区（柳州市）", "柳南区", "柳北区", "柳江区", "柳城县", "鹿寨县", "象州县"],
    "柳南区": ["城中区（柳州市）", "鱼峰区", "柳北区", "柳江区", "柳城县", "宜州区"],
    "柳北区": ["城中区（柳州市）", "鱼峰区", "柳南区", "柳城县"],
    "柳江区": ["鱼峰区", "柳南区", "宜州区", "兴宾区", "忻城县", "象州县"],
    "柳城县": ["鱼峰区", "柳南区", "柳北区", "鹿寨县", "融安县", "融水苗族自治县", "宜州区", "罗城仫佬族自治县"],
    "鹿寨县": ["鱼峰区", "柳城县", "融安县", "永福县", "荔浦市", "象州县", "金秀瑶族自治县"],
    "融安县": ["柳城县", "鹿寨县", "融水苗族自治县", "三江侗族自治县", "临桂区", "永福县", "龙胜各族自治县"],
    "融水苗族自治县": ["柳城县", "融安县", "三江侗族自治县", "罗城仫佬族自治县", "环江毛南族自治县", "从江县"],
    "三江侗族自治县": ["通道侗族自治县", "融安县", "融水苗族自治县", "龙胜各族自治县", "黎平县", "从江县"],

    // 桂林市
    "秀峰区": ["叠彩区", "象山区", "七星区", "临桂区", "灵川县"],
    "叠彩区": ["秀峰区", "七星区", "灵川县"],
    "象山区": ["秀峰区", "七星区", "雁山区", "临桂区"],
    "七星区": ["秀峰区", "叠彩区", "象山区", "雁山区", "灵川县"],
    "雁山区": ["象山区", "七星区", "临桂区", "阳朔县", "灵川县"],
    "临桂区": ["融安县", "秀峰区", "象山区", "雁山区", "阳朔县", "灵川县", "永福县", "龙胜各族自治县"],
    "阳朔县": ["雁山区", "临桂区", "灵川县", "永福县", "平乐县", "恭城瑶族自治县", "荔浦市"],
    "灵川县": ["秀峰区", "叠彩区", "七星区", "雁山区", "临桂区", "阳朔县", "兴安县", "灌阳县", "龙胜各族自治县", "恭城瑶族自治县"],
    "全州县": ["新宁县", "零陵区", "东安县", "双牌县", "道县", "兴安县", "灌阳县", "资源县"],
    "兴安县": ["灵川县", "全州县", "灌阳县", "龙胜各族自治县", "资源县"],
    "永福县": ["鹿寨县", "融安县", "临桂区", "阳朔县", "荔浦市"],
    "灌阳县": ["道县", "江永县", "灵川县", "全州县", "兴安县", "恭城瑶族自治县"],
    "龙胜各族自治县": ["城步苗族自治县", "通道侗族自治县", "融安县", "三江侗族自治县", "临桂区", "灵川县", "兴安县", "资源县"],
    "资源县": ["新宁县", "城步苗族自治县", "全州县", "兴安县", "龙胜各族自治县"],
    "平乐县": ["阳朔县", "恭城瑶族自治县", "荔浦市", "昭平县", "钟山县"],
    "恭城瑶族自治县": ["江永县", "阳朔县", "灵川县", "灌阳县", "平乐县", "钟山县", "富川瑶族自治县"],
    "荔浦市": ["鹿寨县", "阳朔县", "永福县", "平乐县", "蒙山县", "昭平县", "金秀瑶族自治县"],

    // 梧州市
    "万秀区": ["封开县", "长洲区", "龙圩区", "苍梧县"],
    "长洲区": ["万秀区", "龙圩区", "苍梧县", "藤县"],
    "龙圩区": ["封开县", "郁南县", "万秀区", "长洲区", "藤县", "岑溪市"],
    "苍梧县": ["封开县", "万秀区", "长洲区", "藤县", "八步区", "平桂区", "昭平县"],
    "藤县": ["长洲区", "龙圩区", "苍梧县", "蒙山县", "岑溪市", "平南县", "容县", "昭平县"],
    "蒙山县": ["荔浦市", "藤县", "平南县", "昭平县", "金秀瑶族自治县"],
    "岑溪市": ["信宜市", "郁南县", "罗定市", "龙圩区", "藤县", "容县"],

    // 北海市
    "海城区": ["银海区", "合浦县"],
    "银海区": ["海城区", "铁山港区", "合浦县"],
    "铁山港区": ["银海区", "合浦县"],
    "合浦县": ["廉江市", "海城区", "银海区", "铁山港区", "钦南区", "灵山县", "浦北县", "博白县"],

    // 防城港市
    "港口区": ["防城区", "钦南区"],
    "防城区": ["港口区", "上思县", "东兴市", "钦南区", "钦北区", "宁明县"],
    "上思县": ["江南区", "良庆区", "防城区", "钦北区", "扶绥县", "宁明县"],
    "东兴市": ["防城区"],

    // 钦州市
    "钦南区": ["合浦县", "港口区", "防城区", "钦北区", "灵山县"],
    "钦北区": ["良庆区", "邕宁区", "防城区", "上思县", "钦南区", "灵山县"],
    "灵山县": ["邕宁区", "横州市", "合浦县", "钦南区", "钦北区", "浦北县"],
    "浦北县": ["横州市", "合浦县", "灵山县", "港南区", "福绵区", "博白县", "兴业县"],

    // 贵港市
    "港北区": ["港南区", "覃塘区", "桂平市", "武宣县"],
    "港南区": ["横州市", "浦北县", "港北区", "覃塘区", "桂平市", "兴业县"],
    "覃塘区": ["宾阳县", "横州市", "港北区", "港南区", "兴宾区", "武宣县"],
    "平南县": ["藤县", "蒙山县", "桂平市", "容县", "金秀瑶族自治县"],
    "桂平市": ["港北区", "港南区", "平南县", "容县", "兴业县", "北流市", "武宣县", "金秀瑶族自治县"],

    // 玉林市
    "玉州区": ["福绵区", "陆川县", "兴业县", "北流市"],
    "福绵区": ["浦北县", "玉州区", "陆川县", "博白县", "兴业县"],
    "容县": ["信宜市", "藤县", "岑溪市", "平南县", "桂平市", "北流市"],
    "陆川县": ["廉江市", "化州市", "玉州区", "福绵区", "博白县", "北流市"],
    "博白县": ["廉江市", "合浦县", "浦北县", "福绵区", "陆川县"],
    "兴业县": ["浦北县", "港南区", "桂平市", "玉州区", "福绵区", "北流市"],
    "北流市": ["高州市", "化州市", "信宜市", "桂平市", "玉州区", "容县", "陆川县", "兴业县"],

    // 百色市
    "右江区": ["田阳区", "德保县", "凌云县", "田林县", "靖西市", "巴马瑶族自治县", "富宁县"],
    "田阳区": ["右江区", "田东县", "德保县", "巴马瑶族自治县"],
    "田东县": ["田阳区", "德保县", "平果市", "巴马瑶族自治县", "天等县"],
    "德保县": ["右江区", "田阳区", "田东县", "靖西市", "天等县"],
    "那坡县": ["靖西市", "富宁县"],
    "凌云县": ["右江区", "乐业县", "田林县", "凤山县", "巴马瑶族自治县"],
    "乐业县": ["凌云县", "田林县", "天峨县", "凤山县", "望谟县", "册亨县", "罗甸县"],
    "田林县": ["右江区", "凌云县", "乐业县", "西林县", "隆林各族自治县", "册亨县", "富宁县"],
    "西林县": ["田林县", "隆林各族自治县", "兴义市", "师宗县", "罗平县", "丘北县", "广南县", "富宁县"],
    "隆林各族自治县": ["田林县", "西林县", "兴义市", "册亨县", "安龙县"],
    "靖西市": ["右江区", "德保县", "那坡县", "大新县", "天等县", "富宁县"],
    "平果市": ["武鸣区", "隆安县", "马山县", "田东县", "巴马瑶族自治县", "大化瑶族自治县", "天等县"],

    // 贺州市
    "八步区": ["江华瑶族自治县", "怀集县", "封开县", "连山壮族瑶族自治县", "苍梧县", "平桂区"],
    "平桂区": ["江华瑶族自治县", "苍梧县", "八步区", "昭平县", "钟山县", "富川瑶族自治县"],
    "昭平县": ["平乐县", "荔浦市", "苍梧县", "藤县", "蒙山县", "平桂区", "钟山县"],
    "钟山县": ["平乐县", "恭城瑶族自治县", "平桂区", "昭平县", "富川瑶族自治县"],
    "富川瑶族自治县": ["江永县", "江华瑶族自治县", "恭城瑶族自治县", "平桂区", "钟山县"],

    // 河池市
    "金城江区": ["宜州区", "南丹县", "东兰县", "环江毛南族自治县", "都安瑶族自治县", "大化瑶族自治县"],
    "宜州区": ["柳南区", "柳江区", "柳城县", "金城江区", "罗城仫佬族自治县", "环江毛南族自治县", "都安瑶族自治县", "忻城县"],
    "南丹县": ["金城江区", "天峨县", "东兰县", "环江毛南族自治县", "荔波县", "独山县", "平塘县", "罗甸县"],
    "天峨县": ["乐业县", "南丹县", "凤山县", "东兰县", "罗甸县"],
    "凤山县": ["凌云县", "乐业县", "天峨县", "东兰县", "巴马瑶族自治县"],
    "东兰县": ["金城江区", "南丹县", "天峨县", "凤山县", "巴马瑶族自治县", "大化瑶族自治县"],
    "罗城仫佬族自治县": ["柳城县", "融水苗族自治县", "宜州区", "环江毛南族自治县"],
    "环江毛南族自治县": ["融水苗族自治县", "金城江区", "宜州区", "南丹县", "罗城仫佬族自治县", "从江县", "荔波县"],
    "巴马瑶族自治县": ["右江区", "田阳区", "田东县", "凌云县", "平果市", "凤山县", "东兰县", "大化瑶族自治县"],
    "都安瑶族自治县": ["马山县", "金城江区", "宜州区", "大化瑶族自治县", "忻城县"],
    "大化瑶族自治县": ["马山县", "平果市", "金城江区", "东兰县", "巴马瑶族自治县", "都安瑶族自治县"],

    // 来宾市
    "兴宾区": ["上林县", "宾阳县", "柳江区", "覃塘区", "忻城县", "象州县", "武宣县", "合山市"],
    "忻城县": ["马山县", "上林县", "柳江区", "宜州区", "都安瑶族自治县", "兴宾区", "合山市"],
    "象州县": ["鱼峰区", "柳江区", "鹿寨县", "兴宾区", "武宣县", "金秀瑶族自治县"],
    "武宣县": ["港北区", "覃塘区", "桂平市", "兴宾区", "象州县", "金秀瑶族自治县"],
    "金秀瑶族自治县": ["鹿寨县", "荔浦市", "蒙山县", "平南县", "桂平市", "象州县", "武宣县"],
    "合山市": ["兴宾区", "忻城县"],

    // 崇左市
    "江州区": ["隆安县", "扶绥县", "宁明县", "龙州县", "大新县"],
    "扶绥县": ["江南区", "西乡塘区", "隆安县", "上思县", "江州区", "宁明县"],
    "宁明县": ["防城区", "上思县", "江州区", "扶绥县", "龙州县", "凭祥市"],
    "龙州县": ["江州区", "宁明县", "大新县", "凭祥市"],
    "大新县": ["隆安县", "靖西市", "江州区", "龙州县", "天等县"],
    "天等县": ["隆安县", "田东县", "德保县", "靖西市", "平果市", "大新县"],
    "凭祥市": ["宁明县", "龙州县"],


    // ==================== 海南省 ====================
    // 海口市
    "秀英区": ["龙华区（海口市）", "定安县", "澄迈县"],
    "龙华区（海口市）": ["秀英区", "琼山区", "美兰区", "定安县"],
    "琼山区": ["龙华区（海口市）", "美兰区", "文昌市", "定安县"],
    "美兰区": ["龙华区（海口市）", "琼山区", "文昌市"],

    // 三亚市
    "海棠区": ["吉阳区", "陵水黎族自治县", "保亭黎族苗族自治县"],
    "吉阳区": ["海棠区", "天涯区", "保亭黎族苗族自治县"],
    "天涯区": ["吉阳区", "崖州区", "乐东黎族自治县", "保亭黎族苗族自治县"],
    "崖州区": ["天涯区", "乐东黎族自治县"],

    // 三沙市

    // 儋州市
    "儋州市": ["澄迈县", "临高县", "白沙黎族自治县", "昌江黎族自治县", "琼中黎族苗族自治县"],

    // 省直辖县级行政区划
    "五指山市": ["白沙黎族自治县", "乐东黎族自治县", "保亭黎族苗族自治县", "琼中黎族苗族自治县"],
    "琼海市": ["文昌市", "万宁市", "定安县", "屯昌县", "琼中黎族苗族自治县"],
    "文昌市": ["琼山区", "美兰区", "琼海市", "定安县"],
    "万宁市": ["琼海市", "陵水黎族自治县", "琼中黎族苗族自治县"],
    "东方市": ["昌江黎族自治县", "乐东黎族自治县"],
    "定安县": ["秀英区", "龙华区（海口市）", "琼山区", "琼海市", "文昌市", "屯昌县", "澄迈县"],
    "屯昌县": ["琼海市", "定安县", "澄迈县", "琼中黎族苗族自治县"],
    "澄迈县": ["秀英区", "儋州市", "定安县", "屯昌县", "临高县", "琼中黎族苗族自治县"],
    "临高县": ["儋州市", "澄迈县"],
    "白沙黎族自治县": ["儋州市", "五指山市", "昌江黎族自治县", "乐东黎族自治县", "琼中黎族苗族自治县"],
    "昌江黎族自治县": ["儋州市", "东方市", "白沙黎族自治县", "乐东黎族自治县"],
    "乐东黎族自治县": ["天涯区", "崖州区", "五指山市", "东方市", "白沙黎族自治县", "昌江黎族自治县", "保亭黎族苗族自治县"],
    "陵水黎族自治县": ["海棠区", "万宁市", "保亭黎族苗族自治县", "琼中黎族苗族自治县"],
    "保亭黎族苗族自治县": ["海棠区", "吉阳区", "天涯区", "五指山市", "乐东黎族自治县", "陵水黎族自治县", "琼中黎族苗族自治县"],
    "琼中黎族苗族自治县": ["儋州市", "五指山市", "琼海市", "万宁市", "屯昌县", "澄迈县", "白沙黎族自治县", "陵水黎族自治县", "保亭黎族苗族自治县"],


    // ==================== 重庆市 ====================
    "万州区": ["利川市", "开州区", "梁平区", "忠县", "云阳县", "石柱土家族自治县", "开江县"],
    "涪陵区": ["巴南区", "长寿区", "南川区", "武隆区", "丰都县", "垫江县"],
    "渝中区": ["沙坪坝区", "九龙坡区", "南岸区", "两江新区"],
    "大渡口区": ["九龙坡区", "巴南区", "江津区"],
    "沙坪坝区": ["渝中区", "九龙坡区", "北碚区", "璧山区", "两江新区"],
    "九龙坡区": ["渝中区", "大渡口区", "沙坪坝区", "南岸区", "巴南区", "江津区", "璧山区"],
    "南岸区": ["渝中区", "九龙坡区", "巴南区", "两江新区"],
    "北碚区": ["沙坪坝区", "长寿区", "合川区", "璧山区", "两江新区", "邻水县", "华蓥市"],
    "綦江区": ["巴南区", "江津区", "南川区", "桐梓县", "习水县"],
    "大足区": ["永川区", "铜梁区", "潼南区", "荣昌区", "安岳县"],
    "巴南区": ["涪陵区", "大渡口区", "九龙坡区", "南岸区", "綦江区", "长寿区", "江津区", "南川区", "两江新区"],
    "黔江区": ["利川市", "咸丰县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县"],
    "长寿区": ["涪陵区", "北碚区", "巴南区", "两江新区", "垫江县", "邻水县"],
    "江津区": ["大渡口区", "九龙坡区", "綦江区", "巴南区", "永川区", "璧山区", "合江县", "习水县"],
    "合川区": ["北碚区", "璧山区", "铜梁区", "潼南区", "蓬溪县", "岳池县", "武胜县", "华蓥市"],
    "永川区": ["大足区", "江津区", "璧山区", "铜梁区", "荣昌区", "泸县", "合江县"],
    "南川区": ["涪陵区", "綦江区", "巴南区", "武隆区", "桐梓县", "正安县", "道真仡佬族苗族自治县"],
    "璧山区": ["沙坪坝区", "九龙坡区", "北碚区", "江津区", "合川区", "永川区", "铜梁区"],
    "铜梁区": ["大足区", "合川区", "永川区", "璧山区", "潼南区"],
    "潼南区": ["大足区", "合川区", "铜梁区", "船山区", "安居区", "蓬溪县", "安岳县"],
    "荣昌区": ["大足区", "永川区", "泸县", "东兴区", "隆昌市", "安岳县"],
    "开州区": ["万州区", "城口县", "云阳县", "巫溪县", "宣汉县", "开江县"],
    "梁平区": ["万州区", "垫江县", "忠县", "达川区", "开江县", "大竹县"],
    "武隆区": ["涪陵区", "南川区", "丰都县", "彭水苗族土家族自治县", "道真仡佬族苗族自治县"],
    "两江新区": ["渝中区", "沙坪坝区", "南岸区", "北碚区", "巴南区", "长寿区"],
    "城口县": ["开州区", "巫溪县", "宣汉县", "万源市", "紫阳县", "岚皋县", "平利县", "镇坪县"],
    "丰都县": ["涪陵区", "武隆区", "垫江县", "忠县", "石柱土家族自治县", "彭水苗族土家族自治县"],
    "垫江县": ["涪陵区", "长寿区", "梁平区", "丰都县", "忠县", "邻水县", "大竹县"],
    "忠县": ["万州区", "梁平区", "丰都县", "垫江县", "石柱土家族自治县"],
    "云阳县": ["利川市", "万州区", "开州区", "奉节县", "巫溪县"],
    "奉节县": ["恩施市", "利川市", "建始县", "云阳县", "巫山县", "巫溪县"],
    "巫山县": ["建始县", "巴东县", "神农架林区", "奉节县", "巫溪县"],
    "巫溪县": ["竹山县", "竹溪县", "神农架林区", "开州区", "城口县", "云阳县", "奉节县", "巫山县", "镇坪县"],
    "石柱土家族自治县": ["利川市", "万州区", "丰都县", "忠县", "彭水苗族土家族自治县"],
    "秀山土家族苗族自治县": ["花垣县", "保靖县", "龙山县", "酉阳土家族苗族自治县", "松桃苗族自治县"],
    "酉阳土家族苗族自治县": ["咸丰县", "来凤县", "龙山县", "黔江区", "秀山土家族苗族自治县", "彭水苗族土家族自治县", "沿河土家族自治县", "松桃苗族自治县"],
    "彭水苗族土家族自治县": ["利川市", "黔江区", "武隆区", "丰都县", "石柱土家族自治县", "酉阳土家族苗族自治县", "道真仡佬族苗族自治县", "务川仡佬族苗族自治县", "沿河土家族自治县"],
    
    
    // ==================== 四川省 ====================
    // 成都市
    "锦江区": ["青羊区", "武侯区", "成华区", "龙泉驿区", "双流区"],
    "青羊区": ["锦江区", "金牛区", "武侯区", "温江区", "双流区", "郫都区"],
    "金牛区": ["青羊区", "成华区", "新都区", "郫都区"],
    "武侯区": ["锦江区", "青羊区", "双流区"],
    "成华区": ["锦江区", "金牛区", "龙泉驿区", "新都区"],
    "龙泉驿区": ["锦江区", "成华区", "青白江区", "新都区", "双流区", "金堂县", "简阳市"],
    "青白江区": ["龙泉驿区", "新都区", "金堂县", "广汉市"],
    "新都区": ["金牛区", "成华区", "龙泉驿区", "青白江区", "郫都区", "彭州市", "广汉市"],
    "温江区": ["青羊区", "双流区", "郫都区", "都江堰市", "崇州市"],
    "双流区": ["锦江区", "青羊区", "武侯区", "龙泉驿区", "温江区", "新津区", "崇州市", "简阳市", "彭山区", "仁寿县"],
    "郫都区": ["青羊区", "金牛区", "新都区", "温江区", "都江堰市", "彭州市"],
    "新津区": ["双流区", "大邑县", "邛崃市", "崇州市", "彭山区"],
    "金堂县": ["龙泉驿区", "青白江区", "简阳市", "中江县", "广汉市", "乐至县"],
    "大邑县": ["新津区", "邛崃市", "崇州市", "芦山县", "汶川县"],
    "蒲江县": ["邛崃市", "东坡区", "彭山区", "丹棱县", "名山区"],
    "都江堰市": ["温江区", "郫都区", "彭州市", "崇州市", "汶川县"],
    "彭州市": ["新都区", "郫都区", "都江堰市", "广汉市", "什邡市", "汶川县", "茂县"],
    "邛崃市": ["新津区", "大邑县", "蒲江县", "东坡区", "彭山区", "雨城区", "名山区", "芦山县"],
    "崇州市": ["温江区", "双流区", "新津区", "大邑县", "都江堰市", "汶川县"],
    "简阳市": ["龙泉驿区", "双流区", "金堂县", "仁寿县", "雁江区", "乐至县"],

    // 自贡市
    "自流井区": ["贡井区", "大安区", "沿滩区", "翠屏区"],
    "贡井区": ["自流井区", "大安区", "荣县", "威远县", "翠屏区", "叙州区"],
    "大安区": ["自流井区", "贡井区", "沿滩区", "富顺县", "市中区（内江市）", "东兴区", "威远县", "隆昌市"],
    "沿滩区": ["自流井区", "大安区", "富顺县", "翠屏区"],
    "荣县": ["贡井区", "威远县", "犍为县", "井研县", "仁寿县", "叙州区"],
    "富顺县": ["大安区", "沿滩区", "江阳区", "泸县", "隆昌市", "翠屏区", "南溪区", "江安县"],

    // 攀枝花市
    "东区（攀枝花市）": ["西区", "仁和区", "盐边县"],
    "西区": ["东区（攀枝花市）", "仁和区", "华坪县"],
    "仁和区": ["东区（攀枝花市）", "西区", "盐边县", "会理市", "华坪县", "永仁县"],
    "米易县": ["盐边县", "会理市", "盐源县", "德昌县"],
    "盐边县": ["东区（攀枝花市）", "仁和区", "米易县", "会理市", "盐源县", "华坪县", "宁蒗彝族自治县"],

    // 泸州市
    "江阳区": ["富顺县", "纳溪区", "龙马潭区", "泸县", "合江县", "江安县"],
    "纳溪区": ["江阳区", "合江县", "叙永县", "江安县", "兴文县"],
    "龙马潭区": ["江阳区", "泸县"],
    "泸县": ["永川区", "荣昌区", "富顺县", "江阳区", "龙马潭区", "合江县", "隆昌市"],
    "合江县": ["江津区", "永川区", "江阳区", "纳溪区", "泸县", "叙永县", "习水县", "赤水市"],
    "叙永县": ["纳溪区", "合江县", "古蔺县", "兴文县", "赤水市", "七星关区", "镇雄县", "威信县"],
    "古蔺县": ["叙永县", "习水县", "赤水市", "仁怀市", "七星关区", "金沙县"],

    // 德阳市
    "旌阳区": ["罗江区", "中江县", "广汉市", "什邡市", "绵竹市"],
    "罗江区": ["旌阳区", "中江县", "绵竹市", "涪城区", "安州区"],
    "中江县": ["金堂县", "旌阳区", "罗江区", "广汉市", "涪城区", "三台县", "大英县", "乐至县"],
    "广汉市": ["青白江区", "新都区", "金堂县", "彭州市", "旌阳区", "中江县", "什邡市"],
    "什邡市": ["彭州市", "旌阳区", "广汉市", "绵竹市", "茂县"],
    "绵竹市": ["旌阳区", "罗江区", "什邡市", "安州区", "茂县"],

    // 绵阳市
    "涪城区": ["罗江区", "中江县", "游仙区", "安州区", "三台县", "江油市"],
    "游仙区": ["涪城区", "三台县", "梓潼县", "江油市"],
    "安州区": ["罗江区", "绵竹市", "涪城区", "北川羌族自治县", "江油市", "茂县"],
    "三台县": ["中江县", "涪城区", "游仙区", "盐亭县", "梓潼县", "大英县", "射洪市"],
    "盐亭县": ["三台县", "梓潼县", "射洪市", "南部县", "西充县"],
    "梓潼县": ["游仙区", "三台县", "盐亭县", "江油市", "剑阁县", "南部县"],
    "北川羌族自治县": ["安州区", "平武县", "江油市", "茂县", "松潘县"],
    "平武县": ["北川羌族自治县", "江油市", "青川县", "松潘县", "九寨沟县", "文县"],
    "江油市": ["涪城区", "游仙区", "安州区", "梓潼县", "北川羌族自治县", "平武县", "青川县", "剑阁县"],

    // 广元市
    "利州区": ["昭化区", "朝天区", "旺苍县", "青川县", "剑阁县"],
    "昭化区": ["利州区", "旺苍县", "剑阁县", "苍溪县"],
    "朝天区": ["利州区", "旺苍县", "青川县", "宁强县"],
    "旺苍县": ["利州区", "昭化区", "朝天区", "苍溪县", "南江县", "南郑区", "宁强县"],
    "青川县": ["平武县", "江油市", "利州区", "朝天区", "剑阁县", "宁强县", "武都区", "文县"],
    "剑阁县": ["梓潼县", "江油市", "利州区", "昭化区", "青川县", "苍溪县", "南部县", "阆中市"],
    "苍溪县": ["昭化区", "旺苍县", "剑阁县", "阆中市", "恩阳区", "南江县"],

    // 遂宁市
    "船山区": ["潼南区", "安居区", "蓬溪县", "大英县"],
    "安居区": ["潼南区", "船山区", "大英县", "安岳县", "乐至县"],
    "蓬溪县": ["合川区", "潼南区", "船山区", "大英县", "射洪市", "嘉陵区", "西充县", "武胜县"],
    "大英县": ["中江县", "三台县", "船山区", "安居区", "蓬溪县", "射洪市", "乐至县"],
    "射洪市": ["三台县", "盐亭县", "蓬溪县", "大英县", "西充县"],

    // 内江市
    "市中区（内江市）": ["大安区", "东兴区", "威远县", "资中县"],
    "东兴区": ["荣昌区", "大安区", "市中区（内江市）", "资中县", "隆昌市", "安岳县"],
    "威远县": ["贡井区", "大安区", "荣县", "市中区（内江市）", "资中县", "仁寿县"],
    "资中县": ["市中区（内江市）", "东兴区", "威远县", "仁寿县", "雁江区", "安岳县"],
    "隆昌市": ["荣昌区", "大安区", "富顺县", "泸县", "东兴区"],

    // 乐山市
    "市中区（乐山市）": ["沙湾区", "五通桥区", "井研县", "夹江县", "峨眉山市", "青神县"],
    "沙湾区": ["市中区（乐山市）", "五通桥区", "犍为县", "沐川县", "峨边彝族自治县", "峨眉山市"],
    "五通桥区": ["市中区（乐山市）", "沙湾区", "犍为县", "井研县"],
    "金口河区": ["峨边彝族自治县", "峨眉山市", "洪雅县", "汉源县", "甘洛县"],
    "犍为县": ["荣县", "沙湾区", "五通桥区", "井研县", "沐川县", "叙州区"],
    "井研县": ["荣县", "市中区（乐山市）", "五通桥区", "犍为县", "仁寿县", "青神县"],
    "夹江县": ["市中区（乐山市）", "峨眉山市", "东坡区", "洪雅县", "丹棱县", "青神县"],
    "沐川县": ["沙湾区", "犍为县", "峨边彝族自治县", "马边彝族自治县", "叙州区", "屏山县"],
    "峨边彝族自治县": ["沙湾区", "金口河区", "沐川县", "马边彝族自治县", "峨眉山市", "甘洛县", "美姑县"],
    "马边彝族自治县": ["沐川县", "峨边彝族自治县", "屏山县", "美姑县", "雷波县"],
    "峨眉山市": ["市中区（乐山市）", "沙湾区", "金口河区", "夹江县", "峨边彝族自治县", "洪雅县"],

    // 南充市
    "顺庆区": ["高坪区", "嘉陵区", "南部县", "蓬安县", "西充县"],
    "高坪区": ["顺庆区", "嘉陵区", "蓬安县", "岳池县"],
    "嘉陵区": ["蓬溪县", "顺庆区", "高坪区", "西充县", "岳池县", "武胜县"],
    "南部县": ["盐亭县", "梓潼县", "剑阁县", "顺庆区", "蓬安县", "仪陇县", "西充县", "阆中市"],
    "营山县": ["蓬安县", "仪陇县", "渠县", "平昌县"],
    "蓬安县": ["顺庆区", "高坪区", "南部县", "营山县", "仪陇县", "广安区", "岳池县", "渠县"],
    "仪陇县": ["南部县", "营山县", "蓬安县", "阆中市", "巴州区", "恩阳区", "平昌县"],
    "西充县": ["盐亭县", "蓬溪县", "射洪市", "顺庆区", "嘉陵区", "南部县"],
    "阆中市": ["剑阁县", "苍溪县", "南部县", "仪陇县", "恩阳区"],

    // 眉山市
    "东坡区": ["蒲江县", "邛崃市", "夹江县", "彭山区", "仁寿县", "丹棱县", "青神县"],
    "彭山区": ["双流区", "新津区", "蒲江县", "邛崃市", "东坡区", "仁寿县"],
    "仁寿县": ["双流区", "简阳市", "荣县", "威远县", "资中县", "井研县", "东坡区", "彭山区", "青神县", "雁江区"],
    "洪雅县": ["金口河区", "夹江县", "峨眉山市", "丹棱县", "雨城区", "名山区", "荥经县", "汉源县"],
    "丹棱县": ["蒲江县", "夹江县", "东坡区", "洪雅县", "名山区"],
    "青神县": ["市中区（乐山市）", "井研县", "夹江县", "东坡区", "仁寿县"],

    // 宜宾市
    "翠屏区": ["自流井区", "贡井区", "沿滩区", "富顺县", "南溪区", "叙州区", "长宁县", "高县"],
    "南溪区": ["富顺县", "翠屏区", "江安县", "长宁县"],
    "叙州区": ["贡井区", "荣县", "犍为县", "沐川县", "翠屏区", "高县", "屏山县", "盐津县", "水富市"],
    "江安县": ["富顺县", "江阳区", "纳溪区", "南溪区", "长宁县", "兴文县"],
    "长宁县": ["翠屏区", "南溪区", "江安县", "高县", "珙县", "兴文县"],
    "高县": ["翠屏区", "叙州区", "长宁县", "珙县", "筠连县", "盐津县"],
    "珙县": ["长宁县", "高县", "筠连县", "兴文县", "威信县"],
    "筠连县": ["高县", "珙县", "盐津县", "彝良县", "威信县"],
    "兴文县": ["纳溪区", "叙永县", "江安县", "长宁县", "珙县", "威信县"],
    "屏山县": ["沐川县", "马边彝族自治县", "叙州区", "雷波县", "绥江县", "水富市"],

    // 广安市
    "广安区": ["蓬安县", "前锋区", "岳池县", "华蓥市", "渠县"],
    "前锋区": ["广安区", "邻水县", "华蓥市", "大竹县", "渠县"],
    "岳池县": ["合川区", "高坪区", "嘉陵区", "蓬安县", "广安区", "武胜县", "华蓥市"],
    "武胜县": ["合川区", "蓬溪县", "嘉陵区", "岳池县"],
    "邻水县": ["北碚区", "长寿区", "垫江县", "前锋区", "华蓥市", "大竹县"],
    "华蓥市": ["北碚区", "合川区", "广安区", "前锋区", "岳池县", "邻水县"],

    // 达州市
    "通川区": ["达川区", "宣汉县", "平昌县"],
    "达川区": ["梁平区", "通川区", "宣汉县", "开江县", "大竹县", "渠县", "平昌县"],
    "宣汉县": ["开州区", "城口县", "通川区", "达川区", "开江县", "万源市", "平昌县"],
    "开江县": ["万州区", "开州区", "梁平区", "达川区", "宣汉县"],
    "大竹县": ["梁平区", "垫江县", "前锋区", "邻水县", "达川区", "渠县"],
    "渠县": ["营山县", "蓬安县", "广安区", "前锋区", "达川区", "大竹县", "平昌县"],
    "万源市": ["城口县", "宣汉县", "通江县", "平昌县", "镇巴县", "紫阳县"],

    // 雅安市
    "雨城区": ["邛崃市", "洪雅县", "名山区", "荥经县", "天全县", "芦山县"],
    "名山区": ["蒲江县", "邛崃市", "洪雅县", "丹棱县", "雨城区"],
    "荥经县": ["洪雅县", "雨城区", "汉源县", "天全县", "泸定县"],
    "汉源县": ["金口河区", "洪雅县", "荥经县", "石棉县", "泸定县", "甘洛县"],
    "石棉县": ["汉源县", "康定市", "泸定县", "九龙县", "冕宁县", "越西县", "甘洛县"],
    "天全县": ["雨城区", "荥经县", "芦山县", "宝兴县", "康定市", "泸定县"],
    "芦山县": ["大邑县", "邛崃市", "雨城区", "天全县", "宝兴县", "汶川县"],
    "宝兴县": ["天全县", "芦山县", "汶川县", "小金县", "康定市"],

    // 巴中市
    "巴州区": ["仪陇县", "恩阳区", "通江县", "南江县", "平昌县"],
    "恩阳区": ["苍溪县", "仪陇县", "阆中市", "巴州区", "南江县"],
    "通江县": ["万源市", "巴州区", "南江县", "平昌县", "南郑区", "西乡县", "镇巴县"],
    "南江县": ["旺苍县", "苍溪县", "巴州区", "恩阳区", "通江县", "南郑区"],
    "平昌县": ["营山县", "仪陇县", "通川区", "达川区", "宣汉县", "渠县", "万源市", "巴州区", "通江县"],

    // 资阳市
    "雁江区": ["简阳市", "资中县", "仁寿县", "安岳县", "乐至县"],
    "安岳县": ["大足区", "潼南区", "荣昌区", "安居区", "东兴区", "资中县", "雁江区", "乐至县"],
    "乐至县": ["金堂县", "简阳市", "中江县", "安居区", "大英县", "雁江区", "安岳县"],

    // 阿坝藏族羌族自治州
    "马尔康市": ["理县", "金川县", "小金县", "壤塘县", "阿坝县", "红原县"],
    "汶川县": ["大邑县", "都江堰市", "彭州市", "崇州市", "芦山县", "宝兴县", "理县", "茂县", "小金县"],
    "理县": ["马尔康市", "汶川县", "茂县", "小金县", "黑水县", "红原县"],
    "茂县": ["彭州市", "什邡市", "绵竹市", "安州区", "北川羌族自治县", "汶川县", "理县", "松潘县", "黑水县"],
    "松潘县": ["北川羌族自治县", "平武县", "茂县", "九寨沟县", "黑水县", "若尔盖县", "红原县"],
    "九寨沟县": ["平武县", "松潘县", "若尔盖县", "文县", "舟曲县", "迭部县"],
    "金川县": ["马尔康市", "小金县", "壤塘县", "丹巴县", "道孚县"],
    "小金县": ["宝兴县", "马尔康市", "汶川县", "理县", "金川县", "康定市", "丹巴县"],
    "黑水县": ["理县", "茂县", "松潘县", "红原县"],
    "壤塘县": ["马尔康市", "金川县", "阿坝县", "道孚县", "炉霍县", "色达县", "班玛县"],
    "阿坝县": ["马尔康市", "壤塘县", "若尔盖县", "红原县", "玛曲县", "班玛县", "久治县"],
    "若尔盖县": ["松潘县", "九寨沟县", "阿坝县", "红原县", "卓尼县", "迭部县", "玛曲县", "碌曲县"],
    "红原县": ["马尔康市", "理县", "松潘县", "黑水县", "阿坝县", "若尔盖县"],

    // 甘孜藏族自治州
    "康定市": ["石棉县", "天全县", "宝兴县", "小金县", "泸定县", "丹巴县", "九龙县", "雅江县", "道孚县", "木里藏族自治县"],
    "泸定县": ["荥经县", "汉源县", "石棉县", "天全县", "康定市"],
    "丹巴县": ["金川县", "小金县", "康定市", "道孚县"],
    "九龙县": ["石棉县", "康定市", "木里藏族自治县", "冕宁县"],
    "雅江县": ["康定市", "道孚县", "新龙县", "理塘县", "木里藏族自治县"],
    "道孚县": ["金川县", "壤塘县", "康定市", "丹巴县", "雅江县", "炉霍县", "新龙县"],
    "炉霍县": ["壤塘县", "道孚县", "甘孜县", "新龙县", "色达县"],
    "甘孜县": ["炉霍县", "新龙县", "德格县", "石渠县", "色达县", "达日县"],
    "新龙县": ["雅江县", "道孚县", "炉霍县", "甘孜县", "德格县", "白玉县", "理塘县"],
    "德格县": ["甘孜县", "新龙县", "白玉县", "石渠县", "江达县"],
    "白玉县": ["新龙县", "德格县", "理塘县", "巴塘县", "江达县", "贡觉县"],
    "石渠县": ["甘孜县", "德格县", "江达县", "达日县", "玛多县", "玉树市", "称多县"],
    "色达县": ["壤塘县", "炉霍县", "甘孜县", "班玛县", "达日县"],
    "理塘县": ["雅江县", "新龙县", "白玉县", "巴塘县", "乡城县", "稻城县", "木里藏族自治县"],
    "巴塘县": ["白玉县", "理塘县", "乡城县", "得荣县", "德钦县", "贡觉县", "芒康县"],
    "乡城县": ["理塘县", "巴塘县", "稻城县", "得荣县", "香格里拉市"],
    "稻城县": ["理塘县", "乡城县", "木里藏族自治县", "香格里拉市"],
    "得荣县": ["巴塘县", "乡城县", "香格里拉市", "德钦县"],

    // 凉山彝族自治州
    "西昌市": ["盐源县", "德昌县", "普格县", "昭觉县", "喜德县", "冕宁县"],
    "会理市": ["仁和区", "米易县", "盐边县", "德昌县", "会东县", "宁南县", "禄劝彝族苗族自治县", "永仁县", "元谋县", "武定县"],
    "木里藏族自治县": ["康定市", "九龙县", "雅江县", "理塘县", "稻城县", "盐源县", "冕宁县", "玉龙纳西族自治县", "宁蒗彝族自治县", "香格里拉市"],
    "盐源县": ["米易县", "盐边县", "西昌市", "木里藏族自治县", "德昌县", "冕宁县", "宁蒗彝族自治县"],
    "德昌县": ["米易县", "西昌市", "会理市", "盐源县", "宁南县", "普格县"],
    "会东县": ["会理市", "宁南县", "东川区", "禄劝彝族苗族自治县", "巧家县"],
    "宁南县": ["会理市", "德昌县", "会东县", "普格县", "布拖县", "巧家县"],
    "普格县": ["西昌市", "德昌县", "宁南县", "布拖县", "昭觉县"],
    "布拖县": ["宁南县", "普格县", "金阳县", "昭觉县", "巧家县"],
    "金阳县": ["布拖县", "昭觉县", "雷波县", "昭阳区", "巧家县", "永善县"],
    "昭觉县": ["西昌市", "普格县", "布拖县", "金阳县", "喜德县", "越西县", "美姑县", "雷波县"],
    "喜德县": ["西昌市", "昭觉县", "冕宁县", "越西县"],
    "冕宁县": ["石棉县", "九龙县", "西昌市", "木里藏族自治县", "盐源县", "喜德县", "越西县"],
    "越西县": ["石棉县", "昭觉县", "喜德县", "冕宁县", "甘洛县", "美姑县"],
    "甘洛县": ["金口河区", "峨边彝族自治县", "汉源县", "石棉县", "越西县", "美姑县"],
    "美姑县": ["峨边彝族自治县", "马边彝族自治县", "昭觉县", "越西县", "甘洛县", "雷波县"],
    "雷波县": ["马边彝族自治县", "屏山县", "金阳县", "昭觉县", "美姑县", "永善县", "绥江县"],


    // ==================== 贵州省 ====================
    // 贵阳市
    "南明区": ["云岩区", "花溪区", "乌当区", "龙里县"],
    "云岩区": ["南明区", "花溪区", "乌当区", "白云区（贵阳市）", "观山湖区"],
    "花溪区": ["南明区", "云岩区", "观山湖区", "清镇市", "平坝区", "长顺县", "龙里县", "惠水县"],
    "乌当区": ["南明区", "云岩区", "白云区（贵阳市）", "开阳县", "修文县", "龙里县"],
    "白云区（贵阳市）": ["云岩区", "乌当区", "观山湖区", "修文县", "清镇市"],
    "观山湖区": ["云岩区", "花溪区", "白云区（贵阳市）", "清镇市"],
    "开阳县": ["乌当区", "息烽县", "修文县", "播州区", "福泉市", "瓮安县", "龙里县"],
    "息烽县": ["开阳县", "修文县", "播州区", "金沙县"],
    "修文县": ["乌当区", "白云区（贵阳市）", "开阳县", "息烽县", "清镇市", "金沙县", "黔西市"],
    "清镇市": ["花溪区", "白云区（贵阳市）", "观山湖区", "修文县", "平坝区", "织金县", "黔西市"],

    // 六盘水市
    "钟山区": ["水城区", "纳雍县", "威宁彝族回族苗族自治县", "赫章县"],
    "六枝特区": ["水城区", "普定县", "镇宁布依族苗族自治县", "关岭布依族苗族自治县", "织金县", "纳雍县", "普安县", "晴隆县"],
    "水城区": ["钟山区", "六枝特区", "盘州市", "纳雍县", "威宁彝族回族苗族自治县", "普安县", "宣威市"],
    "盘州市": ["水城区", "兴义市", "普安县", "富源县", "宣威市"],

    // 遵义市
    "红花岗区": ["汇川区", "播州区", "绥阳县", "湄潭县"],
    "汇川区": ["红花岗区", "播州区", "桐梓县", "绥阳县", "仁怀市"],
    "播州区": ["开阳县", "息烽县", "红花岗区", "汇川区", "湄潭县", "仁怀市", "金沙县", "瓮安县"],
    "桐梓县": ["綦江区", "南川区", "汇川区", "绥阳县", "正安县", "习水县", "仁怀市"],
    "绥阳县": ["红花岗区", "汇川区", "桐梓县", "正安县", "湄潭县"],
    "正安县": ["南川区", "桐梓县", "绥阳县", "道真仡佬族苗族自治县", "务川仡佬族苗族自治县", "凤冈县", "湄潭县"],
    "道真仡佬族苗族自治县": ["南川区", "武隆区", "彭水苗族土家族自治县", "正安县", "务川仡佬族苗族自治县"],
    "务川仡佬族苗族自治县": ["彭水苗族土家族自治县", "正安县", "道真仡佬族苗族自治县", "凤冈县", "德江县", "沿河土家族自治县"],
    "凤冈县": ["正安县", "务川仡佬族苗族自治县", "湄潭县", "余庆县", "石阡县", "思南县", "德江县"],
    "湄潭县": ["红花岗区", "播州区", "绥阳县", "正安县", "凤冈县", "余庆县", "瓮安县"],
    "余庆县": ["凤冈县", "湄潭县", "石阡县", "黄平县", "施秉县", "瓮安县"],
    "习水县": ["綦江区", "江津区", "合江县", "古蔺县", "桐梓县", "赤水市", "仁怀市"],
    "赤水市": ["合江县", "叙永县", "古蔺县", "习水县"],
    "仁怀市": ["古蔺县", "汇川区", "播州区", "桐梓县", "习水县", "金沙县"],

    // 安顺市
    "西秀区": ["平坝区", "普定县", "镇宁布依族苗族自治县", "紫云苗族布依族自治县", "长顺县"],
    "平坝区": ["花溪区", "清镇市", "西秀区", "普定县", "织金县", "长顺县"],
    "普定县": ["六枝特区", "西秀区", "平坝区", "镇宁布依族苗族自治县", "织金县"],
    "镇宁布依族苗族自治县": ["六枝特区", "西秀区", "普定县", "关岭布依族苗族自治县", "紫云苗族布依族自治县", "贞丰县", "望谟县"],
    "关岭布依族苗族自治县": ["六枝特区", "镇宁布依族苗族自治县", "兴仁市", "晴隆县", "贞丰县"],
    "紫云苗族布依族自治县": ["西秀区", "镇宁布依族苗族自治县", "望谟县", "罗甸县", "长顺县"],

    // 毕节市
    "七星关区": ["叙永县", "古蔺县", "大方县", "金沙县", "纳雍县", "赫章县", "镇雄县"],
    "大方县": ["七星关区", "金沙县", "织金县", "纳雍县", "黔西市"],
    "金沙县": ["古蔺县", "息烽县", "修文县", "播州区", "仁怀市", "七星关区", "大方县", "黔西市"],
    "织金县": ["清镇市", "六枝特区", "平坝区", "普定县", "大方县", "纳雍县", "黔西市"],
    "纳雍县": ["钟山区", "六枝特区", "水城区", "七星关区", "大方县", "织金县", "赫章县"],
    "威宁彝族回族苗族自治县": ["钟山区", "水城区", "赫章县", "会泽县", "宣威市", "昭阳区", "鲁甸县", "彝良县"],
    "赫章县": ["钟山区", "七星关区", "纳雍县", "威宁彝族回族苗族自治县", "镇雄县", "彝良县"],
    "黔西市": ["修文县", "清镇市", "大方县", "金沙县", "织金县"],

    // 铜仁市
    "碧江区": ["麻阳苗族自治县", "芷江侗族自治县", "凤凰县", "万山区", "江口县", "松桃苗族自治县"],
    "万山区": ["新晃侗族自治县", "芷江侗族自治县", "碧江区", "江口县", "玉屏侗族自治县", "岑巩县"],
    "江口县": ["碧江区", "万山区", "石阡县", "印江土家族苗族自治县", "松桃苗族自治县", "岑巩县"],
    "玉屏侗族自治县": ["新晃侗族自治县", "万山区", "镇远县", "岑巩县"],
    "石阡县": ["凤冈县", "余庆县", "江口县", "思南县", "印江土家族苗族自治县", "施秉县", "镇远县", "岑巩县"],
    "思南县": ["凤冈县", "石阡县", "印江土家族苗族自治县", "德江县"],
    "印江土家族苗族自治县": ["江口县", "石阡县", "思南县", "德江县", "沿河土家族自治县", "松桃苗族自治县"],
    "德江县": ["务川仡佬族苗族自治县", "凤冈县", "思南县", "印江土家族苗族自治县", "沿河土家族自治县"],
    "沿河土家族自治县": ["酉阳土家族苗族自治县", "彭水苗族土家族自治县", "务川仡佬族苗族自治县", "印江土家族苗族自治县", "德江县", "松桃苗族自治县"],
    "松桃苗族自治县": ["凤凰县", "花垣县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "碧江区", "江口县", "印江土家族苗族自治县", "沿河土家族自治县"],

    // 黔西南布依族苗族自治州
    "兴义市": ["西林县", "隆林各族自治县", "盘州市", "兴仁市", "普安县", "安龙县", "罗平县", "富源县"],
    "兴仁市": ["关岭布依族苗族自治县", "兴义市", "普安县", "晴隆县", "贞丰县", "安龙县"],
    "普安县": ["六枝特区", "水城区", "盘州市", "兴义市", "兴仁市", "晴隆县"],
    "晴隆县": ["六枝特区", "关岭布依族苗族自治县", "兴仁市", "普安县"],
    "贞丰县": ["镇宁布依族苗族自治县", "关岭布依族苗族自治县", "兴仁市", "望谟县", "册亨县", "安龙县"],
    "望谟县": ["乐业县", "镇宁布依族苗族自治县", "紫云苗族布依族自治县", "贞丰县", "册亨县", "罗甸县"],
    "册亨县": ["乐业县", "田林县", "隆林各族自治县", "贞丰县", "望谟县", "安龙县"],
    "安龙县": ["隆林各族自治县", "兴义市", "兴仁市", "贞丰县", "册亨县"],

    // 黔东南苗族侗族自治州
    "凯里市": ["黄平县", "台江县", "雷山县", "麻江县", "丹寨县", "福泉市"],
    "黄平县": ["余庆县", "凯里市", "施秉县", "台江县", "福泉市", "瓮安县"],
    "施秉县": ["余庆县", "石阡县", "黄平县", "镇远县", "剑河县", "台江县"],
    "三穗县": ["新晃侗族自治县", "镇远县", "天柱县", "剑河县"],
    "镇远县": ["新晃侗族自治县", "玉屏侗族自治县", "石阡县", "施秉县", "三穗县", "岑巩县", "剑河县"],
    "岑巩县": ["万山区", "江口县", "玉屏侗族自治县", "石阡县", "镇远县"],
    "天柱县": ["会同县", "新晃侗族自治县", "芷江侗族自治县", "靖州苗族侗族自治县", "三穗县", "锦屏县", "剑河县"],
    "锦屏县": ["靖州苗族侗族自治县", "天柱县", "剑河县", "黎平县"],
    "剑河县": ["施秉县", "三穗县", "镇远县", "天柱县", "锦屏县", "台江县", "黎平县", "榕江县", "雷山县"],
    "台江县": ["凯里市", "黄平县", "施秉县", "剑河县", "雷山县"],
    "黎平县": ["靖州苗族侗族自治县", "通道侗族自治县", "三江侗族自治县", "锦屏县", "剑河县", "榕江县", "从江县"],
    "榕江县": ["剑河县", "黎平县", "从江县", "雷山县", "荔波县", "三都水族自治县"],
    "从江县": ["融水苗族自治县", "三江侗族自治县", "环江毛南族自治县", "黎平县", "榕江县", "荔波县"],
    "雷山县": ["凯里市", "剑河县", "台江县", "榕江县", "丹寨县", "三都水族自治县"],
    "麻江县": ["凯里市", "丹寨县", "都匀市", "福泉市", "贵定县"],
    "丹寨县": ["凯里市", "雷山县", "麻江县", "都匀市", "三都水族自治县"],

    // 黔南布依族苗族自治州
    "都匀市": ["麻江县", "丹寨县", "贵定县", "独山县", "平塘县", "三都水族自治县"],
    "福泉市": ["开阳县", "凯里市", "黄平县", "麻江县", "贵定县", "瓮安县", "龙里县"],
    "荔波县": ["南丹县", "环江毛南族自治县", "榕江县", "从江县", "独山县", "三都水族自治县"],
    "贵定县": ["麻江县", "都匀市", "福泉市", "平塘县", "龙里县", "惠水县"],
    "瓮安县": ["开阳县", "播州区", "湄潭县", "余庆县", "黄平县", "福泉市"],
    "独山县": ["南丹县", "都匀市", "荔波县", "平塘县", "三都水族自治县"],
    "平塘县": ["南丹县", "都匀市", "贵定县", "独山县", "罗甸县", "惠水县"],
    "罗甸县": ["乐业县", "南丹县", "天峨县", "紫云苗族布依族自治县", "望谟县", "平塘县", "长顺县", "惠水县"],
    "长顺县": ["花溪区", "西秀区", "平坝区", "紫云苗族布依族自治县", "罗甸县", "惠水县"],
    "龙里县": ["南明区", "花溪区", "乌当区", "开阳县", "福泉市", "贵定县", "惠水县"],
    "惠水县": ["花溪区", "贵定县", "平塘县", "罗甸县", "长顺县", "龙里县"],
    "三都水族自治县": ["榕江县", "雷山县", "丹寨县", "都匀市", "荔波县", "独山县"],


    // ==================== 云南省 ====================
    // 昆明市
    "五华区": ["盘龙区", "西山区", "富民县"],
    "盘龙区": ["五华区", "官渡区", "富民县", "嵩明县", "寻甸回族彝族自治县"],
    "官渡区": ["盘龙区", "西山区", "呈贡区", "宜良县", "嵩明县"],
    "西山区": ["五华区", "官渡区", "呈贡区", "晋宁区", "富民县", "安宁市", "禄丰市"],
    "东川区": ["会东县", "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "会泽县", "巧家县"],
    "呈贡区": ["官渡区", "西山区", "晋宁区", "宜良县", "澄江市"],
    "晋宁区": ["西山区", "呈贡区", "安宁市", "红塔区", "江川区", "易门县", "峨山彝族自治县", "澄江市"],
    "富民县": ["五华区", "盘龙区", "西山区", "禄劝彝族苗族自治县", "寻甸回族彝族自治县", "禄丰市", "武定县"],
    "宜良县": ["官渡区", "呈贡区", "石林彝族自治县", "嵩明县", "马龙区", "陆良县", "华宁县", "澄江市", "弥勒市"],
    "石林彝族自治县": ["宜良县", "陆良县", "弥勒市", "泸西县"],
    "嵩明县": ["盘龙区", "官渡区", "宜良县", "寻甸回族彝族自治县", "马龙区"],
    "禄劝彝族苗族自治县": ["会理市", "会东县", "东川区", "富民县", "寻甸回族彝族自治县", "武定县"],
    "寻甸回族彝族自治县": ["盘龙区", "东川区", "富民县", "嵩明县", "禄劝彝族苗族自治县", "沾益区", "马龙区", "会泽县"],
    "安宁市": ["西山区", "晋宁区", "易门县", "禄丰市"],

    // 曲靖市
    "麒麟区": ["沾益区", "马龙区", "陆良县", "罗平县", "富源县"],
    "沾益区": ["寻甸回族彝族自治县", "麒麟区", "马龙区", "富源县", "会泽县", "宣威市"],
    "马龙区": ["宜良县", "嵩明县", "寻甸回族彝族自治县", "麒麟区", "沾益区", "陆良县"],
    "陆良县": ["宜良县", "石林彝族自治县", "麒麟区", "马龙区", "师宗县", "罗平县", "泸西县"],
    "师宗县": ["西林县", "陆良县", "罗平县", "泸西县", "丘北县"],
    "罗平县": ["西林县", "兴义市", "麒麟区", "陆良县", "师宗县", "富源县"],
    "富源县": ["盘州市", "兴义市", "麒麟区", "沾益区", "罗平县", "宣威市"],
    "会泽县": ["威宁彝族回族苗族自治县", "东川区", "寻甸回族彝族自治县", "沾益区", "宣威市", "鲁甸县", "巧家县"],
    "宣威市": ["水城区", "盘州市", "威宁彝族回族苗族自治县", "沾益区", "富源县", "会泽县"],

    // 玉溪市
    "红塔区": ["晋宁区", "江川区", "通海县", "峨山彝族自治县"],
    "江川区": ["晋宁区", "红塔区", "通海县", "华宁县", "澄江市"],
    "通海县": ["红塔区", "江川区", "华宁县", "峨山彝族自治县", "建水县", "石屏县"],
    "华宁县": ["宜良县", "江川区", "通海县", "澄江市", "弥勒市", "建水县"],
    "易门县": ["晋宁区", "安宁市", "峨山彝族自治县", "禄丰市", "双柏县"],
    "峨山彝族自治县": ["晋宁区", "红塔区", "通海县", "易门县", "新平彝族傣族自治县", "双柏县", "石屏县"],
    "新平彝族傣族自治县": ["峨山彝族自治县", "元江哈尼族彝族傣族自治县", "墨江哈尼族自治县", "镇沅彝族哈尼族拉祜族自治县", "双柏县", "石屏县"],
    "元江哈尼族彝族傣族自治县": ["新平彝族傣族自治县", "墨江哈尼族自治县", "石屏县", "红河县"],
    "澄江市": ["呈贡区", "晋宁区", "宜良县", "江川区", "华宁县"],

    // 保山市
    "隆阳区": ["施甸县", "龙陵县", "昌宁县", "腾冲市", "永平县", "云龙县", "泸水市"],
    "施甸县": ["隆阳区", "龙陵县", "昌宁县", "永德县"],
    "龙陵县": ["隆阳区", "施甸县", "腾冲市", "永德县", "镇康县", "芒市", "梁河县"],
    "昌宁县": ["隆阳区", "施甸县", "凤庆县", "永德县", "漾濞彝族自治县", "巍山彝族回族自治县", "永平县"],
    "腾冲市": ["隆阳区", "龙陵县", "梁河县", "盈江县", "泸水市"],

    // 昭通市
    "昭阳区": ["金阳县", "威宁彝族回族苗族自治县", "鲁甸县", "巧家县", "大关县", "永善县", "彝良县"],
    "鲁甸县": ["威宁彝族回族苗族自治县", "会泽县", "昭阳区", "巧家县"],
    "巧家县": ["会东县", "宁南县", "布拖县", "金阳县", "东川区", "会泽县", "昭阳区", "鲁甸县"],
    "盐津县": ["叙州区", "高县", "筠连县", "大关县", "永善县", "绥江县", "彝良县", "水富市"],
    "大关县": ["昭阳区", "盐津县", "永善县", "彝良县"],
    "永善县": ["金阳县", "雷波县", "昭阳区", "盐津县", "大关县", "绥江县"],
    "绥江县": ["屏山县", "雷波县", "盐津县", "永善县", "水富市"],
    "镇雄县": ["叙永县", "七星关区", "赫章县", "彝良县", "威信县"],
    "彝良县": ["筠连县", "威宁彝族回族苗族自治县", "赫章县", "昭阳区", "盐津县", "大关县", "镇雄县", "威信县"],
    "威信县": ["叙永县", "珙县", "筠连县", "兴文县", "镇雄县", "彝良县"],
    "水富市": ["叙州区", "屏山县", "盐津县", "绥江县"],

    // 丽江市
    "古城区": ["玉龙纳西族自治县", "永胜县", "宁蒗彝族自治县", "鹤庆县"],
    "玉龙纳西族自治县": ["木里藏族自治县", "古城区", "宁蒗彝族自治县", "剑川县", "鹤庆县", "兰坪白族普米族自治县", "香格里拉市", "维西傈僳族自治县"],
    "永胜县": ["古城区", "华坪县", "宁蒗彝族自治县", "大姚县", "宾川县", "鹤庆县"],
    "华坪县": ["西区", "仁和区", "盐边县", "永胜县", "宁蒗彝族自治县", "大姚县", "永仁县"],
    "宁蒗彝族自治县": ["盐边县", "木里藏族自治县", "盐源县", "古城区", "玉龙纳西族自治县", "永胜县", "华坪县"],

    // 普洱市
    "思茅区": ["宁洱哈尼族彝族自治县", "景谷傣族彝族自治县", "江城哈尼族彝族自治县", "澜沧拉祜族自治县", "景洪市", "勐海县"],
    "宁洱哈尼族彝族自治县": ["思茅区", "墨江哈尼族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "江城哈尼族彝族自治县"],
    "墨江哈尼族自治县": ["新平彝族傣族自治县", "元江哈尼族彝族傣族自治县", "宁洱哈尼族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "江城哈尼族彝族自治县", "红河县", "绿春县"],
    "景东彝族自治县": ["镇沅彝族哈尼族拉祜族自治县", "临翔区", "云县", "楚雄市", "双柏县", "南华县", "弥渡县", "南涧彝族自治县"],
    "景谷傣族彝族自治县": ["思茅区", "宁洱哈尼族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "澜沧拉祜族自治县", "临翔区", "双江拉祜族佤族布朗族傣族自治县"],
    "镇沅彝族哈尼族拉祜族自治县": ["新平彝族傣族自治县", "宁洱哈尼族彝族自治县", "墨江哈尼族自治县", "景东彝族自治县", "景谷傣族彝族自治县", "临翔区", "双柏县"],
    "江城哈尼族彝族自治县": ["思茅区", "宁洱哈尼族彝族自治县", "墨江哈尼族自治县", "绿春县", "景洪市", "勐腊县"],
    "孟连傣族拉祜族佤族自治县": ["澜沧拉祜族自治县", "西盟佤族自治县"],
    "澜沧拉祜族自治县": ["思茅区", "景谷傣族彝族自治县", "孟连傣族拉祜族佤族自治县", "西盟佤族自治县", "双江拉祜族佤族布朗族傣族自治县", "沧源佤族自治县", "勐海县"],
    "西盟佤族自治县": ["孟连傣族拉祜族佤族自治县", "澜沧拉祜族自治县"],

    // 临沧市
    "临翔区": ["景东彝族自治县", "景谷傣族彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "云县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县"],
    "凤庆县": ["昌宁县", "云县", "永德县", "南涧彝族自治县", "巍山彝族回族自治县"],
    "云县": ["景东彝族自治县", "临翔区", "凤庆县", "永德县", "耿马傣族佤族自治县", "南涧彝族自治县"],
    "永德县": ["施甸县", "龙陵县", "昌宁县", "凤庆县", "云县", "镇康县", "耿马傣族佤族自治县"],
    "镇康县": ["龙陵县", "永德县", "耿马傣族佤族自治县"],
    "双江拉祜族佤族布朗族傣族自治县": ["景谷傣族彝族自治县", "澜沧拉祜族自治县", "临翔区", "耿马傣族佤族自治县", "沧源佤族自治县"],
    "耿马傣族佤族自治县": ["临翔区", "云县", "永德县", "镇康县", "双江拉祜族佤族布朗族傣族自治县", "沧源佤族自治县"],
    "沧源佤族自治县": ["澜沧拉祜族自治县", "双江拉祜族佤族布朗族傣族自治县", "耿马傣族佤族自治县"],

    // 楚雄彝族自治州
    "楚雄市": ["景东彝族自治县", "禄丰市", "双柏县", "牟定县", "南华县"],
    "禄丰市": ["西山区", "富民县", "安宁市", "易门县", "楚雄市", "双柏县", "牟定县", "元谋县", "武定县"],
    "双柏县": ["易门县", "峨山彝族自治县", "新平彝族傣族自治县", "景东彝族自治县", "镇沅彝族哈尼族拉祜族自治县", "楚雄市", "禄丰市"],
    "牟定县": ["楚雄市", "禄丰市", "南华县", "姚安县", "大姚县", "元谋县"],
    "南华县": ["景东彝族自治县", "楚雄市", "牟定县", "姚安县", "祥云县", "弥渡县"],
    "姚安县": ["牟定县", "南华县", "大姚县", "祥云县"],
    "大姚县": ["永胜县", "华坪县", "牟定县", "姚安县", "永仁县", "元谋县", "祥云县", "宾川县"],
    "永仁县": ["仁和区", "会理市", "华坪县", "大姚县", "元谋县"],
    "元谋县": ["会理市", "禄丰市", "牟定县", "大姚县", "永仁县", "武定县"],
    "武定县": ["会理市", "富民县", "禄劝彝族苗族自治县", "禄丰市", "元谋县"],

    // 红河哈尼族彝族自治州
    "个旧市": ["开远市", "蒙自市", "屏边苗族自治县", "建水县", "元阳县", "金平苗族瑶族傣族自治县", "河口瑶族自治县"],
    "开远市": ["个旧市", "蒙自市", "弥勒市", "建水县", "砚山县", "丘北县"],
    "蒙自市": ["个旧市", "开远市", "屏边苗族自治县", "元阳县", "金平苗族瑶族傣族自治县", "文山市", "砚山县"],
    "弥勒市": ["宜良县", "石林彝族自治县", "华宁县", "开远市", "建水县", "泸西县", "丘北县"],
    "屏边苗族自治县": ["个旧市", "蒙自市", "河口瑶族自治县", "文山市", "马关县"],
    "建水县": ["通海县", "华宁县", "个旧市", "开远市", "弥勒市", "石屏县", "元阳县", "红河县"],
    "石屏县": ["通海县", "峨山彝族自治县", "新平彝族傣族自治县", "元江哈尼族彝族傣族自治县", "建水县", "红河县"],
    "泸西县": ["石林彝族自治县", "陆良县", "师宗县", "弥勒市", "丘北县"],
    "元阳县": ["个旧市", "蒙自市", "建水县", "红河县", "金平苗族瑶族傣族自治县", "绿春县"],
    "红河县": ["元江哈尼族彝族傣族自治县", "墨江哈尼族自治县", "建水县", "石屏县", "元阳县", "绿春县"],
    "金平苗族瑶族傣族自治县": ["个旧市", "蒙自市", "元阳县", "绿春县", "河口瑶族自治县"],
    "绿春县": ["墨江哈尼族自治县", "江城哈尼族彝族自治县", "元阳县", "红河县", "金平苗族瑶族傣族自治县"],
    "河口瑶族自治县": ["个旧市", "屏边苗族自治县", "金平苗族瑶族傣族自治县", "马关县"],

    // 文山壮族苗族自治州
    "文山市": ["蒙自市", "屏边苗族自治县", "砚山县", "西畴县", "马关县"],
    "砚山县": ["开远市", "蒙自市", "文山市", "西畴县", "丘北县", "广南县"],
    "西畴县": ["文山市", "砚山县", "麻栗坡县", "马关县", "广南县"],
    "麻栗坡县": ["西畴县", "马关县", "广南县", "富宁县"],
    "马关县": ["屏边苗族自治县", "河口瑶族自治县", "文山市", "西畴县", "麻栗坡县"],
    "丘北县": ["西林县", "师宗县", "开远市", "弥勒市", "泸西县", "砚山县", "广南县"],
    "广南县": ["西林县", "砚山县", "西畴县", "麻栗坡县", "丘北县", "富宁县"],
    "富宁县": ["右江区", "那坡县", "田林县", "西林县", "靖西市", "麻栗坡县", "广南县"],

    // 西双版纳傣族自治州
    "景洪市": ["思茅区", "江城哈尼族彝族自治县", "勐海县", "勐腊县"],
    "勐海县": ["思茅区", "澜沧拉祜族自治县", "景洪市"],
    "勐腊县": ["江城哈尼族彝族自治县", "景洪市"],

    // 大理白族自治州
    "大理市": ["漾濞彝族自治县", "祥云县", "宾川县", "弥渡县", "巍山彝族回族自治县", "洱源县", "鹤庆县"],
    "漾濞彝族自治县": ["昌宁县", "大理市", "巍山彝族回族自治县", "永平县", "云龙县", "洱源县"],
    "祥云县": ["南华县", "姚安县", "大姚县", "大理市", "宾川县", "弥渡县"],
    "宾川县": ["永胜县", "大姚县", "大理市", "祥云县", "鹤庆县"],
    "弥渡县": ["景东彝族自治县", "南华县", "大理市", "祥云县", "南涧彝族自治县", "巍山彝族回族自治县"],
    "南涧彝族自治县": ["景东彝族自治县", "凤庆县", "云县", "弥渡县", "巍山彝族回族自治县"],
    "巍山彝族回族自治县": ["昌宁县", "凤庆县", "大理市", "漾濞彝族自治县", "弥渡县", "南涧彝族自治县"],
    "永平县": ["隆阳区", "昌宁县", "漾濞彝族自治县", "云龙县"],
    "云龙县": ["隆阳区", "漾濞彝族自治县", "永平县", "洱源县", "剑川县", "泸水市", "兰坪白族普米族自治县"],
    "洱源县": ["大理市", "漾濞彝族自治县", "云龙县", "剑川县", "鹤庆县"],
    "剑川县": ["玉龙纳西族自治县", "云龙县", "洱源县", "鹤庆县", "兰坪白族普米族自治县"],
    "鹤庆县": ["古城区", "玉龙纳西族自治县", "永胜县", "大理市", "宾川县", "洱源县", "剑川县"],

    // 德宏傣族景颇族自治州
    "瑞丽市": ["芒市", "陇川县"],
    "芒市": ["龙陵县", "瑞丽市", "梁河县", "陇川县"],
    "梁河县": ["龙陵县", "腾冲市", "芒市", "盈江县", "陇川县"],
    "盈江县": ["腾冲市", "梁河县", "陇川县"],
    "陇川县": ["瑞丽市", "芒市", "梁河县", "盈江县"],

    // 怒江傈僳族自治州
    "泸水市": ["隆阳区", "腾冲市", "云龙县", "福贡县", "兰坪白族普米族自治县"],
    "福贡县": ["泸水市", "贡山独龙族怒族自治县", "兰坪白族普米族自治县", "维西傈僳族自治县"],
    "贡山独龙族怒族自治县": ["福贡县", "德钦县", "维西傈僳族自治县", "察隅县"],
    "兰坪白族普米族自治县": ["玉龙纳西族自治县", "云龙县", "剑川县", "泸水市", "福贡县", "维西傈僳族自治县"],

    // 迪庆藏族自治州
    "香格里拉市": ["乡城县", "稻城县", "得荣县", "木里藏族自治县", "玉龙纳西族自治县", "德钦县", "维西傈僳族自治县"],
    "德钦县": ["巴塘县", "得荣县", "贡山独龙族怒族自治县", "香格里拉市", "维西傈僳族自治县", "左贡县", "芒康县", "察隅县"],
    "维西傈僳族自治县": ["玉龙纳西族自治县", "福贡县", "贡山独龙族怒族自治县", "兰坪白族普米族自治县", "香格里拉市", "德钦县"],


    // ==================== 西藏自治区 ====================
    // 拉萨市
    "城关区（拉萨市）": ["堆龙德庆区", "达孜区", "林周县", "扎囊县", "贡嘎县"],
    "堆龙德庆区": ["城关区（拉萨市）", "林周县", "当雄县", "曲水县", "贡嘎县"],
    "达孜区": ["城关区（拉萨市）", "林周县", "墨竹工卡县", "扎囊县"],
    "林周县": ["城关区（拉萨市）", "堆龙德庆区", "达孜区", "当雄县", "墨竹工卡县", "嘉黎县"],
    "当雄县": ["堆龙德庆区", "林周县", "尼木县", "曲水县", "色尼区", "嘉黎县", "班戈县"],
    "尼木县": ["当雄县", "曲水县", "南木林县", "仁布县", "浪卡子县", "班戈县"],
    "曲水县": ["堆龙德庆区", "当雄县", "尼木县", "贡嘎县", "浪卡子县"],
    "墨竹工卡县": ["达孜区", "林周县", "工布江达县", "乃东区", "扎囊县", "桑日县", "嘉黎县"],

    // 日喀则市
    "桑珠孜区": ["南木林县", "江孜县", "萨迦县", "谢通门县", "白朗县", "仁布县"],
    "南木林县": ["尼木县", "桑珠孜区", "谢通门县", "仁布县", "申扎县", "班戈县"],
    "江孜县": ["桑珠孜区", "白朗县", "仁布县", "康马县", "浪卡子县"],
    "定日县": ["萨迦县", "拉孜县", "昂仁县", "定结县", "聂拉木县"],
    "萨迦县": ["桑珠孜区", "定日县", "拉孜县", "谢通门县", "白朗县", "定结县", "岗巴县"],
    "拉孜县": ["定日县", "萨迦县", "昂仁县", "谢通门县"],
    "昂仁县": ["定日县", "拉孜县", "谢通门县", "聂拉木县", "萨嘎县", "尼玛县", "措勤县"],
    "谢通门县": ["桑珠孜区", "南木林县", "萨迦县", "拉孜县", "昂仁县", "申扎县", "尼玛县"],
    "白朗县": ["桑珠孜区", "江孜县", "萨迦县", "康马县", "亚东县", "岗巴县"],
    "仁布县": ["尼木县", "桑珠孜区", "南木林县", "江孜县", "浪卡子县"],
    "康马县": ["江孜县", "白朗县", "亚东县", "浪卡子县"],
    "定结县": ["定日县", "萨迦县", "岗巴县"],
    "仲巴县": ["萨嘎县", "普兰县", "革吉县", "改则县", "措勤县"],
    "亚东县": ["白朗县", "康马县", "岗巴县"],
    "吉隆县": ["聂拉木县", "萨嘎县"],
    "聂拉木县": ["定日县", "昂仁县", "吉隆县", "萨嘎县"],
    "萨嘎县": ["昂仁县", "仲巴县", "吉隆县", "聂拉木县", "措勤县"],
    "岗巴县": ["萨迦县", "白朗县", "定结县", "亚东县"],

    // 昌都市
    "卡若区": ["江达县", "贡觉县", "类乌齐县", "察雅县", "八宿县", "玉树市", "囊谦县"],
    "江达县": ["德格县", "白玉县", "石渠县", "卡若区", "贡觉县", "玉树市"],
    "贡觉县": ["白玉县", "巴塘县", "卡若区", "江达县", "察雅县", "芒康县"],
    "类乌齐县": ["卡若区", "丁青县", "八宿县", "洛隆县", "囊谦县"],
    "丁青县": ["类乌齐县", "洛隆县", "边坝县", "索县", "巴青县", "杂多县", "囊谦县"],
    "察雅县": ["卡若区", "贡觉县", "八宿县", "左贡县", "芒康县"],
    "八宿县": ["卡若区", "类乌齐县", "察雅县", "左贡县", "洛隆县", "波密县", "察隅县"],
    "左贡县": ["德钦县", "察雅县", "八宿县", "芒康县", "察隅县"],
    "芒康县": ["巴塘县", "德钦县", "贡觉县", "察雅县", "左贡县"],
    "洛隆县": ["类乌齐县", "丁青县", "八宿县", "边坝县", "波密县"],
    "边坝县": ["丁青县", "洛隆县", "波密县", "嘉黎县", "比如县", "索县"],

    // 林芝市
    "巴宜区": ["工布江达县", "墨脱县", "波密县", "米林市"],
    "工布江达县": ["墨竹工卡县", "巴宜区", "波密县", "朗县", "米林市", "桑日县", "加查县", "嘉黎县"],
    "墨脱县": ["巴宜区", "波密县", "察隅县", "米林市", "隆子县", "错那市"],
    "波密县": ["八宿县", "洛隆县", "边坝县", "巴宜区", "工布江达县", "墨脱县", "察隅县", "嘉黎县"],
    "察隅县": ["贡山独龙族怒族自治县", "德钦县", "八宿县", "左贡县", "墨脱县", "波密县"],
    "朗县": ["工布江达县", "米林市", "曲松县", "加查县", "隆子县"],
    "米林市": ["巴宜区", "工布江达县", "墨脱县", "朗县", "隆子县"],

    // 山南市
    "乃东区": ["墨竹工卡县", "扎囊县", "桑日县", "琼结县", "曲松县", "措美县", "隆子县"],
    "扎囊县": ["城关区（拉萨市）", "达孜区", "墨竹工卡县", "乃东区", "贡嘎县", "琼结县", "措美县", "浪卡子县"],
    "贡嘎县": ["城关区（拉萨市）", "堆龙德庆区", "曲水县", "扎囊县", "浪卡子县"],
    "桑日县": ["墨竹工卡县", "工布江达县", "乃东区", "曲松县", "加查县"],
    "琼结县": ["乃东区", "扎囊县", "措美县"],
    "曲松县": ["朗县", "乃东区", "桑日县", "加查县", "隆子县"],
    "措美县": ["乃东区", "扎囊县", "琼结县", "洛扎县", "隆子县", "浪卡子县", "错那市"],
    "洛扎县": ["措美县", "浪卡子县", "错那市"],
    "加查县": ["工布江达县", "朗县", "桑日县", "曲松县"],
    "隆子县": ["墨脱县", "朗县", "米林市", "乃东区", "曲松县", "措美县", "错那市"],
    "浪卡子县": ["尼木县", "曲水县", "江孜县", "仁布县", "康马县", "扎囊县", "贡嘎县", "措美县", "洛扎县"],
    "错那市": ["墨脱县", "措美县", "洛扎县", "隆子县"],

    // 那曲市
    "色尼区": ["当雄县", "嘉黎县", "比如县", "聂荣县", "安多县", "班戈县"],
    "嘉黎县": ["林周县", "当雄县", "墨竹工卡县", "边坝县", "工布江达县", "波密县", "色尼区", "比如县"],
    "比如县": ["边坝县", "色尼区", "嘉黎县", "聂荣县", "索县", "巴青县"],
    "聂荣县": ["色尼区", "比如县", "安多县", "巴青县", "杂多县", "格尔木市"],
    "安多县": ["色尼区", "聂荣县", "班戈县", "双湖县", "治多县", "格尔木市", "若羌县"],
    "申扎县": ["南木林县", "谢通门县", "班戈县", "尼玛县", "双湖县"],
    "索县": ["丁青县", "边坝县", "比如县", "巴青县"],
    "班戈县": ["当雄县", "尼木县", "南木林县", "色尼区", "安多县", "申扎县", "双湖县"],
    "巴青县": ["丁青县", "比如县", "聂荣县", "索县", "杂多县"],
    "尼玛县": ["昂仁县", "谢通门县", "申扎县", "双湖县", "改则县", "措勤县"],
    "双湖县": ["安多县", "申扎县", "班戈县", "尼玛县", "改则县", "若羌县", "且末县"],

    // 阿里地区
    "普兰县": ["仲巴县", "札达县", "噶尔县", "革吉县"],
    "札达县": ["普兰县", "噶尔县"],
    "噶尔县": ["普兰县", "札达县", "日土县", "革吉县"],
    "日土县": ["噶尔县", "革吉县", "改则县", "和田县", "策勒县", "于田县"],
    "革吉县": ["仲巴县", "普兰县", "噶尔县", "日土县", "改则县"],
    "改则县": ["仲巴县", "尼玛县", "双湖县", "日土县", "革吉县", "措勤县", "且末县", "于田县", "民丰县"],
    "措勤县": ["昂仁县", "仲巴县", "萨嘎县", "尼玛县", "改则县"],


    // ==================== 陕西省 ====================
    // 西安市
    "新城区（西安市）": ["碑林区", "莲湖区", "灞桥区", "未央区", "雁塔区"],
    "碑林区": ["新城区（西安市）", "莲湖区", "雁塔区"],
    "莲湖区": ["新城区（西安市）", "碑林区", "未央区", "雁塔区"],
    "灞桥区": ["新城区（西安市）", "未央区", "雁塔区", "临潼区", "长安区（西安市）", "高陵区", "蓝田县"],
    "未央区": ["新城区（西安市）", "莲湖区", "灞桥区", "雁塔区", "长安区（西安市）", "高陵区", "秦都区", "渭城区"],
    "雁塔区": ["新城区（西安市）", "碑林区", "莲湖区", "灞桥区", "未央区", "长安区（西安市）"],
    "阎良区": ["临潼区", "三原县", "临渭区", "富平县"],
    "临潼区": ["灞桥区", "阎良区", "高陵区", "蓝田县", "三原县", "临渭区"],
    "长安区（西安市）": ["灞桥区", "未央区", "雁塔区", "鄠邑区", "蓝田县", "秦都区", "宁陕县", "柞水县"],
    "高陵区": ["灞桥区", "未央区", "临潼区", "渭城区", "三原县", "泾阳县"],
    "鄠邑区": ["长安区（西安市）", "周至县", "秦都区", "兴平市", "宁陕县"],
    "蓝田县": ["灞桥区", "临潼区", "长安区（西安市）", "临渭区", "华州区", "商州区", "洛南县", "柞水县"],
    "周至县": ["鄠邑区", "眉县", "太白县", "杨陵区", "武功县", "兴平市", "佛坪县", "宁陕县"],

    // 铜川市
    "王益区": ["印台区", "耀州区", "富平县"],
    "印台区": ["王益区", "耀州区", "宜君县", "旬邑县", "蒲城县", "白水县", "富平县", "黄陵县"],
    "耀州区": ["王益区", "印台区", "三原县", "旬邑县", "淳化县", "富平县"],
    "宜君县": ["印台区", "白水县", "洛川县", "黄陵县"],

    // 宝鸡市
    "渭滨区": ["金台区", "陈仓区", "凤县", "太白县"],
    "金台区": ["渭滨区", "陈仓区"],
    "陈仓区": ["渭滨区", "金台区", "凤翔区", "岐山县", "陇县", "千阳县", "凤县", "太白县", "麦积区", "清水县"],
    "凤翔区": ["陈仓区", "岐山县", "千阳县", "麟游县"],
    "岐山县": ["陈仓区", "凤翔区", "扶风县", "眉县", "麟游县", "太白县"],
    "扶风县": ["岐山县", "眉县", "麟游县", "杨陵区", "乾县", "永寿县", "武功县"],
    "眉县": ["周至县", "岐山县", "扶风县", "太白县", "杨陵区"],
    "陇县": ["陈仓区", "千阳县", "清水县", "张家川回族自治县", "灵台县", "崇信县", "华亭市"],
    "千阳县": ["陈仓区", "凤翔区", "陇县", "麟游县", "灵台县"],
    "麟游县": ["凤翔区", "岐山县", "扶风县", "千阳县", "乾县", "永寿县", "彬州市", "灵台县"],
    "凤县": ["渭滨区", "陈仓区", "太白县", "勉县", "留坝县", "麦积区", "两当县"],
    "太白县": ["周至县", "渭滨区", "陈仓区", "岐山县", "眉县", "凤县", "洋县", "留坝县", "佛坪县"],

    // 咸阳市
    "秦都区": ["未央区", "长安区（西安市）", "鄠邑区", "渭城区", "礼泉县", "兴平市"],
    "杨陵区": ["周至县", "扶风县", "眉县", "武功县"],
    "渭城区": ["未央区", "高陵区", "秦都区", "泾阳县", "礼泉县"],
    "三原县": ["阎良区", "临潼区", "高陵区", "耀州区", "泾阳县", "淳化县", "富平县"],
    "泾阳县": ["高陵区", "渭城区", "三原县", "礼泉县", "淳化县"],
    "乾县": ["扶风县", "麟游县", "礼泉县", "永寿县", "武功县", "兴平市"],
    "礼泉县": ["秦都区", "渭城区", "泾阳县", "乾县", "永寿县", "淳化县", "兴平市"],
    "永寿县": ["扶风县", "麟游县", "乾县", "礼泉县", "淳化县", "彬州市"],
    "长武县": ["彬州市", "泾川县", "灵台县", "正宁县", "宁县"],
    "旬邑县": ["印台区", "耀州区", "淳化县", "彬州市", "黄陵县", "正宁县"],
    "淳化县": ["耀州区", "三原县", "泾阳县", "礼泉县", "永寿县", "旬邑县", "彬州市"],
    "武功县": ["周至县", "扶风县", "杨陵区", "乾县", "兴平市"],
    "兴平市": ["鄠邑区", "周至县", "秦都区", "乾县", "礼泉县", "武功县"],
    "彬州市": ["麟游县", "永寿县", "长武县", "旬邑县", "淳化县", "灵台县", "正宁县"],

    // 渭南市
    "临渭区": ["阎良区", "临潼区", "蓝田县", "华州区", "大荔县", "蒲城县", "富平县"],
    "华州区": ["蓝田县", "临渭区", "大荔县", "华阴市", "洛南县"],
    "潼关县": ["芮城县", "灵宝市", "大荔县", "华阴市", "洛南县"],
    "大荔县": ["芮城县", "永济市", "临渭区", "华州区", "潼关县", "合阳县", "澄城县", "蒲城县", "华阴市"],
    "合阳县": ["临猗县", "万荣县", "永济市", "大荔县", "澄城县", "韩城市", "黄龙县"],
    "澄城县": ["大荔县", "合阳县", "蒲城县", "白水县", "黄龙县"],
    "蒲城县": ["印台区", "临渭区", "大荔县", "澄城县", "白水县", "富平县"],
    "白水县": ["印台区", "宜君县", "澄城县", "蒲城县", "洛川县", "黄龙县"],
    "富平县": ["阎良区", "王益区", "印台区", "耀州区", "三原县", "临渭区", "蒲城县"],
    "韩城市": ["万荣县", "河津市", "乡宁县", "合阳县", "宜川县", "黄龙县"],
    "华阴市": ["华州区", "潼关县", "大荔县", "洛南县"],

    // 延安市
    "宝塔区": ["安塞区", "延长县", "延川县", "甘泉县", "富县", "宜川县", "子长市"],
    "安塞区": ["宝塔区", "志丹县", "甘泉县", "子长市", "靖边县"],
    "延长县": ["吉县", "大宁县", "永和县", "宝塔区", "延川县", "宜川县"],
    "延川县": ["永和县", "石楼县", "宝塔区", "延长县", "子长市", "清涧县"],
    "志丹县": ["安塞区", "吴起县", "甘泉县", "富县", "靖边县", "华池县", "合水县"],
    "吴起县": ["志丹县", "靖边县", "定边县", "华池县"],
    "甘泉县": ["宝塔区", "安塞区", "志丹县", "富县"],
    "富县": ["宝塔区", "志丹县", "甘泉县", "洛川县", "宜川县", "黄陵县", "合水县", "宁县"],
    "洛川县": ["宜君县", "白水县", "富县", "宜川县", "黄龙县", "黄陵县"],
    "宜川县": ["吉县", "乡宁县", "韩城市", "宝塔区", "延长县", "富县", "洛川县", "黄龙县"],
    "黄龙县": ["合阳县", "澄城县", "白水县", "韩城市", "洛川县", "宜川县"],
    "黄陵县": ["印台区", "宜君县", "旬邑县", "富县", "洛川县", "正宁县", "宁县"],
    "子长市": ["宝塔区", "安塞区", "延川县", "横山区", "靖边县", "清涧县", "子洲县"],

    // 汉中市
    "汉台区": ["南郑区", "城固县", "勉县", "留坝县"],
    "南郑区": ["旺苍县", "通江县", "南江县", "汉台区", "城固县", "西乡县", "勉县", "宁强县"],
    "城固县": ["汉台区", "南郑区", "洋县", "西乡县", "留坝县"],
    "洋县": ["太白县", "城固县", "西乡县", "留坝县", "佛坪县", "石泉县"],
    "西乡县": ["通江县", "南郑区", "城固县", "洋县", "镇巴县", "汉阴县", "石泉县"],
    "勉县": ["凤县", "汉台区", "南郑区", "宁强县", "略阳县", "留坝县", "两当县"],
    "宁强县": ["朝天区", "旺苍县", "青川县", "南郑区", "勉县", "略阳县", "武都区", "康县"],
    "略阳县": ["勉县", "宁强县", "成县", "康县", "徽县", "两当县"],
    "镇巴县": ["万源市", "通江县", "西乡县", "汉阴县", "紫阳县"],
    "留坝县": ["凤县", "太白县", "汉台区", "城固县", "洋县", "勉县"],
    "佛坪县": ["周至县", "太白县", "洋县", "石泉县", "宁陕县"],

    // 榆林市
    "榆阳区": ["乌审旗", "横山区", "米脂县", "佳县", "神木市"],
    "横山区": ["乌审旗", "子长市", "榆阳区", "靖边县", "米脂县", "子洲县"],
    "府谷县": ["河曲县", "保德县", "兴县", "准格尔旗", "伊金霍洛旗", "神木市"],
    "靖边县": ["鄂托克前旗", "乌审旗", "安塞区", "志丹县", "吴起县", "子长市", "横山区", "定边县"],
    "定边县": ["鄂托克前旗", "吴起县", "靖边县", "环县", "华池县", "盐池县"],
    "绥德县": ["柳林县", "米脂县", "佳县", "吴堡县", "清涧县", "子洲县"],
    "米脂县": ["榆阳区", "横山区", "绥德县", "佳县", "子洲县"],
    "佳县": ["临县", "榆阳区", "绥德县", "米脂县", "吴堡县", "神木市"],
    "吴堡县": ["临县", "柳林县", "绥德县", "佳县"],
    "清涧县": ["柳林县", "石楼县", "延川县", "子长市", "绥德县", "子洲县"],
    "子洲县": ["子长市", "横山区", "绥德县", "米脂县", "清涧县"],
    "神木市": ["兴县", "临县", "乌审旗", "伊金霍洛旗", "榆阳区", "府谷县", "佳县"],
    
    // 安康市
    "汉滨区": ["汉阴县", "宁陕县", "紫阳县", "岚皋县", "平利县", "旬阳市", "镇安县"],
    "汉阴县": ["西乡县", "镇巴县", "汉滨区", "石泉县", "宁陕县", "紫阳县"],
    "石泉县": ["洋县", "西乡县", "佛坪县", "汉阴县", "宁陕县"],
    "宁陕县": ["长安区（西安市）", "鄠邑区", "周至县", "佛坪县", "汉滨区", "汉阴县", "石泉县", "镇安县", "柞水县"],
    "紫阳县": ["城口县", "万源市", "镇巴县", "汉滨区", "汉阴县", "岚皋县"],
    "岚皋县": ["城口县", "汉滨区", "紫阳县", "平利县"],
    "平利县": ["竹溪县", "城口县", "汉滨区", "岚皋县", "镇坪县", "旬阳市"],
    "镇坪县": ["竹溪县", "城口县", "巫溪县", "平利县"],
    "白河县": ["郧阳区", "郧西县", "竹山县", "旬阳市"],
    "旬阳市": ["郧西县", "竹山县", "竹溪县", "汉滨区", "平利县", "白河县", "镇安县"],

    // 商洛市
    "商州区": ["蓝田县", "洛南县", "丹凤县", "山阳县", "柞水县"],
    "洛南县": ["卢氏县", "灵宝市", "蓝田县", "华州区", "潼关县", "华阴市", "商州区", "丹凤县"],
    "丹凤县": ["卢氏县", "商州区", "洛南县", "商南县", "山阳县"],
    "商南县": ["卢氏县", "西峡县", "淅川县", "郧阳区", "郧西县", "丹凤县", "山阳县"],
    "山阳县": ["郧西县", "商州区", "丹凤县", "商南县", "镇安县", "柞水县"],
    "镇安县": ["郧西县", "汉滨区", "宁陕县", "旬阳市", "山阳县", "柞水县"],
    "柞水县": ["长安区（西安市）", "蓝田县", "宁陕县", "商州区", "山阳县", "镇安县"],

    
    // ==================== 甘肃省 ====================
    // 兰州市
    "城关区（兰州市）": ["七里河区", "安宁区", "皋兰县", "榆中县"],
    "七里河区": ["城关区（兰州市）", "西固区", "安宁区", "榆中县", "临洮县", "永靖县"],
    "西固区": ["七里河区", "安宁区", "红古区", "永登县", "永靖县"],
    "安宁区": ["城关区（兰州市）", "七里河区", "西固区", "永登县", "皋兰县"],
    "红古区": ["西固区", "永登县", "永靖县", "民和回族土族自治县"],
    "永登县": ["西固区", "安宁区", "红古区", "皋兰县", "景泰县", "天祝藏族自治县", "乐都区", "民和回族土族自治县", "互助土族自治县"],
    "皋兰县": ["城关区（兰州市）", "安宁区", "永登县", "榆中县", "白银区", "景泰县", "天祝藏族自治县"],
    "榆中县": ["城关区（兰州市）", "七里河区", "皋兰县", "白银区", "靖远县", "会宁县", "安定区", "临洮县"],

    // 嘉峪关市
    "嘉峪关市": ["肃南裕固族自治县", "肃州区", "金塔县", "玉门市"],

    // 金昌市
    "金川区": ["阿拉善右旗", "永昌县", "民勤县", "山丹县"],
    "永昌县": ["金川区", "凉州区", "民勤县", "肃南裕固族自治县", "山丹县"],

    // 白银市
    "白银区": ["皋兰县", "榆中县", "靖远县", "景泰县"],
    "平川区": ["靖远县", "会宁县", "景泰县", "海原县"],
    "靖远县": ["榆中县", "白银区", "平川区", "会宁县", "景泰县", "沙坡头区"],
    "会宁县": ["榆中县", "平川区", "靖远县", "静宁县", "安定区", "通渭县", "西吉县", "海原县"],
    "景泰县": ["阿拉善左旗", "永登县", "皋兰县", "白银区", "平川区", "靖远县", "古浪县", "天祝藏族自治县", "沙坡头区"],

    // 天水市
    "秦州区": ["麦积区", "甘谷县", "西和县", "礼县", "徽县"],
    "麦积区": ["陈仓区", "凤县", "秦州区", "清水县", "秦安县", "甘谷县", "徽县", "两当县"],
    "清水县": ["陈仓区", "陇县", "麦积区", "秦安县", "张家川回族自治县"],
    "秦安县": ["麦积区", "清水县", "甘谷县", "张家川回族自治县", "庄浪县", "静宁县", "通渭县"],
    "甘谷县": ["秦州区", "麦积区", "秦安县", "武山县", "通渭县", "礼县"],
    "武山县": ["甘谷县", "通渭县", "陇西县", "漳县", "岷县", "礼县"],
    "张家川回族自治县": ["陇县", "清水县", "秦安县", "庄浪县", "华亭市"],

    // 武威市
    "凉州区": ["阿拉善左旗", "永昌县", "民勤县", "古浪县", "天祝藏族自治县", "肃南裕固族自治县"],
    "民勤县": ["阿拉善左旗", "阿拉善右旗", "金川区", "永昌县", "凉州区"],
    "古浪县": ["阿拉善左旗", "景泰县", "凉州区", "天祝藏族自治县"],
    "天祝藏族自治县": ["永登县", "皋兰县", "景泰县", "凉州区", "古浪县", "肃南裕固族自治县", "互助土族自治县", "门源回族自治县"],

    // 张掖市
    "甘州区": ["阿拉善右旗", "肃南裕固族自治县", "民乐县", "临泽县", "山丹县"],
    "肃南裕固族自治县": ["嘉峪关市", "永昌县", "凉州区", "天祝藏族自治县", "甘州区", "民乐县", "临泽县", "高台县", "山丹县", "肃州区", "肃北蒙古族自治县", "玉门市", "门源回族自治县", "祁连县", "天峻县"],
    "民乐县": ["甘州区", "肃南裕固族自治县", "山丹县", "祁连县"],
    "临泽县": ["阿拉善右旗", "甘州区", "肃南裕固族自治县", "高台县"],
    "高台县": ["阿拉善右旗", "肃南裕固族自治县", "临泽县", "肃州区", "金塔县"],
    "山丹县": ["阿拉善右旗", "金川区", "永昌县", "甘州区", "肃南裕固族自治县", "民乐县", "门源回族自治县", "祁连县"],

    // 平凉市
    "崆峒区": ["泾川县", "崇信县", "华亭市", "镇原县", "泾源县", "彭阳县"],
    "泾川县": ["长武县", "崆峒区", "灵台县", "崇信县", "西峰区", "宁县", "镇原县"],
    "灵台县": ["陇县", "千阳县", "麟游县", "长武县", "彬州市", "泾川县", "崇信县"],
    "崇信县": ["陇县", "崆峒区", "泾川县", "灵台县", "华亭市"],
    "庄浪县": ["秦安县", "张家川回族自治县", "静宁县", "华亭市", "隆德县", "泾源县"],
    "静宁县": ["会宁县", "秦安县", "庄浪县", "通渭县", "西吉县", "隆德县"],
    "华亭市": ["陇县", "张家川回族自治县", "崆峒区", "崇信县", "庄浪县", "泾源县"],

    // 酒泉市
    "肃州区": ["嘉峪关市", "肃南裕固族自治县", "高台县", "金塔县"],
    "金塔县": ["阿拉善右旗", "额济纳旗", "嘉峪关市", "高台县", "肃州区", "玉门市"],
    "瓜州县": ["肃北蒙古族自治县", "玉门市", "敦煌市", "伊州区"],
    "肃北蒙古族自治县": ["额济纳旗", "肃南裕固族自治县", "瓜州县", "阿克塞哈萨克族自治县", "玉门市", "敦煌市", "德令哈市", "天峻县", "伊州区"],
    "阿克塞哈萨克族自治县": ["肃北蒙古族自治县", "敦煌市", "德令哈市", "茫崖市", "大柴旦行政委员会", "若羌县"],
    "玉门市": ["额济纳旗", "嘉峪关市", "肃南裕固族自治县", "金塔县", "瓜州县", "肃北蒙古族自治县"],
    "敦煌市": ["瓜州县", "肃北蒙古族自治县", "阿克塞哈萨克族自治县", "伊州区", "若羌县"],

    // 庆阳市
    "西峰区": ["泾川县", "庆城县", "合水县", "宁县", "镇原县"],
    "庆城县": ["西峰区", "环县", "华池县", "合水县", "镇原县"],
    "环县": ["定边县", "庆城县", "华池县", "镇原县", "盐池县", "同心县", "原州区", "彭阳县", "海原县"],
    "华池县": ["志丹县", "吴起县", "定边县", "庆城县", "环县", "合水县"],
    "合水县": ["志丹县", "富县", "西峰区", "庆城县", "华池县", "宁县"],
    "正宁县": ["长武县", "旬邑县", "彬州市", "黄陵县", "宁县"],
    "宁县": ["长武县", "富县", "黄陵县", "泾川县", "西峰区", "合水县", "正宁县"],
    "镇原县": ["崆峒区", "泾川县", "西峰区", "庆城县", "环县", "彭阳县"],

    // 定西市
    "安定区": ["榆中县", "会宁县", "通渭县", "陇西县", "渭源县", "临洮县"],
    "通渭县": ["会宁县", "秦安县", "甘谷县", "武山县", "静宁县", "安定区", "陇西县"],
    "陇西县": ["武山县", "安定区", "通渭县", "渭源县", "漳县"],
    "渭源县": ["安定区", "陇西县", "临洮县", "漳县", "康乐县", "临潭县", "卓尼县"],
    "临洮县": ["七里河区", "榆中县", "安定区", "渭源县", "康乐县", "永靖县", "广河县", "东乡族自治县"],
    "漳县": ["武山县", "陇西县", "渭源县", "岷县", "卓尼县"],
    "岷县": ["武山县", "漳县", "宕昌县", "礼县", "临潭县", "卓尼县", "迭部县"],

    // 陇南市
    "武都区": ["青川县", "宁强县", "成县", "文县", "宕昌县", "康县", "西和县", "礼县", "舟曲县"],
    "成县": ["略阳县", "武都区", "康县", "西和县", "徽县"],
    "文县": ["平武县", "青川县", "九寨沟县", "武都区", "舟曲县"],
    "宕昌县": ["岷县", "武都区", "礼县", "舟曲县", "迭部县"],
    "康县": ["宁强县", "略阳县", "武都区", "成县"],
    "西和县": ["秦州区", "武都区", "成县", "礼县", "徽县"],
    "礼县": ["秦州区", "甘谷县", "武山县", "岷县", "武都区", "宕昌县", "西和县"],
    "徽县": ["略阳县", "秦州区", "麦积区", "成县", "西和县", "两当县"],
    "两当县": ["凤县", "勉县", "略阳县", "麦积区", "徽县"],

    // 临夏回族自治州
    "临夏市": ["临夏县", "东乡族自治县"],
    "临夏县": ["临夏市", "永靖县", "和政县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县", "合作市", "夏河县", "循化撒拉族自治县"],
    "康乐县": ["渭源县", "临洮县", "广河县", "和政县", "临潭县"],
    "永靖县": ["七里河区", "西固区", "红古区", "临洮县", "临夏县", "东乡族自治县", "积石山保安族东乡族撒拉族自治县", "民和回族土族自治县"],
    "广河县": ["临洮县", "康乐县", "和政县", "东乡族自治县"],
    "和政县": ["临夏县", "康乐县", "广河县", "东乡族自治县", "合作市", "临潭县", "卓尼县"],
    "东乡族自治县": ["临洮县", "临夏市", "临夏县", "永靖县", "广河县", "和政县"],
    "积石山保安族东乡族撒拉族自治县": ["临夏县", "永靖县", "民和回族土族自治县", "循化撒拉族自治县"],

    // 甘南藏族自治州
    "合作市": ["临夏县", "和政县", "卓尼县", "碌曲县", "夏河县"],
    "临潭县": ["渭源县", "岷县", "康乐县", "和政县", "卓尼县"],
    "卓尼县": ["若尔盖县", "渭源县", "漳县", "岷县", "和政县", "合作市", "临潭县", "迭部县", "碌曲县"],
    "舟曲县": ["九寨沟县", "武都区", "文县", "宕昌县", "迭部县"],
    "迭部县": ["九寨沟县", "若尔盖县", "岷县", "宕昌县", "卓尼县", "舟曲县"],
    "玛曲县": ["阿坝县", "若尔盖县", "碌曲县", "河南蒙古族自治县", "玛沁县", "甘德县", "久治县"],
    "碌曲县": ["若尔盖县", "合作市", "卓尼县", "玛曲县", "夏河县", "河南蒙古族自治县"],
    "夏河县": ["临夏县", "合作市", "碌曲县", "循化撒拉族自治县", "同仁市", "泽库县", "河南蒙古族自治县"],


    // ==================== 青海省 ====================
    // 西宁市
    "城东区": ["城中区（西宁市）", "城北区", "湟中区", "平安区", "互助土族自治县"],
    "城中区（西宁市）": ["城东区", "城西区", "城北区", "湟中区"],
    "城西区": ["城中区（西宁市）", "城北区", "湟中区"],
    "城北区": ["城东区", "城中区（西宁市）", "城西区", "湟中区", "大通回族土族自治县", "互助土族自治县"],
    "湟中区": ["城东区", "城中区（西宁市）", "城西区", "城北区", "大通回族土族自治县", "湟源县", "平安区", "化隆回族自治县", "海晏县", "贵德县"],
    "大通回族土族自治县": ["城北区", "湟中区", "互助土族自治县", "门源回族自治县", "祁连县", "海晏县"],
    "湟源县": ["湟中区", "海晏县", "共和县", "贵德县"],

    // 海东市
    "乐都区": ["永登县", "平安区", "民和回族土族自治县", "互助土族自治县", "化隆回族自治县"],
    "平安区": ["城东区", "湟中区", "乐都区", "互助土族自治县", "化隆回族自治县"],
    "民和回族土族自治县": ["红古区", "永登县", "永靖县", "积石山保安族东乡族撒拉族自治县", "乐都区", "化隆回族自治县", "循化撒拉族自治县"],
    "互助土族自治县": ["永登县", "天祝藏族自治县", "城东区", "城北区", "大通回族土族自治县", "乐都区", "平安区", "门源回族自治县"],
    "化隆回族自治县": ["湟中区", "乐都区", "平安区", "民和回族土族自治县", "循化撒拉族自治县", "尖扎县", "贵德县"],
    "循化撒拉族自治县": ["临夏县", "积石山保安族东乡族撒拉族自治县", "夏河县", "民和回族土族自治县", "化隆回族自治县", "同仁市", "尖扎县"],

    // 海北藏族自治州
    "门源回族自治县": ["天祝藏族自治县", "肃南裕固族自治县", "山丹县", "大通回族土族自治县", "互助土族自治县", "祁连县"],
    "祁连县": ["肃南裕固族自治县", "民乐县", "山丹县", "大通回族土族自治县", "门源回族自治县", "海晏县", "刚察县", "天峻县"],
    "海晏县": ["湟中区", "大通回族土族自治县", "湟源县", "祁连县", "刚察县", "共和县"],
    "刚察县": ["祁连县", "海晏县", "共和县", "天峻县"],

    // 黄南藏族自治州
    "同仁市": ["夏河县", "循化撒拉族自治县", "尖扎县", "泽库县", "贵德县"],
    "尖扎县": ["化隆回族自治县", "循化撒拉族自治县", "同仁市", "贵德县"],
    "泽库县": ["夏河县", "同仁市", "河南蒙古族自治县", "同德县", "贵德县", "贵南县"],
    "河南蒙古族自治县": ["玛曲县", "碌曲县", "夏河县", "泽库县", "同德县", "玛沁县"],

    // 海南藏族自治州
    "共和县": ["湟源县", "海晏县", "刚察县", "贵德县", "兴海县", "贵南县", "乌兰县", "都兰县", "天峻县"],
    "同德县": ["泽库县", "河南蒙古族自治县", "兴海县", "贵南县", "玛沁县"],
    "贵德县": ["湟中区", "湟源县", "化隆回族自治县", "同仁市", "尖扎县", "泽库县", "共和县", "贵南县"],
    "兴海县": ["共和县", "同德县", "贵南县", "玛沁县", "玛多县", "都兰县"],
    "贵南县": ["泽库县", "共和县", "同德县", "贵德县", "兴海县"],

    // 果洛藏族自治州
    "玛沁县": ["玛曲县", "河南蒙古族自治县", "同德县", "兴海县", "甘德县", "达日县", "玛多县"],
    "班玛县": ["壤塘县", "阿坝县", "色达县", "达日县", "久治县"],
    "甘德县": ["玛曲县", "玛沁县", "达日县", "久治县"],
    "达日县": ["甘孜县", "石渠县", "色达县", "玛沁县", "班玛县", "甘德县", "久治县", "玛多县"],
    "久治县": ["阿坝县", "玛曲县", "班玛县", "甘德县", "达日县"],
    "玛多县": ["石渠县", "兴海县", "玛沁县", "达日县", "称多县", "曲麻莱县", "都兰县"],

    // 玉树藏族自治州
    "玉树市": ["石渠县", "卡若区", "江达县", "杂多县", "称多县", "治多县", "囊谦县", "曲麻莱县"],
    "杂多县": ["丁青县", "聂荣县", "巴青县", "玉树市", "治多县", "囊谦县", "格尔木市"],
    "称多县": ["石渠县", "玛多县", "玉树市", "曲麻莱县"],
    "治多县": ["安多县", "玉树市", "杂多县", "曲麻莱县", "格尔木市", "若羌县"],
    "囊谦县": ["卡若区", "类乌齐县", "丁青县", "玉树市", "杂多县"],
    "曲麻莱县": ["玛多县", "玉树市", "称多县", "治多县", "格尔木市", "都兰县"],

    // 海西蒙古族藏族自治州
    "格尔木市": ["聂荣县", "安多县", "杂多县", "治多县", "曲麻莱县", "茫崖市", "都兰县", "大柴旦行政委员会", "若羌县"],
    "德令哈市": ["肃北蒙古族自治县", "阿克塞哈萨克族自治县", "乌兰县", "都兰县", "天峻县", "大柴旦行政委员会"],
    "茫崖市": ["阿克塞哈萨克族自治县", "格尔木市", "大柴旦行政委员会", "若羌县"],
    "乌兰县": ["共和县", "德令哈市", "都兰县", "天峻县"],
    "都兰县": ["共和县", "兴海县", "玛多县", "曲麻莱县", "格尔木市", "德令哈市", "乌兰县", "大柴旦行政委员会"],
    "天峻县": ["肃南裕固族自治县", "肃北蒙古族自治县", "祁连县", "刚察县", "共和县", "德令哈市", "乌兰县"],
    "大柴旦行政委员会": ["阿克塞哈萨克族自治县", "格尔木市", "德令哈市", "茫崖市", "都兰县"],


    // ==================== 宁夏回族自治区 ====================
    // 银川市
    "兴庆区": ["鄂托克前旗", "金凤区", "永宁县", "贺兰县", "灵武市", "平罗县"],
    "西夏区": ["阿拉善左旗", "金凤区", "永宁县", "贺兰县"],
    "金凤区": ["兴庆区", "西夏区", "永宁县", "贺兰县"],
    "永宁县": ["阿拉善左旗", "兴庆区", "西夏区", "金凤区", "灵武市", "青铜峡市"],
    "贺兰县": ["阿拉善左旗", "兴庆区", "西夏区", "金凤区", "平罗县"],
    "灵武市": ["鄂托克前旗", "兴庆区", "永宁县", "利通区", "红寺堡区", "盐池县", "青铜峡市"],

    // 石嘴山市
    "大武口区": ["阿拉善左旗", "惠农区", "平罗县"],
    "惠农区": ["海南区", "阿拉善左旗", "大武口区", "平罗县"],
    "平罗县": ["海南区", "鄂托克前旗", "鄂托克旗", "阿拉善左旗", "兴庆区", "贺兰县", "大武口区", "惠农区"],

    // 吴忠市
    "利通区": ["灵武市", "红寺堡区", "青铜峡市"],
    "红寺堡区": ["灵武市", "利通区", "盐池县", "同心县", "青铜峡市", "中宁县"],
    "盐池县": ["鄂托克前旗", "定边县", "环县", "灵武市", "红寺堡区", "同心县"],
    "同心县": ["环县", "红寺堡区", "盐池县", "中宁县", "海原县"],
    "青铜峡市": ["阿拉善左旗", "永宁县", "灵武市", "利通区", "红寺堡区", "中宁县"],

    // 固原市
    "原州区": ["环县", "西吉县", "隆德县", "泾源县", "彭阳县", "海原县"],
    "西吉县": ["会宁县", "静宁县", "原州区", "隆德县", "海原县"],
    "隆德县": ["庄浪县", "静宁县", "原州区", "西吉县", "泾源县"],
    "泾源县": ["崆峒区", "庄浪县", "华亭市", "原州区", "隆德县", "彭阳县"],
    "彭阳县": ["崆峒区", "环县", "镇原县", "原州区", "泾源县"],

    // 中卫市
    "沙坡头区": ["阿拉善左旗", "靖远县", "景泰县", "中宁县", "海原县"],
    "中宁县": ["阿拉善左旗", "红寺堡区", "同心县", "青铜峡市", "沙坡头区", "海原县"],
    "海原县": ["平川区", "会宁县", "环县", "同心县", "原州区", "西吉县", "沙坡头区", "中宁县"],


    // ==================== 新疆维吾尔自治区 ====================
    // 乌鲁木齐市
    "天山区": ["沙依巴克区", "水磨沟区", "达坂城区", "乌鲁木齐县"],
    "沙依巴克区": ["天山区", "新市区", "水磨沟区", "头屯河区", "乌鲁木齐县"],
    "新市区": ["沙依巴克区", "水磨沟区", "头屯河区", "米东区", "昌吉市", "五家渠市"],
    "水磨沟区": ["天山区", "沙依巴克区", "新市区", "达坂城区", "米东区"],
    "头屯河区": ["沙依巴克区", "新市区", "乌鲁木齐县", "昌吉市"],
    "达坂城区": ["天山区", "水磨沟区", "米东区", "乌鲁木齐县", "高昌区", "托克逊县", "阜康市", "吉木萨尔县", "和静县"],
    "米东区": ["新市区", "水磨沟区", "达坂城区", "昌吉市", "阜康市", "福海县", "五家渠市"],
    "乌鲁木齐县": ["天山区", "沙依巴克区", "头屯河区", "达坂城区", "托克逊县", "昌吉市", "和静县"],

    // 克拉玛依市
    "独山子区": ["奎屯市", "乌苏市", "沙湾市"],
    "克拉玛依区": ["白碱滩区", "乌苏市", "沙湾市", "托里县", "和布克赛尔蒙古自治县", "胡杨河市"],
    "白碱滩区": ["克拉玛依区", "乌尔禾区", "托里县", "和布克赛尔蒙古自治县"],
    "乌尔禾区": ["白碱滩区", "托里县", "和布克赛尔蒙古自治县"],

    // 吐鲁番市
    "高昌区": ["达坂城区", "鄯善县", "托克逊县", "奇台县", "吉木萨尔县", "尉犁县"],
    "鄯善县": ["高昌区", "伊州区", "奇台县", "木垒哈萨克自治县", "若羌县"],
    "托克逊县": ["达坂城区", "乌鲁木齐县", "高昌区", "尉犁县", "和静县", "和硕县"],

    // 哈密市
    "伊州区": ["瓜州县", "肃北蒙古族自治县", "敦煌市", "鄯善县", "巴里坤哈萨克自治县", "伊吾县", "木垒哈萨克自治县", "若羌县", "新星市"],
    "巴里坤哈萨克自治县": ["伊州区", "伊吾县", "木垒哈萨克自治县"],
    "伊吾县": ["伊州区", "巴里坤哈萨克自治县"],

    // 昌吉回族自治州
    "昌吉市": ["新市区", "头屯河区", "米东区", "乌鲁木齐县", "呼图壁县", "和静县", "和布克赛尔蒙古自治县", "福海县", "五家渠市"],
    "阜康市": ["达坂城区", "米东区", "吉木萨尔县", "福海县"],
    "呼图壁县": ["昌吉市", "玛纳斯县", "和静县", "和布克赛尔蒙古自治县"],
    "玛纳斯县": ["呼图壁县", "和静县", "沙湾市", "和布克赛尔蒙古自治县", "石河子市"],
    "奇台县": ["高昌区", "鄯善县", "吉木萨尔县", "木垒哈萨克自治县", "富蕴县", "青河县"],
    "吉木萨尔县": ["达坂城区", "高昌区", "阜康市", "奇台县", "富蕴县", "福海县"],
    "木垒哈萨克自治县": ["鄯善县", "伊州区", "巴里坤哈萨克自治县", "奇台县"],

    // 博尔塔拉蒙古自治州
    "博乐市": ["阿拉山口市", "精河县", "温泉县", "霍尔果斯市", "伊宁县", "霍城县", "双河市"],
    "阿拉山口市": ["博乐市", "精河县", "乌苏市", "托里县", "双河市"],
    "精河县": ["博乐市", "阿拉山口市", "伊宁县", "尼勒克县", "乌苏市", "双河市"],
    "温泉县": ["博乐市", "霍尔果斯市"],

    // 巴音郭楞蒙古自治州
    "库尔勒市": ["轮台县", "尉犁县", "焉耆回族自治县", "博湖县", "铁门关市"],
    "轮台县": ["库尔勒市", "尉犁县", "焉耆回族自治县", "和静县", "库车市"],
    "尉犁县": ["高昌区", "托克逊县", "库尔勒市", "轮台县", "若羌县", "且末县", "和硕县", "博湖县", "库车市", "沙雅县", "铁门关市"],
    "若羌县": ["安多县", "双湖县", "阿克塞哈萨克族自治县", "敦煌市", "治多县", "格尔木市", "茫崖市", "鄯善县", "伊州区", "尉犁县", "且末县", "铁门关市"],
    "且末县": ["双湖县", "改则县", "尉犁县", "若羌县", "沙雅县", "民丰县", "铁门关市"],
    "焉耆回族自治县": ["库尔勒市", "轮台县", "和静县", "博湖县", "铁门关市"],
    "和静县": ["达坂城区", "乌鲁木齐县", "托克逊县", "昌吉市", "呼图壁县", "玛纳斯县", "轮台县", "焉耆回族自治县", "和硕县", "库车市", "拜城县", "巩留县", "新源县", "特克斯县", "尼勒克县", "沙湾市", "铁门关市"],
    "和硕县": ["托克逊县", "尉犁县", "和静县", "博湖县", "铁门关市"],
    "博湖县": ["库尔勒市", "尉犁县", "焉耆回族自治县", "和硕县", "铁门关市"],

    // 阿克苏地区
    "阿克苏市": ["温宿县", "沙雅县", "新和县", "乌什县", "阿瓦提县", "柯坪县", "洛浦县", "策勒县", "阿拉尔市"],
    "库车市": ["轮台县", "尉犁县", "和静县", "沙雅县", "新和县", "拜城县"],
    "温宿县": ["阿克苏市", "新和县", "拜城县", "乌什县", "昭苏县", "阿拉尔市"],
    "沙雅县": ["尉犁县", "且末县", "阿克苏市", "库车市", "新和县", "策勒县", "于田县", "民丰县", "阿拉尔市"],
    "新和县": ["阿克苏市", "库车市", "温宿县", "沙雅县", "拜城县", "阿拉尔市"],
    "拜城县": ["和静县", "库车市", "温宿县", "新和县", "昭苏县", "特克斯县"],
    "乌什县": ["阿克苏市", "温宿县", "柯坪县", "阿合奇县", "阿拉尔市"],
    "阿瓦提县": ["阿克苏市", "柯坪县", "巴楚县", "墨玉县", "洛浦县", "阿拉尔市"],
    "柯坪县": ["阿克苏市", "乌什县", "阿瓦提县", "阿图什市", "阿合奇县", "巴楚县", "阿拉尔市"],

    // 克孜勒苏柯尔克孜自治州
    "阿图什市": ["柯坪县", "阿合奇县", "乌恰县", "喀什市", "疏附县", "伽师县", "巴楚县", "图木舒克市"],
    "阿克陶县": ["乌恰县", "疏附县", "疏勒县", "英吉沙县", "莎车县", "塔什库尔干塔吉克自治县", "图木舒克市"],
    "阿合奇县": ["乌什县", "柯坪县", "阿图什市"],
    "乌恰县": ["阿图什市", "阿克陶县", "疏附县", "图木舒克市"],

    // 喀什地区
    "喀什市": ["阿图什市", "疏附县", "疏勒县", "伽师县"],
    "疏附县": ["阿图什市", "阿克陶县", "乌恰县", "喀什市", "疏勒县", "图木舒克市"],
    "疏勒县": ["阿克陶县", "喀什市", "疏附县", "英吉沙县", "岳普湖县", "伽师县", "图木舒克市"],
    "英吉沙县": ["阿克陶县", "疏勒县", "莎车县", "岳普湖县", "图木舒克市"],
    "泽普县": ["莎车县", "叶城县"],
    "莎车县": ["阿克陶县", "英吉沙县", "泽普县", "叶城县", "麦盖提县", "岳普湖县", "巴楚县", "塔什库尔干塔吉克自治县", "图木舒克市"],
    "叶城县": ["泽普县", "莎车县", "麦盖提县", "塔什库尔干塔吉克自治县", "皮山县", "图木舒克市"],
    "麦盖提县": ["莎车县", "叶城县", "巴楚县", "皮山县", "图木舒克市"],
    "岳普湖县": ["疏勒县", "英吉沙县", "莎车县", "伽师县", "巴楚县", "塔什库尔干塔吉克自治县", "图木舒克市"],
    "伽师县": ["阿图什市", "喀什市", "疏勒县", "岳普湖县", "巴楚县", "图木舒克市"],
    "巴楚县": ["阿瓦提县", "柯坪县", "阿图什市", "莎车县", "麦盖提县", "岳普湖县", "伽师县", "墨玉县", "皮山县", "图木舒克市"],
    "塔什库尔干塔吉克自治县": ["阿克陶县", "莎车县", "叶城县", "岳普湖县"],

    // 和田地区
    "和田市": ["和田县", "洛浦县"],
    "和田县": ["日土县", "和田市", "墨玉县", "皮山县", "洛浦县", "策勒县"],
    "墨玉县": ["阿瓦提县", "巴楚县", "和田县", "皮山县", "洛浦县", "昆玉市"],
    "皮山县": ["叶城县", "麦盖提县", "巴楚县", "和田县", "墨玉县", "昆玉市"],
    "洛浦县": ["阿克苏市", "阿瓦提县", "和田市", "和田县", "墨玉县", "策勒县"],
    "策勒县": ["日土县", "阿克苏市", "沙雅县", "和田县", "洛浦县", "于田县", "昆玉市"],
    "于田县": ["日土县", "改则县", "沙雅县", "策勒县", "民丰县"],
    "民丰县": ["改则县", "且末县", "沙雅县", "于田县"],

    // 伊犁哈萨克自治州
    "伊宁市": ["伊宁县", "察布查尔锡伯自治县", "霍城县", "可克达拉市"],
    "奎屯市": ["独山子区", "乌苏市", "沙湾市", "胡杨河市"],
    "霍尔果斯市": ["博乐市", "温泉县", "霍城县", "可克达拉市"],
    "伊宁县": ["博乐市", "精河县", "伊宁市", "察布查尔锡伯自治县", "霍城县", "巩留县", "尼勒克县"],
    "察布查尔锡伯自治县": ["伊宁市", "伊宁县", "霍城县", "巩留县", "昭苏县", "特克斯县", "可克达拉市"],
    "霍城县": ["博乐市", "伊宁市", "霍尔果斯市", "伊宁县", "察布查尔锡伯自治县", "可克达拉市"],
    "巩留县": ["和静县", "伊宁县", "察布查尔锡伯自治县", "新源县", "特克斯县", "尼勒克县"],
    "新源县": ["和静县", "巩留县", "尼勒克县"],
    "昭苏县": ["温宿县", "拜城县", "察布查尔锡伯自治县", "特克斯县"],
    "特克斯县": ["和静县", "拜城县", "察布查尔锡伯自治县", "巩留县", "昭苏县"],
    "尼勒克县": ["精河县", "和静县", "伊宁县", "巩留县", "新源县", "乌苏市", "沙湾市"],

    // 塔城地区
    "塔城市": ["额敏县", "裕民县", "白杨市"],
    "乌苏市": ["独山子区", "克拉玛依区", "阿拉山口市", "精河县", "奎屯市", "尼勒克县", "沙湾市", "托里县", "胡杨河市"],
    "沙湾市": ["独山子区", "克拉玛依区", "玛纳斯县", "和静县", "奎屯市", "尼勒克县", "乌苏市", "和布克赛尔蒙古自治县", "石河子市", "胡杨河市"],
    "额敏县": ["塔城市", "托里县", "裕民县", "和布克赛尔蒙古自治县", "白杨市"],
    "托里县": ["克拉玛依区", "白碱滩区", "乌尔禾区", "阿拉山口市", "乌苏市", "额敏县", "裕民县", "和布克赛尔蒙古自治县"],
    "裕民县": ["塔城市", "额敏县", "托里县", "白杨市"],
    "和布克赛尔蒙古自治县": ["克拉玛依区", "白碱滩区", "乌尔禾区", "昌吉市", "呼图壁县", "玛纳斯县", "沙湾市", "额敏县", "托里县", "福海县", "吉木乃县"],

    // 阿勒泰地区
    "阿勒泰市": ["布尔津县", "福海县", "吉木乃县", "北屯市"],
    "布尔津县": ["阿勒泰市", "哈巴河县", "吉木乃县"],
    "富蕴县": ["奇台县", "吉木萨尔县", "福海县", "青河县"],
    "福海县": ["米东区", "昌吉市", "阜康市", "吉木萨尔县", "和布克赛尔蒙古自治县", "阿勒泰市", "富蕴县", "吉木乃县", "北屯市"],
    "哈巴河县": ["布尔津县", "吉木乃县"],
    "青河县": ["奇台县", "富蕴县"],
    "吉木乃县": ["和布克赛尔蒙古自治县", "阿勒泰市", "布尔津县", "福海县", "哈巴河县"],

    // 自治区直辖县级行政区划
    "石河子市": ["玛纳斯县", "沙湾市"],
    "阿拉尔市": ["阿克苏市", "温宿县", "沙雅县", "新和县", "乌什县", "阿瓦提县", "柯坪县"],
    "图木舒克市": ["阿图什市", "阿克陶县", "乌恰县", "疏附县", "疏勒县", "英吉沙县", "莎车县", "叶城县", "麦盖提县", "岳普湖县", "伽师县", "巴楚县"],
    "五家渠市": ["新市区", "米东区", "昌吉市"],
    "北屯市": ["阿勒泰市", "福海县"],
    "铁门关市": ["库尔勒市", "尉犁县", "若羌县", "且末县", "焉耆回族自治县", "和静县", "和硕县", "博湖县"],
    "双河市": ["博乐市", "阿拉山口市", "精河县"],
    "可克达拉市": ["伊宁市", "霍尔果斯市", "察布查尔锡伯自治县", "霍城县"],
    "昆玉市": ["墨玉县", "皮山县", "策勒县"],
    "胡杨河市": ["克拉玛依区", "奎屯市", "乌苏市", "沙湾市"],
    "新星市": ["伊州区"],
    "白杨市": ["塔城市", "额敏县", "裕民县"],

    "香港特别行政区": ["罗湖区", "福田区", "盐田区"],
    "澳门特别行政区": ["香洲区"]

    };
    // by Alphard_改革则吉ver 只在bilibili有账号